{
  "sectors": {
    "en": {
      "short_name": "Ενέργεια",
      "subtitle_name": "Ενέργειας",
      "name": "Τομέας Ενέργειας",
      "bootstrap_colour": "warning",
      "ects_per_semester": 15
    },
    "el": {
      "short_name": "Ηλεκτρονική",
      "subtitle_name": "Ηλεκτρονικής & Υπολογιστών",
      "name": "Τομέας Ηλεκτρονικής και Υπολογιστών",
      "bootstrap_colour": "success",
      "ects_total": 50
    },
    "tel": {
      "short_name": "Τηλεπικοινωνίες",
      "subtitle_name": "Τηλεπικοινωνιών",
      "name": "Τομέας Τηλεπικοινωνιών",
      "bootstrap_colour": "primary"
    }
  },
  "fake_sectors": {
    "economics": {
      "short_name": "Οικονομικά",
      "subtitle_name": "Οικονομικών",
      "name": "Οικονομικά",
      "bootstrap_colour": "info"
    }
  },
  "semesters": {
    "7": [
      {
        "code": "600196736",
        "humanCode": "061",
        "originalTitle": "Ακουστική",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196736",
        "professors": [
          "Δημήτριος Χρυσουλίδης",
          "Ιωάννης Ρέκανος"
        ],
        "description": {
          "syllabus": "Φυσική περιγραφή της διάδοσης ήχου στη θάλασσα. Εξίσωση ακουστικού κύματος. Ακτινική θεωρία και διάθλαση ακτίνων. Ανάκλαση και διάθλαση στη διαχωριστική επιφάνεια ρευστού- στερεού. Υποβρύχιος φυσικός κυματοδηγός. Παραξονική διάδοση κύματος. Θεωρία ορθογωνικών ρυθμών. Ταλαντώσεις μεμβράνης. Ακτινοβολία ακουστικών κυμάτων. Συστήματα ανίχνευσης ήχου και εξισώσεις sonar. Ακουστικοί μετατροπείς, ηχοβολείς και υδρόφωνα. Φαινόμενο Doppler. Σκέδαση και απορρόφηση του ήχου από φυσαλίδες αέρα στη θάλασσα.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, ο φοιτητής:\n1. Θα γνωρίζει τους μηχανισμούς παραγωγής, διάδοσης, ανάκλασης, διάθλασης, και σκέδασης ακουστικών κυμάτων σε ρευστά.\n2. Θα κατανοεί τη σημασία του ήχου ως μέσου ανίχνευσης, εποπτείας και επικοινωνίας στον υποθαλάσσιο χώρο.\n3. Θα αποκτήσει βασικές γνώσεις για τη λειτουργία του σόναρ, του ηχοβολέα και του υδροφώνου.\n4. Θα εξοικειωθεί με τα μαθηματικά των διαφόρων θεωριών διάδοσης του ήχου στον υδάτινο χώρο."
        },
        "name": "Ακουστική"
      },
      {
        "code": "600196742",
        "humanCode": "044",
        "originalTitle": "Ανάλυση Δεδομένων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196742",
        "professors": [
          "Δημήτριος Κουγιουμτζής"
        ],
        "description": {
          "syllabus": "Εισαγωγή: ορισμοί, δεδομένα, παραδείγματα. Στοιχεία πιθανοτήτων και στατιστικής: τυχαίες μεταβλητές, μονο-μεταβλητές και πολυ-μεταβλητές κατανομές, παράμετροι κατανομής, εκτίμηση παραμέτρων και έλεγχοι υπόθεσης παραμέτρων, έλεγχος υπόθεσης καλής προσαρμογής κατανομής. Αβεβαιότητα και σφάλμα μέτρησης: συστηματικά και τυχαία σφάλματα, διάδοση σφάλματος. Συσχέτιση και παλινδρόμηση: συσχέτιση, απλή και πολλαπλή παλινδρόμηση, γραμμική και μη-γραμμική παλινδρόμηση. Υπολογιστικές μέθοδοι (μέθοδοι επαναδειγματοληψίας) στην εκτίμηση παραμέτρων, στατιστικών ελέγχων, συσχέτισης και παλινδρόμηση.",
          "outcomes": "1.\tΚατανόηση της σημασίας της ανάλυσης δεδομένων στην επιστήμη του μηχανικού. \n2.\tΕξοικείωση με τις έννοιες των πιθανοτήτων και στατιστικής.\n3.\tΚατανόηση των εννοιών στα θέματα σφαλμάτων μετρήσεων, συσχέτισης και παλινδρόμησης.\n4.\tΕξοικείωση με υπολογιστικές προσεγγίσεις για την επίλυση προβλημάτων στην ανάλυση δεδομένων.\n5.\tΔυνατότητα ανάλυσης πραγματικών δεδομένων στον υπολογιστή."
        },
        "name": "Ανάλυση Δεδομένων"
      },
      {
        "code": "600196751",
        "humanCode": "037",
        "originalTitle": "Ανάλυση Συστημάτων Ηλεκτρικής Ενέργειας",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196751",
        "professors": [
          "Αναστάσιος Μπακιρτζής",
          "Παντελής Μπίσκας"
        ],
        "description": {
          "syllabus": "Οικονομική λειτουργία συστημάτων ηλεκτρικής ενέργειας (ΣΗΕ). Μελέτη ηλεκτρικών φορτίων - πρόβλεψη φορτίου. Τεχνικοοικονομικά χαρακτηριστικά του συστήματος παραγωγής ηλεκτρικής ενέργειας. Οικονομική κατανομή φορτίου στους θερμικούς σταθμούς παραγωγής. Ένταξη μονάδων. Υδροθερμική συνεργασία. Ανταλλαγές ηλεκτρικής ενέργειας - κοινοπραξίες ισχύος.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος ο φοιτητής θα μπορεί:\n\n(α) Να περιγράφει τους τεχνικούς περιορισμούς των θερμικών και υδροηλεκτρικών μονάδων παραγωγής ηλεκτρικής ενέργειας καθώς και τα οικονομικά στοιχεία βάσει των οποίων υπολογίζεται το κόστος λειτουργίας των μονάδων.\n\n(β) Να περιγράφει τη διαδικασία του προγραμματισμού του συστήματος παραγωγής ηλεκτρικής ενέργειας και τις αντίστοιχες χρονικές κλίμακες.\n\n(γ) Να διατυπώνει προβλήματα που σχετίζονται με τον προγραμματισμό της λειτουργίας του ΣΗΕ στη βραχυχρόνια περίοδο και με τη λειτουργία του ΣΗΕ σε πραγματικό χρόνο, ως προβλήματα βελτιστοποίησης και να τα λύνει με μεθόδους μαθηματικού προγραμματισμού.\n\n(δ) Να χειρίζεται πακέτα λογισμικού για τον προγραμματισμό λειτουργίας του συστήματος παραγωγής ηλεκτρικής ενέργειας, αναγνωρίζοντας τις απαιτήσεις για δεδομένα εισόδου και τα αναμενόμενα αποτελέσματα.\n"
        },
        "name": "Ανάλυση Συστημάτων Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600196669",
        "humanCode": "075",
        "originalTitle": "Αρχιτεκτονική Προηγμένων Υπολογιστών",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196669",
        "professors": [
          "Ιωάννης Παπαευσταθίου"
        ],
        "description": {
          "syllabus": "•\tΑπόδοση υπολογιστικών συστημάτων. Μετρικές απόδοσης.\n•\tΣύγκριση χαρακτηριστικών RISC και CISC  KME\n•\tΚαλωδιωμένη και μικροπρογραμματιζόμενη μονάδα ελέγχου\n•\tΜονάδα διοχέτευσης. Κίνδυνοι δομής, δεδομένων και ελέγχου\n•\tΠρόβλεψη διακλαδώσεων. \n•\tΠαραλληλοποιήση στο επίπεδο εντολών. Μηχανές VLIW και υπερβαθμωτές. Δυναμικός χρονοπρογραμματισμός εντολών\n•\tΣυσχετιστική μνήμη και αρχιτεκτονική κρυφής μνήμης\n•\tΑρχιτεκτονική εικονικής μνήμης\n•\tΣχεδίαση μονάδας ελέγχου, συνόλου καταχωρητών, Αριθμητικής και Λογικής Μονάδας (ΑΛΜ)  \n",
          "outcomes": "\nΤα αποτελέσματα από την παρακολούθηση του  μαθήματος  αναμένεται να είναι ο φοιτητής/τρια \n•\tνα γνωρίσει τις σχεδιαστικές επιλογές με κριτήρια το κόστος και τις επιδόσεις της αρχιτεκτονικής υπολογιστικών συστημάτων\n•\tνα αντιλαμβάνεται την εσωτερική οργάνωση της ΚΜΕ και να μπορεί να σχεδιάσει μία πολύπλοκη παράλληλη ΚΜΕ\n•\tνα καταλαβαίνει πλήρως πως λειτουργούν α) ένα πάραλληλο σύστημα επεξεργασίας  β) οι μηχανισμοί βελτίωσης των επιδόσεων της και γ) οι ιεραρχικές μνήμες πολλών επιπέδων αυτών των συστημάτων \n"
        },
        "name": "Αρχιτεκτονική Προηγμένων Υπολογιστών"
      },
      {
        "code": "600196672",
        "humanCode": "064",
        "originalTitle": "Βιοϊατρική Τεχνολογία",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196672",
        "professors": [
          "Γεώργιος Σεργιάδης"
        ],
        "description": {
          "syllabus": "Βασικοί μηχανισμοί της φυσιολογίας. Βιολογικά δυναμικά και τρόποι μέτρησής τους. Διαγνωστικές συσκευές: ακτινιγραφία, αξονικός και μαγνητικός τομογράφος, υπερηχοτομογράφος, γάμμα κάμερα.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα έχουν αποκτήσει τις βασικές γνώσεις της φυσιολογίας και θα έχουν δημιουργίσει τις γέφυρες της γνώσης μεταξύ της επιστήμης του Ηλεκτρολόγου Μηχανικού και της Ιατρικής, στο επίπεδο της συμβολής της τεχνολογίας στην Ιατρική.\n"
        },
        "name": "Βιοϊατρική Τεχνολογία"
      },
      {
        "code": "600196778",
        "humanCode": "046",
        "originalTitle": "Δίκτυα Υπολογιστών II",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196778",
        "professors": [
          "Δημήτριος Μητράκος"
        ],
        "description": {
          "syllabus": "Τοπολογίες και πρότυπα δικτύων υπολογιστών. Το πρότυπο Διασύνδεσης Ανοικτών Συστημάτων ISO/OSI. Εκτεταμένα και τοπικά δίκτυα υπολογιστών. Το πρωτόκολλο επικοινωνίας TCP/IP. Οι δικτυακοί σύνδεσμοι TCP και UDP σε περιβάλλον Java. Τεχνικές πρόσβασης σε κοινό μέσο μετάδοσης. Τα συστήματα ALOHA και CSMA. H τοπολογία βρόχου. Τα ασύρματα δίκτυα ΙΕΕΕ 802.11 και 802.16. Τα δίκτυα Jackson και το πρόβλημα της βέλτιστης κατανομής χωρητικότητας. Προβλήματα αρχιτεκτονικής και σχεδιασμού εκτεταμένων δικτύων. Δρομολόγηση και έλεγχος τηλεπικοινωνιακής κίνησης. Eφαρμογές. Εργασία δικτυακού προγραμματισμού στο Εικονικό Εργαστήριο του μαθήματος (Virtual Lab Java Socket Programming Real-time Audio Streaming).",
          "outcomes": "- Η κατανόηση των αρχών ανάπτυξης των δικτύων μετάδοσης δεδομένων, φωνής και εικόνας σε επίπεδο συστήματος.\n- Η εξοικείωση με την αρχιτεκτονική και τη διασύνδεση των ανοικτών συστημάτων (OSI/ISO).\n- Η δυνατότητα επίλυσης πρακτικών προβλημάτων σχεδιασμού τοπολογίας δικτύων, κατανομής χωρητικότητας γραμμών, δρομολόγησης και ελέγχου ροής πακέτων.\n- Η δυνατότητα προγραμματισμού μηχανισμών πολλαπλής πρόσβασης σε κοινό μέσο μετάδοσης και η παραμετροποίηση των μαθηματικών μοντέλων τοπικών δικτύων υπολογιστών.\n- Η δυναντότητα ανάπτυξης πρακτικών εφαρμογών με βάση τα πρωτόκολλα μεταφοράς TCP  και UDP καθώς και δικτυακών εργαλείων Java για την ανάπτυξη εφαρμογών προστιθέμενης αξίας."
        },
        "name": "Δίκτυα Υπολογιστών II"
      },
      {
        "code": "600196782",
        "humanCode": "042",
        "originalTitle": "Εισαγωγή στις Εφαρμογές της Πυρηνικής Τεχνολογίας",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196782",
        "professors": [
          "Αλέξανδρος Κλούβας"
        ],
        "description": {
          "syllabus": "Στοιχεία πυρηνικής φυσικής: Ραδιενέργεια, έλλειμμα μάζας. Πυρηνικές αντιδράσεις και διατομές αντιδράσεων. Σχάση. Αλληλεπιδράσεις ύλης και ακτινοβολιών. Ανίχνευση και μέτρηση ακτινοβολιών. Εφαρμογές στη βιομηχανία, στην παραγωγή και στις επιστήμες. Ρύπανση περιβάλλοντος. Βιολογικές επιπτώσεις των ακτινοβολιών. Δοσιμετρία. Κανονισμοί ακτινοπροστασίας, πρόβλημα της θωράκισης.\n\n\n\n\n\n",
          "outcomes": "Αναπτύσσονται εκείνα τα στοιχεία πυρηνικής φυσικής που είναι απαραίτητα για την κατανόηση του αντικειμένου ,υποθέτοντας ότι ο σπουδαστής δεν έχει προηγούμενες γνώσεις πυρηνικής φυσικής. Τα μαθήματα διατάσσονται και αναπτύσσονται με κατευθυντήριο άξονα  τις εφαρμογές , έχουν δηλαδή σκοπό να εκπαιδεύσουν μηχανικούς μάλλον παρά φυσικούς.\n\nΜε την ολοκλήρωση οι φοιτητές θα πρέπει:\n• Να κατέχουν τη φυσική της ραδιενεργού διάσπασης και των αλληλεπιδράσεων των ακτινοβολιών με την ύλη.\n• Να γνωρίζουν καλά τις αντιδράσεις με νετρόνια, τις διατομές αντιδράσεων και τις σχέσεις για τους ρυθμούς αντιδράσεων.\n• Να γνωρίζουν καλά τη σχάση, τα σχάσιμα υλικά και την επιβράδυνση νετρονίων.\n• Να γνωρίζουν καλά τις αρχές και τα όργανα ανίχνευσης και μέτρησης των ακτινοβολιών.\n• Να  γνωρίζoυν  τις βασικές αρχές της ακτινοπροστασίας.\n• Να μπορούν να κάνουν  υπολογισμούς θωράκισης γ-ακτινοβολίας\n\n\n"
        },
        "name": "Εισαγωγή στις Εφαρμογές της Πυρηνικής Τεχνολογίας"
      },
      {
        "code": "600196739",
        "humanCode": "055",
        "originalTitle": "Εφαρμοσμένα Μαθηματικά ΙΙ",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196739",
        "professors": [
          "Αθανάσιος Κεχαγιάς",
          "Νικόλαος Ατρέας"
        ],
        "description": {
          "syllabus": "Διαφορικές εξισώσεις με μερικές παραγώγους: εξίσωση Laplace, θερμότητος, κύματος.\nΣτο πρώτο μέρος του μαθήματος θα διδαχθούν μέθοδοι επίλυσης:\n1. Χωρισμός μεταβλητών.\n2. Ολοκληρωτικοί μετασχηματισμοί (Fourier, Laplace).\n3. Επίλυση με χρήση λογισμικού συμβολικής υπολογιστικής άλγεβρας (computer algebra systems, CAS) π.χ. Maple, Mathematica.\n4. Επίλυση με χρήση αριθμητικών μεθόδων και εισαγωγή στο αντίστοιχο λογισμκό (π.χ. Maple, Mathematica, Matlab PDE Toolbox, MathPDE).\nΣτο δεύτερο μέρος του μαθήματος οι φοιτητές θα μελετήσουν και θα παρουσιάσουν εργασίες από την σύγχρονη βιβλιογραφία, σχετικές με τις εφαρμογές των  διαφορικών εξισώσεων με μερικές παραγώγους (π.χ., εφαρμογές στο Η/Μ πεδίο, στην επεξεργασία εικόνας, σε συγκοινωνιακά προβλήματα, στις στοχαστικές διαδικασίες κτλ.).\n",
          "outcomes": "Μετά το πέρας του μαθήματος οι φοιτητές θα μπορούν:\n\n1. Nα επιλύουν με αναλυτικές μεθόδους τις βασικές γραμμικές διαφορικές εξισώσεις: εξίσωση Laplace, θερμότητος, κύματος.\n2. Να επιλύουν τις ίδιες εξισώσεις καθώς και μη γραμμικές γενικεύσεις αυτών με χρήση λογισμικού αριθμητικών υπολογισμών (π.χ. Matlab) ή/και με χρήση λογισμικού συμβολικών υπολογισμών (π.χ. Maple).\n3. Να χρησιμοποιούν τον φορμαλισμό των διαφορικών εξισώσεων με μερικές παραγώγους στην μοντελοποίηση και επίλυση πρακτικών προβλήματων (π.χ. εφαρμογές στο Η/Μ πεδίο, στην επεξεργασία σήματος, σε συγκοινωνιακά προβλήματα).\n4. Να μπορουν να λυσουν 2ης ταξης γραμμικες διαφορικες εξισωσεις με αναπτυξη σε σειρα.\n5. Να γνωριζουν τις βασικες ειδικες συναρτησεις (bessel, Legendre, Chebyshev).\n\nΕπιπλέον οι φοιτητές θα έχουν σχηματίσει σαφή διαισθητική αντίληψη της φυσικής σημασίας των βασικών  διαφορικών εξισώσεων με μερικές παραγώγους καθώς και της ομοιότητας αυτών με συστήματα αλγεβρικών εξισώσεων.\n"
        },
        "name": "Εφαρμοσμένα Μαθηματικά ΙΙ"
      },
      {
        "code": "600196745",
        "humanCode": "062",
        "originalTitle": "Ηλεκτρακουστική Ι",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196745",
        "professors": [
          "Γεώργιος Παπανικολάου"
        ],
        "description": {
          "syllabus": "Ηχητικά κύματα, Περιοδικές ταλαντώσεις, Εξίσωση κυματικής κίνησης, Διάδοση ηχητικού κύματος, Ηλεκτρικά και ακουστικά ανάλογα, Ειδικά ακουστικά συστήματα, Ψυχοακουστική, Ακουστότητα, Στάθμη έντασης και πίεσης ήχου, Ακουστική χώρων, Ακουστικός θόρυβος, Μικρόφωνα, Μεγάφωνα.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα αποκτήσουν την γνώση γύρω από τα θέματα του ήχου, του τρόπου διάδοσης του , της ανθρώπινης ακοής κλπ. Ιδιαίτερη σημασία έχει η διαφοροποίηση της άποψης που επικρατεί στους φοιτητές του τμήματος για τη διαφορά μεταξύ των ηλεκτρομαγνητικών κυμάτων και αυτών του ήχου που απαιτεί τελείως διαφορετική προσέγγιση και απαγκίστρωση από την καθημερινή συνήθεια των άλλων μαθημάτων του ηλεκτρομαγνητικού πεδίου."
        },
        "name": "Ηλεκτρακουστική Ι"
      },
      {
        "code": "600196753",
        "humanCode": "038",
        "originalTitle": "Ηλεκτρικές Μηχανές II",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196753",
        "professors": [
          "Χρήστος Μαδεμλής"
        ],
        "description": {
          "syllabus": "Ασύγχρονες (επαγωγικές) ηλεκτρικές μηχανές: Κατασκευή, αρχή λειτουργίας, είδη ασύγχρονων μηχανών. Θεωρία και σχεδίαση τριφασικών περιελίξεων. Εναλλασσόμενα και στρεφόμενα μαγνητικά πεδία στις ηλεκτρικές μηχανές. Γενικές αρχές ηλεκτρομηχανικής μετατροπής ενέργειας. Πειραματικός προσδιορισμός παραμέτρων ασύγχρονης μηχανής. Εκκίνηση και δυναμική λειτουργία. Μέθοδοι ελέγχου της ταχύτητας περιστροφής. Λειτουργικά διαγράμματα συστημάτων ελέγχου ταχύτητας και θέσης. Μονοφασικές ηλεκτρικές μηχανές: Μονοφασική επαγωγική μηχανή. Κατασκευή, αρχή λειτουργίας, εφαρμογές. Εκκίνηση μονοφασικού επαγωγικού κινητήρα. Universal κινητήρας. Κατασκευή, αρχή λειτουργίας, εφαρμογές.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα πρέπει:\nα) να γνωρίζουν τη λειτουργία των επαγωγικών μηχανών (τριφασικών και μονοφασικών),\nβ) να γνωρίζουν κατασκευαστικά στοιχεία των επαγωγικών μηχανών,\nγ) να μπορούν να αναλύσουν την λειτουργία της μηχανής μέσω του ισοδυνάμου κυκλώματος,\nδ) να γνωρίζουν βασικά στοιχεία σχεδιασμού των επαγωγικών μηχανών και\nε) να μπορούν να προσδιορίσουν πειραματικά τις παραμέτρους του ισοδυνάμου κυκλώματος."
        },
        "name": "Ηλεκτρικές Μηχανές II"
      },
      {
        "code": "600196676",
        "humanCode": "039",
        "originalTitle": "Ηλεκτρονικά Ισχύος Ι",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196676",
        "professors": [
          "Χαράλαμπος Δημουλιάς"
        ],
        "description": {
          "syllabus": "Ιδιότητες και λειτουργία των διαφόρων διακοπτών ισχύος από ημιαγωγούς (δίοδοι, thyristors, διπολικά transistors, MOSFET, IGBT, κλπ.) Εξέταση απλών κυκλωμάτων ανόρθωσης με διόδους. Ανάλυση μονοφασικής πλήρους γέφυρας ανόρθωσης θεωρώντας φορτία με σταθερό dc ρεύμα ή φορτία με σταθερή dc τάση. Ανάλυση του φαινομένου της μετάβασης. Εξέταση των αρμονικών τάσης και ρεύματος που προκαλούνται από την λειτουργία 1φασικών ανορθωτών. Ανάλυση 3φασικής πλήρους γέφυρας ανόρθωσης θεωρώντας φορτία με σταθερό dc ρεύμα ή φορτία με σταθερή dc τάση. Εξέταση απλών κυκλωμάτων ανόρθωσης με έλεγχο της dc τάσης χρησιμοποιώντας thyristors. Ανάλυση 1φασικής πλήρους γέφυρας ανόρθωσης με έλεγχο της dc τάσης. Ανάλυση 3φασικής πλήρους γέφυρας ανόρθωσης με έλεγχο της dc τάσης. Εξέταση της 3φασικής γέφυρας σε λειτουργία αντιστροφής (μετατροπή dc-ac). Ανάλυση των προβλημάτων ποιότητας τάσης που δημιουργεί μία ανορθωτική γέφυρα με thysristors.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1) μπορούν να αναλυουν μονοφασικά και τριφασικά κυκλώματα με διόδους και thyristors\n2) υπολογίζουν τις κυματομορφές των τάσεων και ρευμάτων στο dc και ac μέρος των διαφόρων μετατροπέων\n3)υπολογίζουν μαθηματικά τα επίεπδα των dc τάσεων και ρευμάτων καθώς επίσης και των ac ρευμάτων στους διάφορους μετατροπείς (ανορθωτες ή αντιστροφείς)\n4) υπολογίζουν την αρμονική παραμόρφωση των ρευμάτων στην ac πλευρά των μετατροπέων.\n5) υπολογίζουν την αρμονική παραμόρφωση της τάσης στο σημείο διασύνδεσης του μετατροπέα με το ηλεκτρικό δίκτυο."
        },
        "name": "Ηλεκτρονικά Ισχύος Ι"
      },
      {
        "code": "600196779",
        "humanCode": "047",
        "originalTitle": "Ηλεκτρονική III",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196779",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "Σχεδίαση ΤΕ ενισχυτή MOS δύο βαθμίδων, Κυκλώματα ανόρθωσης και σταθεροποίησης τάσης, κυκλώματα τάσης αναφοράς (π.χ. bandgap). Ενισχυτές ισχύος τάξης Α, Β, ΑΒ. Υπολογισμός της παραμόρφωσης, ισχύος εξόδου και απόδοσης. Θερμική σχεδίαση ενισχυτών ισχύος. Εξαρτήματα και κυκλώματα ελέγχου ισχύος (Ελεγχόμενος ανορθωτής πυριτίου SCR, DIAC, TRIAC, LTI, IGCT), ανόρθωση σε κυκλώματα ισχύος.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1. Γνωρίζουν διαδικασίες σχεδίασης τελεστικού ενισχυτή MOS δύο βαθμίδων για ολοκληρωμένα κυκλώματα.\n2. Κατανοήσουν την λειτουργία κυκλωμάτων ανόρθωσης, σταθεροποίησης τάσης, τάσης αναφοράς (π.χ. bandgap), ενισχυτών ισχύος τάξης Α, Β, ΑΒ και των παραμέτρων τους καθώς και τις διαδικασίες σχεδίασης τους.\n3. Κατανοήσουν την θερμική σχεδίαση ενισχυτών ισχύος.\n4. Γνωρίζουν εξαρτήματα και κυκλώματα ελέγχου ισχύος (Ελεγχόμενος ανορθωτής πυριτίου SCR, DIAC, TRIAC, LTI, IGCT) και τις εφαρμογές τους\n"
        },
        "name": "Ηλεκτρονική III"
      },
      {
        "code": "600196762",
        "humanCode": "043",
        "originalTitle": "Ημιαγωγά Υλικά: Θεωρία - Διατάξεις",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196762",
        "professors": [
          "Γεώργιος Λιτσαρδάκης"
        ],
        "description": {
          "syllabus": "Στοιχεία θεωρίας ημιαγωγών: Στοιχειώδεις θεωρητικές αρχές. Αγωγιμότητα ημιαγωγών. Ημιαγωγοί προσμίξεων. Ημιαγωγοί σε συνθήκες μη-ισορροπίας. Μέτρηση ιδιοτήτων ημιαγωγών.\nΑρχές λειτουργίας των ημιαγωγικών διατάξεων: Τεχνολογία κατασκευής. Επαφή p-n, δίοδος p-n. Διπολικό τρανζίστορ. FET επαφής. Τρανζίστορ MOS\n",
          "outcomes": "Το μάθημα παρέχει τις βασικές γνώσεις για την κατανόηση της φυσικής λειτουργίας των ημιαγωγικών διατάξεων (physical layer). Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές\n-θα είναι εξοικειωμένοι με βασικές έννοιες από την κβαντική μηχανική, την κρυσταλλοδομή, και τη φυσική στερεάς κατάστασης, που συνδέονται με τις ιδιότητες των ημιαγωγών\n-θα είναι σε θέση να εξηγούν τη συμπεριφορά των επαφών μετάλλου-ημιαγωγού, ημιαγωγού-ημιαγωγού και μονωτή-ημιαγωγού,\nκαι να περιγράφουν τους φυσικούς μηχανισμούς για τη λειτουργία βασικών ημιαγωγικών διατάξεων (δίοδος, τρανζίστορ, κ.α.)\n"
        },
        "name": "Ημιαγωγά Υλικά: Θεωρία - Διατάξεις"
      },
      {
        "code": "600196743",
        "humanCode": "045",
        "originalTitle": "Θεωρία Δικτύων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196743",
        "professors": [
          "Λεωνίδας Πιτσούλης"
        ],
        "description": {
          "syllabus": "-\tΤεχνολογικά, βιολογικά, κοινωνικά δίκτυα και δίκτυα πληροφορίας.\n-\tΈννοιες θεωρίας γραφημάτων, ακολουθίες βαθμών, κατευθυνόμενα γραφήματα με βάρη, δένδρα, συνεκτικότητα, δυικότητα, μονοπάτα, υπεργραφήματα, προσημασμένα γραφήματα.\n-\tΜετρικές κεντρικότητας κορυφών, κεντρικότητα βαθμών, PageRank, συνάφεια, αποστάσεις σε γραφήματα, διάμετρος, κόμβοι. \n-\tΔομικές ιδιότητες, δίκτυα μεγάλης κλίμακας, γιγάντιες συνιστώσες, κατανομές βαθμών, νόμος δύναμης και δίκτυα ελεύθερης κλίμακας, συντελεστής ομάδας. \n-\tΑλγόριθμοι σε δίκτυα, δομές δεδομένων για αναπαράστη δικτύων, συντομότερα μονοπάτια, ροές, διαμερισμός κορυφών και αναγνώριση κοινοτήτων. \n-\tΜοντέλα δικτύων, τυχαία γραφήματα, μοντέλο Erdos-Renyi, κατανομή βαθμών δύναμης, μοντέλο Barabasi-Albert σχηματισμού δικτύων, φαινόμενο μικρού κόσμου.\n-\tΑνελίξεις σε δίκτυα, διασπορά πληροφορίας και δυναμική δικτύων. \n-\tΑλγόριθμοι σχεδιασμού δικτύων, πρότυτα δομών αποθήκευσης δικτύων, υπολογιστικά πακέτα και βιβλιοθήκες για χειρισμό και επεξεργασία δικτύων. \n",
          "outcomes": "Ο στόχος του μαθήματος είναι να προσφέρει μία ευρεία εισαγωγή στην θεωρία και αλγόριθμους πολύπλοκων δικτύων. Με την ολοκλήρωση του μαθήματος ο φοιτητής θα πρέπει:\n1.\tείναι εξοικειωμένος με τους διάφορους τύπους δικτύων όπως τεχνολογικά, κοινωνικά, βιολογικά δίκτυα και δίκτυα πληροφορίας. \n2.\tέχει  γνώση της βασικής θεωρίας δικτύων, όπως βασικές αρχές της θεωρίας γραφημάτων, μετρικές σημαντικότητας κορυφών και δομικά χαρακτηριστικά δικτύων μεγάλης κλίμακας. \n3.\tνα μπορεί να υλοποιήσει και να εφαρμόσει βασικούς αλγόριθμους σε δίκτυα μεγάλης κλίμακας, όπως συντομότερων μονοπατιών, μέγιστων ροών, διαμερισμού, αναγνώρισης κοινοτήτων και φασματικών μεθόδων. \n4.\tείναι εξοικειωμένος με μοντέλα τυχαίων γραφημάτων και τα χαρακτηριστικά τους όπως και μοντέλα σχηματισμού δικτύων και διαδικασιών.  \n"
        },
        "name": "Θεωρία Δικτύων"
      },
      {
        "code": "600196777",
        "humanCode": "048",
        "originalTitle": "Θεωρία Υπολογισμών και Αλγορίθμων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196777",
        "professors": [
          "Αναστάσιος Ντελόπουλος"
        ],
        "description": {
          "syllabus": "1. Μαθηματικοί ορισμοί για σχέσεις, αλφάβητα, συμβολοσειρές, γλώσσες.\n2. Υπολογιστική πολυπλοκότητα.\n3. Κανονικές Γλώσσες.\n4. Πεπερασμένα αυτόματα.\n5. Γραμματικές και γλώσσες χωρίς συμφραζόμενα.\n6. Αυτόματα Στοίβας.\n7. Μηχανές Turing.\n8. Αναδρομικές γλώσσες.\n9. Υπολογισιμότητα.\n10. Οι κλάσεις προβλημάτων P και NP.",
          "outcomes": "1. Η κατανόηση της δυνατότητας να κατατάξουμε το σύνολο των αλγορίθμων σε μια καλά ορισμένη ιεραρχία.\n2. Η δυνατότητα μαθηματικής μοντελοποίησης των αλγορίθμων ως υπολογιστικές μηχανές (αυτόματα, μηχανές Turing) και των προβλημάτων ως τυπικές γλώσσες (κανονικές, χωρίς συμφραζόμενα, αναδρομικές).\n3. Η ικανότητα μελέτης της υπολογιστικής πολυπλοκότητας και κατηγοριοποίησης των αλγορίθμων με βάση την πολυπλοκότητα αλλά και των προβλημάτων με κριτήριο την πολυπλοκότητα των αλγορίθμων που τα επιλύουν.\n"
        },
        "name": "Θεωρία Υπολογισμών και Αλγορίθμων"
      },
      {
        "code": "600196744",
        "humanCode": "058",
        "originalTitle": "Κεραίες και Διάδοση",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196744",
        "professors": [
          "Θωμάς Ξένος",
          "Τραϊανός Γιούλτσης"
        ],
        "description": {
          "syllabus": "- Γραμμικές κεραίες: γραμμική διπολική κεραία, δίπολο λ/2, κατευθυντικότητα και κέρδος, αντίσταση εισόδου και ακτινοβολίας, κεραίες οδεύοντος κύματος.\n- Κεραίες βρόχου: στοιχειώδης βρόχος, κεραία βρόχου, ελικοειδής κεραία.\n- Στοιχειοκεραίες: γραμμικές στοιχειοκεραίες, κατευθυντικότητα, κέρδος, εύρος δέσμης μισής ισχύος, σχεδίαση διαγράμματος ακτινοβολίας, διδιάστατες στοιχειοκεραίες.\n- Κεραίες επιφανείας και ανακλαστήρα: ακτινοβολία από άνοιγμα, κεραίες παραβολικού ανακλαστήρα, κεραίες χοάνης, ειδικές διαμορφώσεις παραβολικών ανακλαστήρων.\n- Αντίσταση εισόδου κεραίας: αντίσταση εισόδου γραμμικών διπολικών κεραιών, αμοιβαία αντίσταση γραμμικών διπολικών κεραιών σε διάφορες διατάξεις.\n- Κεραία λήψης: θεώρημα αμοιβαιότητας, αμοιβαιότητα εκπομπής-λήψης, ενεργός επιφάνεια κεραίας λήψης, βαθμός απόδοσης και αποδοτικότητα επιφάνειας.\n- Διάδοση Η/Μ κύματος στον ελεύθερο χώρο: εξίσωση μετάδοσης Friis και ισοζύγιο ισχύος ζεύξης.\n- Διάδοση Η/Μ κύματος στο γήινο χώρο: κύματα χώρου-επιφανείας, επίδραση της γήινης επιφάνειας στη διάδοση Η/Μ κυμάτων, ανάκλαση, σφαιρικότητα, περίθλαση, διάδοση πέραν του ορίζοντα.\n- Διάδοση Η/Μ κύματος στην τροπόσφαιρα: ατμοσφαιρικοί παράγοντες, πολλαπλά εμπόδια, τροποσφαιρικοί κυματοδηγοί, μοντέλα διάδοσης.\n- Ειδικά θέματα: στοιχεία ιονοσφαιρικής διάδοσης, διάδοση σε αστικό περιβάλλον, επίδραση βλάστησης, θεωρία παρεμβολών, διάδοση σε εσωτερικούς χώρους, σχεδιασμός ραδιοζεύξεων.\n",
          "outcomes": "1. Κατανόηση της έννοιας και των παραμέτρων κεραιών.\n2. Ικανότητα ανάλυσης βασικών κεραιών και ζεύξεων.\n3. Κατανόηση και εφαρμογή αρχών σχεδίασης στοιχειοκεραιών με τη χρήση εξισώσεων και προγραμματιστικών εργαλείων (π.χ. Matlab).\n4. Κατανόηση της φυσικής και των αρχών λειτουργίας διαφόρων τύπων κεραιών (στασίμου και οδεύοντος κύματος, επιφανείας, βρόχου και ελικοειδούς κλπ.).\n5. Κατανόηση βασικών αρχών διάδοσης ηλεκτρομαγνητικού κύματος στο γήινο χώρο.\n6. Ικανότητα ανάλυσης και σχεδιασμού πρακτικών ραδιοζεύξεων.\n"
        },
        "name": "Κεραίες και Διάδοση"
      },
      {
        "code": "600196783",
        "humanCode": "049",
        "originalTitle": "Λειτουργικά Συστήματα",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196783",
        "professors": [
          "Νικόλαος Πιτσιάνης"
        ],
        "description": {
          "syllabus": "• Επισκόπηση του υλικού υπολογιστικού συστήματος\n• Επισκόπηση των στόχων και της δομής ενός λειτουργικού συστήματος\n• Περιγραφή και έλεγχος διεργασίας\n• Νήματα\n• Αμοιβαίος αποκλεισμός και συγχρονισμός\n• Αδιέξοδο και Λιμοκτονία\n• Διαχείριση Μνήμης\n• Ιδεατή Μνήμη\n• Χρονοδρομολόγηση μονού επεξεργαστή\n• Χρονοδρομολόγηση  επεξεργαστή  πραγματικού χρόνου\n• Διαχείριση Ε/Ε και χρονοδρομολόγηση δίσκου\n• Διαχείριση αρχείων\n• Ασφάλεια υπολογιστών",
          "outcomes": "Οι στόχοι του μαθήματος είναι:\n•\tνα παρουσιάσει τις αρχές, τα δομή και τους μηχανισμούς των σύγχρονων λειτουργικών συστημάτων και τον \n        τρόπο με τον οποίο αλληλεπιιδρούν με το υλικό και τα προγράμματα εφαρμογών\n•\tνα εξοικειώσει το φοιτητή με τις αρχές σχεδίασης και τα ζητήματα υλοποίησης των σύγχρονων λειτουργικών \n        συστημάτων.\n•\tνα χρησιμοποιήσει ως επιδεικτικό παράδειγμα το λειτουργικό σύστημα πολλών χρηστών Unix/Linux  για να \n        επιδείξει τη σύνδεση των εννοιών με τις πραγματικές επιλογές.\nΤα αποτελέσματα από την παρακολούθηση του  μαθήματος  αναμένεται να είναι ο φοιτητής \n•\tνα εξοικειωθεί κι να μάθει να χρησιμοποιεί τις υπηρεσίες που προσφέρει ένα λειτουργικό σύστημα για τη \n        δημιουργία και εκτέλεση προγράμματος εφαρμογής, για την πρόσβαση μονάδων εισόδου και εξόδου δεδομένων, \n        στην πολυεπεξεργασία και πολυπρογραμματισμό, και στην αποτελεσματική διαχείριση των υπολογιστικών \n        πόρων.\n•\tνα μάθει να γράφει Unix/Linux scripts και να προγραμματίζει εφαρμογές σε πολυπρογραμματιστικό \n        περιβάλλον. "
        },
        "name": "Λειτουργικά Συστήματα"
      },
      {
        "code": "600196781",
        "humanCode": "041",
        "originalTitle": "Μετάδοση θερμότητας",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196781",
        "professors": [
          "Βασίλειος Χατζηαθανασίου",
          "Στυλιανή Καδή"
        ],
        "description": {
          "syllabus": "Μηχανισμοί μετάδοσης θερμότητας, Αγωγή-Συναγωγή-Ακτινοβολία, Μεταβατικά φαινόμενα αγωγής, Εναλλάκτες, Πτερύγια.\n",
          "outcomes": "Οι φοιτητές αναμένεται ότι στα πλαίσια του μαθήματος να: \n•\tΚατανοήσουν τους μηχανισμούς μετάδοσης θερμότητας (αγωγή, συναγωγή, ακτινοβολία)\n•\tΚατανοήσουν τη φυσική σημασία και αξία της αδιαστατοποίησης και των αδιάστατων αριθμών\n•\tΕξασκηθούν στην επίλυση προβλημάτων μόνιμης και μεταβατικής κατάστασης μετάδοσης θερμότητας \n•\tΕίναι σε θέση να επιλύσουν προβλήματα σε πρακτικές εφαρμογές που αφορούν μεταφορά θερμότητας με συνδυασμένα φαινόμενα αγωγής, συναγωγής και ακτινοβολίας.\n\n"
        },
        "name": "Μετάδοση θερμότητας"
      },
      {
        "code": "600196754",
        "humanCode": "036",
        "originalTitle": "Μεταφορά και Διανομή Ηλεκτρικής Ενέργειας",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196754",
        "professors": [
          "Δημήτριος Λαμπρίδης",
          "Μηνάς Αλεξιάδης",
          "Γεώργιος Ανδρέου",
          "Γρηγόριος Παπαγιάννης"
        ],
        "description": {
          "syllabus": "Υπόγειες και εναέριες γραμμές μεταφοράς (ΓΜ) ηλεκτρικής ενέργειας. Μηχανικά χαρακτηριστικά ΓΜ. Υπολογισμός βέλους ανάρτησης και δυνάμεων σε εναέριους αγωγούς. Ηλεκτρικά χαρακτηριστικά ΓΜ. Ομοιογενής ΓΜ, μεταφορά και έλεγχος ενεργής και άεργης ισχύος. Υπολογισμοί πτώσης τάσης και ευστάθειας. Άεργη ισχύς και αντιστάθμιση. Ειδικές περιπτώσεις ΓΜ χωρίς απώλειες. Ροή φορτίου σε συστήματα μεταφοράς ηλεκτρικής ενέργειας. Δομή δικτύων διανομής ηλεκτρικής ενέργειας. Ροή φορτίου και αξιοπιστία σε δίκτυα διανομής ηλεκτρικής ενέργειας. Ηλεκτρικά και μαγνητικά πεδία γραμμών μεταφοράς, δικτύων διανομής και συσκευών ηλεκτρικής ενέργειας.",
          "outcomes": "Mε την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα είναι σε θέση να κατανοήσουν πλήρως τη δομή και τα λειτουργικά χαρακτηριστικά μιας εναέριας ή υπόγειας γραμμής μεταφοράς ηλεκτρικής ενέργειας.\nΕπίσης, οι φοιτητές θα είναι σε θέση να κατανοήσουν τη ροή ενεργής και άεργης ισχύος σε μια γραμμή μεταφορά ηλεκτρικής ενέργειας, και θα μπορούν να τη μοντελοποιήσουν μαθηματικά.\nΤέλος, οι φοιτητές θα είναι σε θέση να σχεδιάσουν την αντιστάθμιση άεργης ισχύος σε ένα σύστημα ηλεκτρικής ενέργειας."
        },
        "name": "Μεταφορά και Διανομή Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600196780",
        "humanCode": "050",
        "originalTitle": "Παράλληλα και Διανεμημένα Συστήματα",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196780",
        "professors": [
          "Νικόλαος Πιτσιάνης"
        ],
        "description": {
          "syllabus": "• γενική επισκόπηση της αρχιτεκτονικής των παράλληλων υπολογιστών\n• αρχιτεκτονικές κατανεμημένης μνήμης,\n• αρχιτεκτονικές πολυπύρηνων επεξεργαστών\n• κάρτες γραφικών\n• παράλληλοι αλγόριθμοι ταξινόμησης και αναζήτησης, map-reduce, parallel prefix (scan)\n• παράλληλοι αριθμητικοί αλγόριθμοι: επίλυση γραμμικών συστημάτων με πολυπληθή ή διεσπαρμένα στοιχεία, υπολογισμό ιδιοτιμών και ιδιοδιανυσμάτων, μετασχηματισμοί Fourier, wavelet, και Multipole.\n• προγραμματισμός με pthreads, OpenMP, MPI, και CUDA.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n• γνωρίζουν να σχεδιάζουν, να υλοποιούν, και να αναλύουν παράλληλους αλγορίθμους\n• για πολυπύρηνα συστήματα, συστήματα κατανεμημένης μνήμης και κάρτες GPU"
        },
        "name": "Παράλληλα και Διανεμημένα Συστήματα"
      },
      {
        "code": "600196741",
        "humanCode": "051",
        "originalTitle": "Συστήματα Αυτομάτου Ελέγχου III",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196741",
        "professors": [
          "Ζωή Δουλγέρη"
        ],
        "description": {
          "syllabus": "- Επισκόπηση χαρακτηριστικών ιδιοτήτων των μη γραμμικών συστημάτων (ΜΓΣ). Σημεία ισορροπίας, Δευτεροβάθμια συστήματα: παράσταση και ανάλυση στο φασικό επίπεδο. Παραδείγματα ΜΓΣ\n-Ευστάθεια Lyapunov - Αυτόνομα Συστήματα: ορισμοί και θεωρήματα, αμετάβλητα σύνολα, σύγκλιση σε αμετάβλητα σύνολα, θεώρημα LaSalle, πεδία έλξης, γραμμικοποίηση ΜΓΣ, έμμεση μέθοδος Lyapunov, θεωρήματα αστάθειας\n- Ευστάθεια Lyapunov-Μη Αυτόνομα Συστήματα: ορισμοί και θεωρήματα, γραμμικά χρονομεταβλητά συστήματα, ανάλυση διαταραχών, θεωρήματα ύπαρξης, ευστάθεια συστημάτων διακριτού χρόνου\n-Συστήματα Ανάδρασης, βασική σταθεροποίηση με ανάδραση καταστάσεων και βηματική οπισθοχώρηση ολοκλήρωσης\n-Ευστάθεια εισόδου εξόδου, θεώρημα μικρού κέρδους,  θεωρήματα απόλυτης ευστάθειας (Popov, κύκλου), θεωρήματα ευστάθειας εισόδου-κατάστασης\n- Παθητικότητα, διασύνδεση παθητικών συστημάτων, θεωρήματα υπερευστάθειας\n-Προσαρμοστικός έλεγχος μοντέλου αναφοράς\n-Έλεγχος ολίσθησης\n\n",
          "outcomes": "Το μάθημα αφορά την ανάλυση και σύνθεση μη γραμμικών συστημάτων ελέγχου και έχει σχεδιαστεί έτσι ώστε να παρέχει στον φοιτητή την βασική γνώση και κατανόηση των μη γραμμικών συστημάτων, της ευστάθειας τους και των βασικών μεθόδων ελέγχου τους.\n\nΜαθησιακά αποτελέσματα\n\n1.Κατανόηση των χαρακτηριστικών ιδιοτήτων των μη γραμμικών συστημάτων\n2.Απόκτηση βασικών γνώσεων της θεωρίας ευστάθειας Lyapunov, της απόλυτης ευστάθειας και της παθητικότητας.\n3.Απόκτηση γνώσεων και δεξιοτήτων στην σχεδίαση απλών ελεγκτών με χρήση της θεωρίας Lyapunov.\n4.Απόκτηση γνώσεων και δεξιοτήτων στην σχεδίαση ελεγκτων γραμμικοποιησης με ανάδραση εισοδου καταστασεων και εισοδου εξόδου, ελεγκτών ολίσθησης και προσαρμοστικών ελεγκτών.\n\n\n"
        },
        "name": "Συστήματα Αυτομάτου Ελέγχου III"
      },
      {
        "code": "600196734",
        "humanCode": "052",
        "originalTitle": "Τεχνικές Βελτιστοποίησης",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196734",
        "professors": [
          "Γεώργιος Ροβιθάκης"
        ],
        "description": {
          "syllabus": "Περιγραφή: Βασική θεωρία και μέθοδοι για την επίλυση προβλημάτων βελτιστοποίησης. Αναδρομικοί αλγόριθμοι για βελτιστοποίηση μη-γραμμικών προβλημάτων με ή χωρίς περιορισμούς. Τεχνικές με και χωρίς την χρήση παραγώγων, μέθοδοι εφικτού σημείου και επαυξημένης Λαγκρανζιανής. Παραδείγματα-Εφαρμογές.\n\nΠεριεχόμενο μαθήματος: \n1. \tΕισαγωγή\n1.1 \tΔιατύπωση του Προβλήματος\n1.2 \tΠαραδείγματα - Εφαρμογές\n2. \tΒασικές Έννοιες\n2.1 \tΚυρτότητα\n2.2 \tΣυνθήκες Βελτιστοποίησης\n2.3 \tΔυαδικότητα\n3. \tΤεχνικές Βελτιστοποίησης Χωρίς Περιορισμούς\n3.1 Συνθήκες βελτιστοποίησης\n3.2 Τεχνικές με Χρήση Παραγώγων (Gradient,   \n      Newton, Συζυγών Κατευθύνσεων, Σχεδόν- \n      Newton)\n3.3\tΤεχνικές Χωρίς Χρήση Παραγώγων\n4. \tΤεχνικές Βελτιστοποίησης με Περιορισμούς\n4.1 Συνθήκες βελτιστοποίησης\n4.2 Χώρος Αναζήτησης Κυρτό Σύνολο  \n      (Μέθοδος των εφικτού σημείου, \n       Μέθοδος κλίσης υπό συνθήκες,  \n       Τροποποιημένη μέθοδος κλίσης)\n4.3 Ισοτικοί και Ανισοτικοί Περιορισμοί\n      (Μέθοδοι φραγμών και εσωτερικών \n       σημείων, Μέθοδοι ποινής και Επαυξημένης \n       Λαγκρανζιανής)",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\nα) σχεδιάζουν και αναλύουν προβλήματα βελτιστοποίησης,\nβ) σχεδιάζουν και θα αναλύουν αλγορίθμους εύρεσης των βέλτιστων σημείων μη-γραμμικών συναρτήσεων με ή χωρίς περιορισμούς,\nγ) υλοποιούν αλγορίθμους βελτιστοποίησης σε κώδικα MATLAB."
        },
        "name": "Τεχνικές Βελτιστοποίησης"
      },
      {
        "code": "600196746",
        "humanCode": "059",
        "originalTitle": "Τηλεπικοινωνιακά Συστήματα ΙΙΙ",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196746",
        "professors": [
          "Λεωνίδας Γεωργιάδης"
        ],
        "description": {
          "syllabus": "Ζωνοπερατά σήματα και ζωνοπερατές διαδικασίες, ψηφιακή μετάδοση μέσω καναλιών περιορισμένου εύρους ζώνης, σχεδιασμός σήματος για κανάλια περιορισμένου εύρους ζώνης και μηνεδικό ISI - κριτήριο Nyquist, σχεδιασμός σημάτων περιορισμένουν εύρους ζώνης με ελεγχόμενο ISI - σήματα μερικής απόκρισης, φώραση ML ακολουθίας σημάτων μερικής απόκρισης, σχεδιασμός φίλτρων εκπομπής και λήψης για γνωστό κανάλι, εξίσωση καναλιού, γραμμικοί εξισωτές, προσαρμοστικοί εξισωτές, συστήματα OFDM.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές έχουν τις εξής δυνατότητες.\nα) Ανάλυση τηλεπικοινωνιακών συστημάτων με κανάλια περιορισμένου εύρους ζώνης.\nβ) Σχεδιασμό βέλτιστων ανιχνευτών σημάτων μερικής απόκρισης\nγ) Σχεδιασμό φίλτρων εκπομπής και λήψης συστημάτων με κανάλια περιορισμένου εύρους ζώνης.\nδ) Λειτουργία των OFDM συστημάτων\n\n\n"
        },
        "name": "Τηλεπικοινωνιακά Συστήματα ΙΙΙ"
      },
      {
        "code": "600196752",
        "humanCode": "040",
        "originalTitle": "Υψηλές Τάσεις Ι",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196752",
        "professors": [
          "Παντελεήμων Μικρόπουλος"
        ],
        "description": {
          "syllabus": "Εισαγωγή στις υψηλές τάσεις, Εισαγωγή στην τεχνολογία του εργαστηρίου των υψηλών τάσεων, Παραγωγή και μέτρηση εναλλασσομένων υψηλών τάσεων, Παραγωγή και μέτρηση συνεχών υψηλών τάσεων, Παραγωγή και μέτρηση κρουστικών υψηλών τάσεων, Παραγωγή και μέτρηση ισχυρών ρευμάτων.",
          "outcomes": "• Η κριτική κατανόηση των βασικών αρχών και προβλημάτων της τεχνολογίας των υψηλών τάσεων, με έμφαση στην παραγωγή και στη μέτρηση των υψηλών τάσεων και των ισχυρών ρευμάτων.\n• Η ανάπτυξη πρακτικών δεξιοτήτων σχετικά με τη χρήση των υψηλών τάσεων, μέσω της απόκτησης εργαστηριακής εμπειρίας.\n• Η ικανότητα σχεδίασης και υλοποίησης γεννητριών παραγωγής και συστημάτων μέτρησης υψηλών τάσεων σύμφωνα με τους σχετικούς κανονισμούς τυποποίησης δοκιμών υψηλών τάσεων.\n• Η ικανότητα διεξαγωγής εργαστηριακών μετρήσεων, αξιολόγησης των αποτελεσμάτων και εξαγωγής γενικών συμπερασμάτων μέσω επεξεργασίας των μετρήσεων, και σύνταξης σχετικής γραπτής έκθεσης.\n• Η προσωπική ανάπτυξη μέσω της ενεργούς συμμετοχής και της ομαδικής εργασίας, στο πλαίσιο εκπόνησης εργαστηριακών ασκήσεων από ομάδες ολιγάριθμων φοιτητών."
        },
        "name": "Υψηλές Τάσεις Ι"
      },
      {
        "code": "600196735",
        "humanCode": "053",
        "originalTitle": "Χρονοσειρές",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196735",
        "professors": [
          "Δημήτριος Κουγιουμτζής"
        ],
        "description": {
          "syllabus": "Βασικά χαρακτηριστικά χρονοσειρών: Στασιμότητα, αυτοσυσχέτιση, μερική αυτοσυσχέτιση, απομάκρυνση στοιχείων μη-στασιμότητας, έλεγχος ανεξαρτησίας για χρονοσειρές. Γραμμικές στοχαστικές διαδικασίες: αυτοπαλινδρομούμενη (AR),  κινούμενου μέσου (MA), μικτή (ARMA). Μοντέλα χρονοσειρών: AR, MA και ARMA σε στάσιμες χρονοσειρές, μικτό ολοκληρωμένο μοντέλο (ARIMA) και εποχικό ARIMA (SARIMA) σε μη-στάσιμες χρονοσειρές. Πρόβλεψη χρονοσειρών. Μη-γραμμική ανάλυση χρονοσειρών: Επεκτάσεις γραμμικών στοχαστικών μοντέλων; μη-γραμμικά χαρακτηριστικά χρονοσειρών; μη-γραμμική δυναμική και χάος; μη-γραμμική πρόβλεψη χρονοσειρών.",
          "outcomes": "1. Κατανόηση της σημασίας της ανάλυσης χρονοσειρών στην επιστήμη του μηχανικού.\n2. Εξοικείωση με τη διερεύνηση στοχαστικών διαδικασιών και δυναμικών συστημάτων από χρονοσειρές καθώς και της πρόβλεψης.\n3. Κατανόηση των προβλημάτων στην ανάλυση πραγματικών χρονοσειρών και πως αντιμετωπίζονται, όπως μη-στασιμότητα και μη-κανονική στοχαστική διαδικασία.\n4. Εξοικείωση με υπολογιστικές προσεγγίσεις για την επίλυση προβλημάτων στην ανάλυση χρονοσειρών.\n5. Δυνατότητα ανάλυσης πραγματικών χρονοσειρών στον υπολογιστή.\n"
        },
        "name": "Χρονοσειρές"
      },
      {
        "code": "600196737",
        "humanCode": "054",
        "originalTitle": "Ψηφιακά Συστήματα HW σε Χαμηλά Επίπεδα Λογικής I",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196737",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "●  Αριθμητικά Κυκλώματα Υπολογιστών.   Αθροιστές, αφαιρέτες, πολλαπλασιαστές, διαιρέτες, εκθέτες σε δύναμη, τετραγωνικής ρίζας. Μορφές της ορθής και συμπληρώματος του 2, αριθμητικής μορφής, σταθερής και κινητής υποδιαστολής. Αποσύνθεση (decomposition) μεγάλων κυκλωμάτων σε μικρότερα. ● Μνήμες UV-, EE-, και flash-EPROM, τεχνολογία, αρχιτεκτονική και προγραμματισμός. Αριθμητικά κυκλώματα με μνήμες PROM.  ●  Κυκλώματα παραγωγής τριγωνομετρικών συναρτήσεων. Κυκλώματα sin(φ), cos(φ), tg(φ) και η αποσύνθεσή τους σε διασυνδεμένα μικρότερων κυκλωμάτων. ●  Κυκλώματα πολλαπλασιασμού αλγεβρικών μητρών. ●  Κλασικά κυκλώματα DSP. Κυκλώματα 1-D και 2-D φίλτρων και μετασχηματισμού Fourier. ●  Μέθοδος CORDIC στη σχεδίαση κυκλωμάτων DSP. Αντικατάσταση πολλαπλασιασμών με ολισθήσεις και προσθέσεις. ● Εισαγωγή στα Πεπερασμένα Σώματα Galois (Finite Fields) και τα αντίστοιχα κυκλώματα αθροιστών/ αφαιρετών, πολλαπλασιαστών και διαιρετών. ●  Κυκλώματα ψηφιακών κωδίκων και κρυπτογραφίας (Reed -Solomon, BCH, Συνελιξιακοί, Viterbi, Turbo, DES, AES, RSA,  κα.).\nΕργαστηριακές Ασκήσεις: 1-3. Μετρήσεις επάνω σε αριθμητικά κυκλώματα. 4. Προγραμματισμός μνημών x-PROM και σχεδίαση πολλαπλασιαστή με PROM. 5-6. κυκλώματα ψηφια-κών κωδίκων και κρυπτογραφίας.",
          "outcomes": "1. Κατανόηση λειτουργίας των αριθμητικών κυκλωμάτων υπολογιστών. Καλύπτονται οι κλασικοί αλγεβρικοί υπολογισμοί, όπως και οι υπολογισμοί DSP. Δίνεται επίσης έμφαση στη μέθοδο CORDIC που απαλείφει από τους υπολογισμούς DSP την πράξη του πολλαπλασιασμού.\n2. Κατανόηση της αρχιτεκτονικής, λειτουργίας και προγραμματισμού μνημών ROM/PROM, UV-EPROM, EEPROM και flash-EPROM. Στη συνέχεια, της μεθόδου υλοποίησης αριθμητικών κυκλωμάτων μέσω αυτών.\n3. Ιδιαίτερη έμφαση δίνεται στα αριθμητικά κυκλώματα που εκτελούν υπολογισμούς στα πεπερασμένα σώματα Galois (Finite Fields), με εφαρμογές στα κυκλώματα κρυπτογραφίας και κώδικες ψηφιακών τηλεπικοινωνιών."
        },
        "name": "Ψηφιακά Συστήματα HW σε Χαμηλά Επίπεδα Λογικής I"
      },
      {
        "code": "600196747",
        "humanCode": "057",
        "originalTitle": "Ψηφιακή Επεξεργασία Σήματος",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196747",
        "professors": [
          "Ιωάννης Ρέκανος",
          "Λεόντιος Χατζηλεοντιάδης"
        ],
        "description": {
          "syllabus": "Διακριτός μετασχηματισμός Fourier (DFT). Ανακατασκευή αναλογικού σήματος και του φάσματος από δείγματα. Σχέση του DFT με τον μετασχηματισμό Fourier αναλογικού σήματος. Ταχύς μετασχηματισμός Fourier (FFT). Διακριτά συστήματα. Ψηφιακά φίλτρα FIR και IIR. Σχεδίαση ψηφιακών φίλτρων. Φασματική ανάλυση.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα μπορούν:\n1. Να κατανοούν και να διαχειρίζονται τις βασικές αρχές της ψηφιακής επεξεργασίας σήματος.\n2. Να διατυπώνουν και να επιλύουν εξισώσεις διαφορών.\n3. Να εφαρμόζουν δειγματοληψία σε συνεχή σήματα.\n4. Να περιγράφουν σήματα και συστήματα με τη χρήση του διακριτού μετασχηματισμού Fourier και του μετασχηματισμού Z.\n5. Να σχεδιάζουν ψηφιακά φίλτρα με κρουστική απόκριση πεπερασμένης και άπειρης διάρκειας.\n6. Να αντιλαμβάνονται την απεικόνιση από τους χώρους του συνεχούς χρόνου και του συνεχούς φάσματος στους αντίστοιχους διακριτούς χώρους.\n"
        },
        "name": "Ψηφιακή Επεξεργασία Σήματος"
      }
    ],
    "8": [
      {
        "code": "600198798",
        "humanCode": "129",
        "originalTitle": "Αρχές Οικονομίας (ΔΟΝΑ)",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198798",
        "professors": [
          "Νικόλαος Βαρσακέλης"
        ],
        "description": {
          "syllabus": "1. Οικονομικό κύκλωμα\n2. Θεωρία της επιχείρησης\n3. Συνάρτηση Παραγωγής\n4. Αριστοποίηση παραγωγής\n5. Θεωρία του κόστους\n6. Ελαχιστοποίηση κόστους\n7. Θεωρία των αγορών\n8. Τέλειος ανταγωνισμός\n9. Μονοπώλιο\n10. Ολιγοπώλιο",
          "outcomes": "Με την ολοκληρωση του μαθήματος οι φοιητές θα:\n1. έχουν κατανοησει πληρως το πως λειτουργεί μια οικονομία δυτικού τύπου\n2. την λειτουργία της επιχείρησεις όσον αφορά τις αποφάσεις για παραγωγή και τρόπους παραγωγής\n3. έχουν κατανοησει τον τρόπο λειτουργίας των διαφόρων μορφών αγοράς όπως μονοπώλιο, ολιγοπώλιο κλπ"
        },
        "name": "Αρχές Οικονομίας (ΔΟΝΑ)"
      },
      {
        "code": "600198745",
        "humanCode": "076",
        "originalTitle": "Γραφική με Υπολογιστές",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198745",
        "professors": [
          "Αναστάσιος Ντελόπουλος"
        ],
        "description": {
          "syllabus": "1. Συνολική αρχιτεκτονική ενός ολοκληρωμένου συστήματος γραφικών\n1.1 Μοντελοποίηση\n1.2 Εφαρμογή Γραφικών\n1.2 Υποσύστημα Απεικόνισης Γραφικών\n1.3 Υποσυστήματα Προβολής Γραφικών (Displays)\n2. Οι επικρατέστερες συσκεύες προβολής. Η διακριτή απεικόνιση του σχήματος και του χρώματος\n3. Χάραξη γραμμών και πλήρωση σχημάτων (Line scan conversion, area filling)\n4. Μετασχηματισμοί 2 και 3 διαστάσεων\n5. Προβολές\n6. Clipping\n7. Μοντελοποίηση γραμμών και επιφανειών\n8. Φωτισμός και Σκίαση\n",
          "outcomes": "1. Κατανόηση της αρχιτεκτονικής και των λειτουργιών ενός συστήματος γραφικών.\n2. Κατανόηση του μαθηματικού υπόβαθρου των χρησιμοποιούμενων αλγορίθμων καθώς και της υπολογιστικής τους πολυπλοκότητας.\n3. Πρακτική εξοικίωση μέσω της χρήσης των παραπάνω για την προσομοίωση-υλοποίηση των κεντρικών λειτουργιών ενός συστήματος γραφικών.\n"
        },
        "name": "Γραφική με Υπολογιστές"
      },
      {
        "code": "600198760",
        "humanCode": "091",
        "originalTitle": "Δίκτυα Τηλεπικοινωνιών",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198760",
        "professors": [
          "Σταυρούλα Σιάχαλου"
        ],
        "description": {
          "syllabus": "Κατηγορίες και χαρακτηριστικά δικτύων, δομή τηλεφωνικού δικτύου. Δομή και λειτουργία τηλεφωνικής συσκευής. Δομή και σχεδίαση τηλεφωνικών κέντρων (Ηλεκτρομηχανικά, Ηλεκτρονικά, Ψηφιακά, Έλεγχος αποθηκεμένου προγράμματος). Κωδικοποίηση φωνής (PCM, DPCM, DM). Σηματοδοσία τηλεπικοινωνιακού δικτύου. Μοντέλα συστημάτων αναμονής και ανάλυσή τους. Διακίνηση δεδομένων και νέες υπηρεσίες στο υπάρχον τηλεπικοινωνιακό δίκτυο. Αλγόριθμοι δρομολόγησης μηνυμάτων. Δίκτυα ISDN. Τεχνικές και κέντρα ΑΤΜ.",
          "outcomes": "Οι φοιτητές γνωρίζουν καλά την εξέλιξη και τις βασικές αρχές λειτουργίας των δικτύων.\nΓνωρίζουν και μπορούν να εφαρμόσουν αναλυτική αξιολόγηση των αναλογικών και ψηκιακών τηλεπικοινωνιακών δικτύων με βάση μαθηματικά μοντέλα και κριτήρια αξιολόγησης.\nΕξοικειώνονται με τεχνικές προσομοιωτικής μελέτης δικτύων και εργαλεία λογισμικού σχεδίασης δικτύων.\n"
        },
        "name": "Δίκτυα Τηλεπικοινωνιών"
      },
      {
        "code": "600198736",
        "humanCode": "067",
        "originalTitle": "Διανεμημένη Παραγωγή",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198736",
        "professors": [
          "Δημήτριος Λαμπρίδης",
          "Μηνάς Αλεξιάδης"
        ],
        "description": {
          "syllabus": "Ορισμός της Διανεμημένης Παραγωγής (ΔΠ). Εισαγωγή στις Ανανεώσιμες Πηγές Ενέργειας (Ανεμογεννήτριες, Φωτοβολταϊκά Συστήματα, Μικρά Υδροηλεκτρικά, Εκμετάλλευση Βιομάζας & Γεωθερμίας). Τεχνολογίες Αποθήκευσης Ενέργειας. Αυτόνομα και Υβριδικά Συστήματα. Μικροστρόβιλοι, Κυψέλες Καυσίμου, Μικροσυμπαραγωγή Ηλεκτρισμού Θερμότητας. Διασύνδεση εγκαταστάσεων ΔΠ στο Δίκτυο Διανομής (Κανονισμοί- Προδιαγραφές). Οικονομικά- Περιβαλλοντικά και Λειτουργικά Στοιχεία ΔΠ, Νομικό Πλαίσιο.",
          "outcomes": "Η κατανόηση των βασικών χαρακτηριστικών (λειτουργικών- περιβαλλοντικών- οικονομικών) των συστημάτων διανεμημένης παραγωγής. Η διερεύνηση των προβλημάτων από τη διασύνδεσή τους και την αυξημένη διείσδυσή τους στο δίκτυο. Οι φοιτητές εξοικειώνονται με θέματα στατιστικής επεξεργασίας, εκτίμησης και αξιοποίησης ενεργειακού δυναμικού. Υπολογίζουν χαρακτηριστικά μεγέθη για αιολικά & φωτοβολταϊκά συστήματα, κυψέλες καυσίμου κλπ.\nΛύνουν προβλήματα σχετικά με το σχεδιασμό, τη στρατηγική λειτουργίας και την ενεργειακή απόδοση συστημάτων που βασίζονται σε ανανεώσιμες πηγές ενέργειας ή χρησιμοποιούν συστήματα αποθήκευσης. Εξετάζουν την ικανότητα διασύνδεσης και το μέγιστο ποσοστό διείσδυσης με βάση την ισχύ βραχυκύκλωσης.\n"
        },
        "name": "Διανεμημένη Παραγωγή"
      },
      {
        "code": "600198735",
        "humanCode": "066",
        "originalTitle": "Διαχείριση Συστημάτων Ηλεκτρικής Ενέργειας",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198735",
        "professors": [
          "Αναστάσιος Μπακιρτζής",
          "Παντελής Μπίσκας"
        ],
        "description": {
          "syllabus": "Διαχείριση Συστήματος Παραγωγής και Μεταφοράς ηλεκτρικής ενέργειας. Ρύθμιση συχνότητας και  ενεργού ισχύος. Ρύθμιση τάσεως και αέργου ισχύος. Ανάλυση και  έλεγχος διακίνησης ενέργειας στο Σύστημα Μεταφοράς ηλεκτρικής ενέργειας: ροή φορτίου, ανάλυση ασφάλειας, διαχείριση συμφορήσεων. Λειτουργία μονάδων παραγωγής στα ΣΗΕ, στατισμός μονάδων παραγωγής, έλεγχος παραγωγής σε διασυνδεδεμένα ΣΗΕ, αρμοδιότητες Κέντρων Κατανομής Φορτίου",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές θα έχουν τις παρακάτω ικανότητες:\n1.\tΙκανότητα υπολογισμού του πίνακα αγωγιμοτήτων και του πίνακα παραγόντων ενός Συστήματος Ηλεκτρικής Ενέργειας (ΣΗΕ)\n2.\tΙκανότητα εύρεσης της βέλτιστης αρίθμησης των κόμβων ενός ΣΗΕ (με δύο αλγόριθμους), και υπολογισμός του «δείκτη διατήρησης αραιότητας» του πίνακα αγωγιμοτήτων του ΣΗΕ\n3.\tΙκανότητα εφαρμογής διαφόρων μεθόδων (Newton, ταχεία αποζευγμένη ροή φορτίου, Ροή Φορτίου Συνεχούς Ρεύματος) για την επίλυση του προβλήματος ροής φορτίου σε ένα ΣΗΕ\n4.\tΙκανότητα προσομοίωσης μετασχηματιστών ρύθμισης τάσης και ρύθμισης φάσης για τον υπολογισμό της ροής φορτίου σε μία γραμμή μεταφοράς ενός ΣΗΕ\n5.\tΧρήση του «Λήμματος Αντιστροφής Πίνακα» για την εύρεση της κατάστασης του συστήματος μετά από διαταραχή\n6.\tΔιαχείριση (άρση) υπερφορτίσεων στις γραμμές του συστήματος, με επανακατανομή των μονάδων παραγωγής\n7.\tΛειτουργία μονάδων παραγωγής σε αυτόνομο ή διασυνδεδεμένο ΣΗΕ\n8.\tΚατανόηση των στόχων του Αυτόματου Ελέγχου Παραγωγής σε ένα ΣΗΕ, και πώς αυτοί επιτυγχάνονται\n"
        },
        "name": "Διαχείριση Συστημάτων Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600198734",
        "humanCode": "065",
        "originalTitle": "Δυναμική Συμπεριφορά Συστημάτων Ηλεκτρικής Ενέργειας",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198734",
        "professors": [
          "Δημήτριος Λαμπρίδης",
          "Μηνάς Αλεξιάδης",
          "Γεώργιος Ανδρέου",
          "Γρηγόριος Παπαγιάννης"
        ],
        "description": {
          "syllabus": "Μεταβατικά φαινόμενα στα Συστήματα Ηλεκτρικής Ενέργειας. Κυματικά φαινόμενα σε Γραμμές Μεταφοράς. Τερματισμοί γραμμών μεταφοράς με οδεύοντα κύματα. Πολλαπλές ανακλάσεις οδευόντων κυμάτων. Καταπόνηση μετασχηματιστών ισχύος και μονωτήρων από οδεύοντα κύματα. Ζεύξεις, αποζεύξεις και βραχυκυκλώματα στα Συστήματα Ηλεκτρικής Ενέργειας. Προστασία συστήματος από υπερτάσεις και υπερρεύματα. Ευστάθεια Συστημάτων Ηλεκτρικής Ενέργειας σε μόνιμη και μεταβατική κατάσταση λειτουργίας. Ηλεκτρομηχανική εξίσωση κίνησης του δρομέα. Μικρές ταλαντώσεις του δρομέα. Αντίδραση μεταφοράς. Κριτήριο ίσων εμβαδών για την εκτίμηση της ευστάθειας μεταβατικής κατάστασης στα Συστήματα Ηλεκτρικής Ενέργειας.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα είναι σε θέση να κατανοήσουν πλήρως τη μεταβατικά φαινόμενα στα Συστήματα Ηλεκτρικής Ενέργειας.\nΣυγκεκριμένα, οι φοιτητές θα είναι σε θέση να κατανοήσουν τους τερματισμούς γραμμών μεταφοράς με οδεύοντα κύματα, τις πολλαπλές ανακλάσεις οδευόντων κυμάτων και την καταπόνηση μετασχηματιστών ισχύος και μονωτήρων από οδεύοντα κύματα.\nΕπίσης οι φοιτητές θα είναι σε θέση υπολογίσουν υπερτάσεις και υπερρεύματα τα οποία προκύπτουν από ζεύξεις, αποζεύξεις και βραχυκυκλώματα στα Συστήματα Ηλεκτρικής Ενέργειας.\nΤέλος, οι φοιτητές θα εξοικειωθούν με προβλήματα  ευστάθειας στάσιμης και μεταβατικής κατάσταση λειτουργίας των Συστήματα Ηλεκτρικής Ενέργειας καθώς και με τις μεθόδους που αντιμετωπίζονται τα προβλήματα αυτά.\n"
        },
        "name": "Δυναμική Συμπεριφορά Συστημάτων Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600198765",
        "humanCode": "096",
        "originalTitle": "Ειδικές Κεραίες",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198765",
        "professors": [
          "Τραϊανός Γιούλτσης",
          "Θωμάς Ξένος"
        ],
        "description": {
          "syllabus": "- Υπολογιστικές μέθοδοι ανάλυσης κεραιών: Μέθοδοι πεπερασμένων διαφορών και στοιχείων. μέθοδοι ολοκληρωτικών εξισώσεων. Συναρτήσεις Green. Εξίσωση Pocklington. Εφαρμογές: δίπολα ευρείας ζώνης, κεραίες Yagi-Uda. Ανάλυση γραμμικών κεραιών με το πρόγραμμα NEC.\n- Κεραίες ευρείας ζώνης και ανεξάρτητες συχνότητας: Μεθοδολογίες σχεδίασης ευρυζωνικών κεραιών. Ελικοειδής κεραία. Δικωνική και δισκοκωνική κεραία. Σπειροειδείς και λογαριθμικές περιοδικές κεραίες. Κεραίες υπερευρείας ζώνης (UWB).\n- Επίπεδες κεραίες και κεραίες μικροταινίας: Δομή και λειτουργία κεραίας μικροταινίας. Μοντέλο γραμμής μεταφοράς και αντηχείου. Κατευθυντικότητα, κέρδος και βαθμός απόδοσης, διάγραμμα ακτινοβολίας. Ευρυζωνικές κεραίες μικροταινίας, κεραίες μικροταινίας μικρών διαστάσεων. Τροφοδοσία κεραιών μικροταινίας. Στοιχειοκεραίες κεραιών μικροταινίας. Τυπωμένες κεραίες. Υπολογιστική ανάλυση επίπεδων κεραιών. Συναρτήσεις Green πολυστρωματικού μέσου.\n- Κεραίες μικρών ηλεκτρικών διαστάσεων: Θεμελιώδη όρια κεραιών. Κυκλωματικό και κυματικό μοντέλο. Όριο Chu. Τεχνικές σχεδίασης μικρών κεραιών.\n- Στοιχειοκεραίες: Διάγραμμα ακτινοβολίας, κατευθυντικότητα, κέρδος, βαθμός απόδοσης, εύρος δέσμης ημίσειας ισχύος. Ανομοιόμορφες στοιχειοκεραίες, στοιχειοκεραίες Dolph-Chebyshev και διωνυμικές.\n- Σύνθεση στοιχειοκεραιών σε συστήματα ασύρματων και κινητών επικοινωνιών:  Αναλυτικές και υπολογιστικές τεχνικές σύνθεσης προσαρμοζόμενων στοιχειοκεραιών. Εύρεση κατεύθυνσης άφιξης (direction of arrival) και καθορισμός δέσμης (beamforming). Έξυπνες κεραίες (smart antennas).\n- Κεραίες πολλαπλών εισόδων-εξόδων (ΜΙΜΟ): χωρητικότητα διαύλου, σχεδίαση κεραιών ΜΙΜΟ, τεχνικές περιορισμού σύζευξης.\n- Εργαστηριακές ασκήσεις κεραιών: Μέτρηση κέρδους και διαγράμματος ακτινοβολίας, μέτρηση συντελεστή ανάκλασης και σύνθετης αντίστασης, μέτρηση ηλεκτρικού πεδίου και πυκνότητας ισχύος ηλεκτρομαγνητικής ακτινοβολίας.",
          "outcomes": "1.\tΑπόκτηση εμπειρίας στην ανάλυση και σχεδίαση κεραιών, ειδικά επίπεδων με βάση αρχές σχεδίασης και χρήση ειδικού λογισμικού.\n2.\tΚατανόηση των βασικών λειτουργιών επίπεδων κεραιών, καθώς και προσαρμοζόμενων κεραιών και κεραιών ΜΙΜΟ.\n3.\tΙκανότητα κατασκευής και πειραματικού χαρακτηρισμού κεραιών (κέρδος, συντελεστής ανάκλασης, κατευθυντικότητα). \n"
        },
        "name": "Ειδικές Κεραίες"
      },
      {
        "code": "600198746",
        "humanCode": "077",
        "originalTitle": "Ενσωματωμένα Συστήματα Πραγματικού Χρόνου",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198746",
        "professors": [
          "Νικόλαος Πιτσιάνης"
        ],
        "description": {
          "syllabus": "• Χρονοπρογραμματισμός και ανάθεση πηγών σε πραγματικό χρόνο.\n• Λειτουργικά συστήματα πραγματικού χρόνου και μικροπυρήνες.\n• Ασύρματα δίκτυα και επικοινωνίες πραγματικού χρόνου.\n• Γλώσσες προγραμματισμού για σύγχρονες εφαρμογές και εφαρμογές πραγματικού χρόνου.\n• Σύνθεση προγραμμάτων από προδιαγραφές.\n• Μετα-προγραμματισμός για γλώσσες περιγραφής μετα-μοντέλων.\n• Συ-σχεδιασμός υλικού-λογισμικού.\n• Εφαρμογές.\n",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n• Αποκτήσουν γενικές γνώσεις για το σχεδιασμό και λειτουργία ενσωματωμένων συστημάτων\n• Να αναγνωρίζουν τα προβλήματα διαχείρισης πόρων όπως χρόνος, ενέργεια αλλά και το κόστος υλοποίησης υλικού και λογισμικού και της ανάπτυξης της εφαρμογής\n"
        },
        "name": "Ενσωματωμένα Συστήματα Πραγματικού Χρόνου"
      },
      {
        "code": "600198747",
        "humanCode": "078",
        "originalTitle": "Επιχειρησιακή Έρευνα",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198747",
        "professors": [
          "Κωνσταντίνος Παπαλάμπρου"
        ],
        "description": {
          "syllabus": "Θεωρία και Μέθοδοι  Γραμμικού Προγραμματισμού (Simplex, Γεωμετρική Ερμηνεία, Δυϊκή Θεωρία, Πολυωνυμικές Μέθοδοι, Ειδικές Περιπτώσεις). Αναγκαία Συνθήκη Ελαχίστου (Karush‐Kuhn‐Tucker Condition). Ακεραίος Προγραμματισμός: Μορφοποίηση Προβλημάτων και Μέθοδοι Επίλυσης. Βασικοί Αλγόριθμοι και Θεωρία Συνδυαστικής Βελτιστοποίησης (Προβλήματα Μονοπατιών και Ροής σε Δίκτυα, Ταιριάσματα, Ειδικά Προβλήματα σε Γραφήματα). Στοχαστικές Μέθοδοι. Δυναμικός Προγραμματισμός: Μορφοποίηση και Μέθοδοι Επίλυσης Προβλημάτων. Βασικές Μέθοδοι Μη Γραμμικού Προγραμματισμού. Εφαρμογές των Μεθόδων Επιχειρησιακής Έρευνας σε Διάφορα Πεδία.",
          "outcomes": "1. Κατανοούν πως να μεταφέρουν/μεταφράζουν πραγματικά πρακτικά προβλήματα, που θα δίνονται με τη μορφή περιγραφής, σε ένα μαθηματικό υπόδειγμα/μορφοποίηση.\n2. Αναγνωρίζουν και χρησιμοποιούν τα κατάλληλα μαθηματικά εργαλεία και μεθόδους που απαιτούνται για την επίλυση μεγάλης γκάμας προβλημάτων βελτιστοποίησης.\n3. Χρησιμοποιούν μαθηματικό λογισμικό (γλώσσες μοντελοποίησης/προγραμματισμού) για να επιλύσουν τα προβλήματα χρησιμοποιώντας τεχνικές επιχειρησιακής έρευνας.\n4. Δημιουργουν μια αναφορά που θα περιγράφει το υπόδειγμα και την τεχνική επίλυσης, θα αναλύει τα αποτελέσματα και θα διατυπώνει προτάσεις με γλώσσα κατανοήση προς όλους τους συμμετέχοντες στη διαδικασία λήψης αποφάσεων."
        },
        "name": "Επιχειρησιακή Έρευνα"
      },
      {
        "code": "600198768",
        "humanCode": "099",
        "originalTitle": "Εφαρμογές Τηλεπικοινωνιακών Διατάξεων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198768",
        "professors": [
          "Γεώργιος Σεργιάδης"
        ],
        "description": {
          "syllabus": "Ανάλυση όλων των σύγχρονων τηλεπικοινωνιακών συστημάτων, όπως το DSL, το WiFi, το Bluetooth, αλλά και πολλών άλλων, από την σκοπιά των τηλεπικοινωνιακών συστημάτων, των δυνατοτήτων και των ορίων λειτουργίας τους, το τρόπο χρήσης ή εφαρμογής τους και την προδιαγραφόμενη εξέλιξή τους.",
          "outcomes": "Στόχος είναι η κατανόηση των σύγχρονων ασύρματων δικτύων αισθητήρων και η εισαγωγή στην έννοια του \"Διαδικτύου των Πραγμάτων\". Ο φοιτητής κατανοεί τις ιδιαιτερότητες των σχετικών δικτύων σε σχέση με την τοπολογία τους, τις ενεργειακές τους απαιτήσεις, και τη δρομολόγηση μηνυμάτων. Επιπλέον, κατανοεί τη σχέση μεταξύ πληροφορίας και ρυθμού μετάδοσης και την αναγκαιότητα για ενεργειακή αυτονομία σε τέτοιες εφαρμογές. Τέλος, διδάσκεται επίγειες μεθόδους εντοπισμού θέσης των πομποδεκτών.\n"
        },
        "name": "Εφαρμογές Τηλεπικοινωνιακών Διατάξεων"
      },
      {
        "code": "600198763",
        "humanCode": "094",
        "originalTitle": "Ηλεκτρακουστική ΙΙ",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198763",
        "professors": [
          "Χρήστος Σεβαστιάδης"
        ],
        "description": {
          "syllabus": "Γνωριμία με το εργαστήριο ηλεκτροακουστικών μετρήσεων, ορισμοί και βασικά εργαλεία μετρήσεων, κλασικές ηλεκτροακουστικές μετρήσεις με αναλογικές διατάξεις, σύγχρονες ηλεκτροακουστικές μετρήσεις, ψηφιακές τεχνικές στις προηγμένες μετρητικές διατάξεις, ειδικά περιβάλλοντα μετρήσεων.\n",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα αποκτήσουν την ικανότητα να εκτελούν ακουστικές και ηλεκτρακουστικές μετρήσεις με τη χρήση αναλογικών και ψηφιακών συστημάτων μέτρησης."
        },
        "name": "Ηλεκτρακουστική ΙΙ"
      },
      {
        "code": "600198738",
        "humanCode": "069",
        "originalTitle": "Ηλεκτρονικά Ισχύος ΙΙ",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198738",
        "professors": [
          "Χαράλαμπος Δημουλιάς"
        ],
        "description": {
          "syllabus": "Εξέταση μετατροπέων dc-dc υποβιβασμού της τάσης. Μετατροπείς dc-dc ανύψωσης της τάσης. Μικτοί μετατροπείς dc-dc (ανύψωσης και υποβιβασμού της τάσης). Μετατροπέας dc-dc του Cuk (ανύψωσης και υποβιβασμού της τάσης). Μετατροπέας dc-dc πλήρους γέφυρας. Στοιχειώδης αντιστροφέας (dc-ac) με διαμόρφωση PWM. Τεχνικές διαμόρφωσης (PWM, τετραγωνικής κυματομορφής, απαλοιφής τάσης, εισαγωγής αιχμών τάσης, κλπ). Μονοφασικός αντιστροφέας πλήρους γέφυρας. Τριφασικός αντιστροφέας πλήρους γέφυρας. Μονοφασικός μετατροπέας flyback.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1)αναλύουν την λειτουργία αλλά και θα μπορούν να σχεδιάσουν dc/dc διακοπτικούς μετατροπείς υποβιβασμού της τάσης με βάση σχεδιαστικά κριτήρια.\n2)αναλύουν την λειτουργία αλλά και θα μπορούν να σχεδιάσουν dc/dc διακοπτικούς μετατροπείς ανύψωσης της τάσης με βάση σχεδιαστικά κριτήρια.\n3)αναλύουν την λειτουργία αλλά και θα μπορούν να σχεδιάσουν dc/dc μικτούς διακοπτικούς  μετατροπείς με βάση σχεδιαστικά κριτήρια.\n4)αναλύουν την λειτουργία αλλά και θα μπορούν να σχεδιάσουν dc/ac διακοπτικούς αντιστροφείς χρησιμοποιώντας διάφορες μεθόδους PWM και οι οποίοι υπακούουν σε προκαθορισμένα σχεδιαστικά κριτήρια.\n5)μπορούν να αναλύσουν την αλληλεπίδραση δύο ή περισσοτέρων απο τους ανωτέρω μετατροπείς στο ίδιο ηλεκτρικό δίκτυο."
        },
        "name": "Ηλεκτρονικά Ισχύος ΙΙ"
      },
      {
        "code": "600198742",
        "humanCode": "073",
        "originalTitle": "Θεωρία και Τεχνολογία Πυρηνικών Αντιδραστήρων",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198742",
        "professors": [
          "Αλέξανδρος Κλούβας",
          "Στυλιανή Καδή"
        ],
        "description": {
          "syllabus": "Συγκρότηση πυρηνικών σταθμών. Εννοια της κρισιμότητας.Θεωρία διάχυσης νετρονίων. Εξίσωση διάχυσης μονοενεργειακών νετρονίων. Yπολογισμοί κρισιμότητας, ανακλαστής. Δυναμική των αντιδραστήρων: Μοντέλο σημειακού αντιδραστήρα. Εξάρτηση από χώρο και χρόνο. Προσεγγιστικά μοντέλα. Φυσικοί μηχανισμοί ανάδρασης. Μεταβατικά φαινόμενα και ανάδραση. Συνάρτηση μεταφοράς. Δηλητήρια προϊόντα. Εξάντληση και διαχείριση καυσίμου. Πυρηνικά ατυχήματα.",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, ο σπουδαστής να είναι σε θέση να αξιολογήσει βασικές παραμέτρους  σχεδιασμού ενός  πυρηνικού αντιδραστήρα, και  να διατυπώσει μια επιστημονική γνώμη  στο θέμα των πυρηνικών εγκαταστάσεων και των συνδεδεμένων περιβαλλοντικών επιπτώσεων\n"
        },
        "name": "Θεωρία και Τεχνολογία Πυρηνικών Αντιδραστήρων"
      },
      {
        "code": "600198750",
        "humanCode": "081",
        "originalTitle": "Θεωρία Παιγνίων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198750",
        "professors": [
          "Αθανάσιος Κεχαγιάς"
        ],
        "description": {
          "syllabus": "Το μάθημα είναι μια εισαγωγή στην Θεωρία Παιγνίων. Αφού παρουσιαστούν τα θεμελιώδη στοιχεία της θεωρίας, δίνεται έμφαση στις εφαρμογές σε προβλήματα ηλεκτρολόγου μηχανικού (τηλεπικοινωνίες, δίκτυα, πράκτορες, ρομποτική, ηλεκτρική ενέργεια).  Θα καλυφθούν τα παρακάτω θέματα.\n1. Μαθηματικός ορισμός παιγνίων (σε στρατηγική και εκτεταμένη μορφή) και λύσεων αυτών. Παίγνια δύο ή πολλών παικτών και μηδενικού ή μη-μηδενικού αθροίσματος.\n2. Η λύση minimax και το σημείο ισορροπίας Nash.\n3. Μάθηση, εξέλιξη και υπολογισιμότητα στην Θεωρία Παιγνίων.\n4. Εκτετατμένη μορφή με τέλεια και ατελή πληροφορία. Στοχαστικά παίγνια. Επαναλαμβανόμενα παίγνια. Μικτές και συμπεριφορικές στρατηγικές.\n5. Εφαρμογές της θεωρίας παιγνίων σε μερικά από τα παρακάτω ζητήματα.\n5.1 Καταδίωξη και διαφυγή στην ρομποτική.\n5.2 Τηλεπικοινωνίες.\n5.3 Δρομολόγηση σε δίκτυα υπολογιστών.\n5.4 Διατίμηση ηλεκτρικής ενέργειας.\n",
          "outcomes": "Μετά το πέρας του μαθήματος οι φοιτητές θα μπορούν:\n\n1. Nα επιλύουν συγκεκριμένους τύπους παίγνιων (παίγνια δύο παικτών και μηδενικού αθροίσματος, παίγνια δύο παικτών σε εκτεταμένη μορφή, επαναλαμβανόμενα παίγνια δύο παικτών, παίγνια καταδίωξης και διαφυγής) με αναλυτικές αλλά και υπολογιστικές μεθόδους.\n2. Να χρησιμοποιούν τα βασικά λογισμικά επίλυσης παιγνίων (Gambit, Game Theory Explorer, Maple Game Theory Toolbox).\n3. Να εφαρμόζουν τις έννοιες της ΘΠ στην μοντελοποίηση προβλημάτων μηχανικού (όπως αυτές που αναφέρθηκαν παραπάνω).\n\nΕπιπλέον οι φοιτητές θα έχουν σχηματίσει σαφή διαισθητική αντίληψη της φυσικής σημασίας των εννοιών της Θεωρίας Παιγνίων.\n"
        },
        "name": "Θεωρία Παιγνίων"
      },
      {
        "code": "600198762",
        "humanCode": "093",
        "originalTitle": "Θεωρία Πληροφοριών και Κωδίκων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198762",
        "professors": [
          "Λεωνίδας Γεωργιάδης"
        ],
        "description": {
          "syllabus": "Εντροπία απλής πηγής. Μέτρο πληροφορίας.\nΣυμπίεση δεδομένων. Πρώτο θεώρημα Shannon.\nΚωδικοποίηση διόρθωσης σφαλμάτων. Απλοί δίαυλοι πληροφορίας. Γκαουσιανός δίαυλος.\nΧωρητικότητα διαύλου. Δεύτερο θεώρημα Shannon.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές:\n1. Θα μπορούν να εξετάζουν τις θεμελιώδεις δυνατότητες συστημάτων επικοινωνιών και γενικότερα πληροφοριακών συστημάτων, όσον αφορά στο ρυθμό συμπίεσης και μετάδοσης δεδομένων.\n2. Θα μπορούν να ξεκινήσουν την περαιτέρω μελέτη κωδίκων και υλοποίηση κωδίκων συμπίεσης και διόρθωσης σφαλμάτων με βάση τις βασικές αρχές που θα διδαχθούν στο μάθημα."
        },
        "name": "Θεωρία Πληροφοριών και Κωδίκων"
      },
      {
        "code": "600198766",
        "humanCode": "097",
        "originalTitle": "Θεωρία Σκέδασης",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198766",
        "professors": [
          "Δημήτριος Χρυσουλίδης"
        ],
        "description": {
          "syllabus": "Σκέδαση και ανίχνευση. Eξίσωση ενεργητικής ανίχνευσης. Διατομή σκέδασης. Παράμετροι πόλωσης. Φαινόμενα κίνησης. Στοχαστική διακύμανση. Aρχή ασάφειας. Eξισώσεις Maxwell. Συναρτήσεις δυναμικού. Eξισώσεις Stratton-Chu. Oριακές συνθήκες. Διαμόρφωση προβλήματος σκέδασης. Kαθορισμός πλάτους σκέδασης. Θεώρημα εμπροσθοσκέδασης, Θεωρία κατοπτρικού σημείου. Προσέγγιση εφαπτομενικού επιπέδου. Παράδοξο εξάλειψης. Tεχνική στάσιμης φάσης. Σκέδαση Rayleigh. Προσέγγιση Born. Προσέγγιση WKB. Kυλινδρικός και σφαιρικός σκεδαστής.",
          "outcomes": "Κατανόηση της αλληλεπίδρασης ηλεκτρομαγνητικών κυμάτων με εμπόδια, φυσικά ή τεχνητά, και υλικά μέσα. Ανάπτυξη μαθηματικών δεξιοτήτων για τη θεμελίωση προβλημάτων ακτινοβολίας. Εξοικείωση με βασικές μεθόδους επίλυσης προβλημάτων σκέδασης."
        },
        "name": "Θεωρία Σκέδασης"
      },
      {
        "code": "600198769",
        "humanCode": "100",
        "originalTitle": "Κβαντική Φυσική",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198769",
        "professors": [
          "Νικόλαος Γκανούλης"
        ],
        "description": {
          "syllabus": "Πρώτα ατομικά μοντέλα. Εξίσωση του Schrödinger. Μονοδιάστατα προβλήματα - Σωματίδιο σε πηγάδι δυναμικού. Κβάντωση Στροφορμής. Άτομο υδρογόνου. Αρχή του Pauli – Περιοδικός Πίνακας των Στοιχείων. Δομή των Στερεών – ενεργειακές ζώνες. Κβαντικοί Υπολογιστές.",
          "outcomes": "1. Να κατανοήσουν την αρχή της αβεβαιότητας και την αρχή της κβαντικής υπέρθεσης.\n2. Να λύνουν την εξίσωση Schroedinger σε απλά μονοδιάστατα δυναμικά και σε κεντρικό δυναμικό στο χώρο.\n3. Να εφαρμόζουν τα παραπάνω στη κβαντική δομή του ατόμου του υδρογόνου.\n5. Να βρίσκουν την ηλεκτρονική δομή των στοιχείων και την θέση τους στο περιοδικό πίνακα."
        },
        "name": "Κβαντική Φυσική"
      },
      {
        "code": "600198751",
        "humanCode": "082",
        "originalTitle": "Μικροεπεξεργαστές και Περιφερειακά",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198751",
        "professors": [
          "Ιωάννης Παπαευσταθίου"
        ],
        "description": {
          "syllabus": "•\tEισαγωγή στην διασύνδεση μικροελεγκτή και DSP με συσκευές εισόδου – εξόδου. Γενική περιγραφή της προσαρμοστικής μονάδας (interface) Ι / O.\n•\tΠαράλληλη και σειριακή είσοδος-έξοδος. Σειριακή επικονωνία : Ασύγχρονη και σύγχρονη.\n•\tΠροτεραιότητα διακοπών. Διανυσματικές διακοπές. Λειτουργικά συστήματα πραγματικού χρόνου (RTOS). Διαχείριση διαύλου δεδομένων. Διαχείριση τοπικού διαύλου (DMAC). Διαχείριση  καθολικού διαύλου. Σύνδεση I/O Υπολογιστή σε ΜΥ σύστημα. \n•\tΠεριγραφή του συστήματος Ι / O του ARM. Ι / O καταχωρητές και εντολές. Σύστημα διακοπών του ARM. I/O ports (τρόπος διασύνδεσης, κυκλωματική διάταξη, διασύνδεση LED, διακοπτών και LCD οθόνης). Εναλλακτικές χρήσεις των I/O ports : Χρονόμετρα –  PWM (έλεγχος κινητήρων) - Απαριθμητές, Αναλογικός συγκριτής – ADC - DAC.\n•\tΣειριακά πρωτόκολλα : SPI – USART – I2C – USB – CAN\n•\tΠρωτόκολλα διαύλων υπολογιστών: PCI - PCIe – SATA – VME\n•\tΕισαγωγή στα ασύρματα δίκτυα αισθητήρων (WSN). Πρωτόκολλο Zigbee.\n",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, οι φοιτητές/τριες αναμένεται να μπορούν να:\n• αντιλαμβάνονται την επικοινωνία των μικροελεγκτών με τις περιφερειακές συσκευές\n• να αντιληφθούν την διασύνδεση με χρονόμετρα, κινητήρες και αναλογικά σήματα\n• να συντάξουν και να εκτελέσουν προγράμματα σε συμβολική γλώσσα και C με παράλληλη εκπαίδευση των απαραίτητων εργαλείων για την επικοινωνία με περιφερειακές συσκευές.\n• την εξοικείωση στη χρήση σειριακών πρωτόκολλων επικοινωνίας\n"
        },
        "name": "Μικροεπεξεργαστές και Περιφερειακά"
      },
      {
        "code": "600198761",
        "humanCode": "092",
        "originalTitle": "Οπτικές Επικοινωνίες",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198761",
        "professors": [
          "Εμμανουήλ Κριεζής"
        ],
        "description": {
          "syllabus": "Εισαγωγή στα συστήματα οπτικών επικοινωνιών.\nΟπτικοί κυματοδηγοί και οπτικές ίνες: γενικά χαρακτηριστικά, ακτινική και κυματική θεωρία, οδηγούμενοι ρυθμοί, ονοματολογία ρυθμών. Ειδικοί τύποι ινών. Επίπεδοι οπτικοί κυματοδηγοί.\nΜετάδοση κυμάτων σε οπτικές ίνες: Μηχανισμοί απόσβεσης. Τύποι διασποράς, διασπορά υλικού και κυματοδηγού. Εξίσωση μετάδοσης σε μονόρρυθμες ίνες. Μετάδοση Γκαουσιανών παλμών παρουσία GVD & TOD, μετάδοση παλμών αυθαίρετου σχήματος, πεπερασμένο φασματικό εύρος πηγής. Περιορισμοί στο μέγιστο ρυθμό μετάδοσης λόγω διασποράς.\nΠηγές φωτός: βασικές αρχές Laser, εκπομπή από ημιαγωγούς, δίοδοι Laser (LD), τύποι LD (Fabry-Perot, VCSEL, DBR, DFB), χαρακτηριστικά λειτουργίας, διαμόρφωση. Δίοδοι Εκπομπής Φωτός (LED). Σύζευξη με οπτικές ίνες.\nΟπτικοί ανιχνευτές: φωτοδίοδοι PIN και φωτοδίοδοι χιονοστιβάδας (APD).\nΟπτικός δέκτης απευθείας ανίχνευσης: πηγές θορύβου (θερμικός, κβαντικός, σκοτεινού ρεύματος), κβαντικό όριο, λόγος σήματος προς θόρυβο (SNR), τυπικές δομές δέκτη, ευαισθησία δέκτη, παράγοντες που επηρεάζουν την ευαισθησία, Ρυθμός Σφαλμάτων Ψηφίων (BER).\nΣυστήματα οπτικών επικοινωνιών: συστήματα διαμόρφωσης έντασης / απευθείας ανίχνευσης (IM/DD), βασικές αρχιτεκτονικές συστημάτων, περιορισμοί σχεδίασης, τεχνικές πολυπλεξίας (οπτική πολυπλεξία με διαίρεση χρόνου OTDM, οπτική πολυπλεξία με διαίρεση στο μήκος κύματος WDM). Σύμφωνα συστήματα οπτικών επικοινωνιών (BPSK, QPSK).\nΜη γραμμικά φαινόμενα σε οπτικές ίνες: αυτοδιαμόρφωση φάσης, ετεροδιαμόρφωση φάσης, μείξη τεσσάρων κυμάτων, σολιτόνια, σκέδαση Brillouin και Raman.",
          "outcomes": "1. Κατανόηση του μηχανισμού οδήγησης σε επίπεδους οπτικούς κυματοδηγούς και οπτικές ίνες. Είναι σε θέση να υπολογίζει τους ρυθμούς που υποστηρίζονται από τους παραπάνω κυματοδηγούς.\n2. Κατανόηση σε βάθος των μηχανισμών διασποράς σε οπτικές ίνες/κυματοδηγούς και επίσης της εξίσωσης μετάδοσης παλμών σε μονόρρυθμες οπτικές ίνες.\n3. Γενική κατανόηση της τεχνολογίας οπτικών πηγών ημιαγωγού, με έμφαση στις laser διόδους.\n4. Κατανόηση των βασικών αρχών που διέπουν φωτοδιόδους και οπτικούς δέκτες, όπως πηγές θορύβου και θεμελιώδεις περιοριστικούς παράγοντες.\n5. Κατανόηση των συστημάτων οπτικών επικοινωνιών διαμόρφωσης έντασης / απευθείας ανίχνευσης (IM/DD, OOK): επιδόσεις σε επίπεδο συστήματος, ρυθμός σφαλμάτων (BER), λόγος σήματος-προς-θόρυβο (SNR). Τεχνικές πολυπλεξίας."
        },
        "name": "Οπτικές Επικοινωνίες"
      },
      {
        "code": "600198767",
        "humanCode": "098",
        "originalTitle": "Προηγμένες Τεχνικές Επεξεργασίας Σήματος",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198767",
        "professors": [
          "Λεόντιος Χατζηλεοντιάδης"
        ],
        "description": {
          "syllabus": "Σύγχρονες μέθοδοι επεξεργασίας σημάτων οι οποίες παρουσιάζουν ενδιαφέρον τόσο στην περιοχή των ιατρικών σημάτων όσο και στην ανάλυση άλλων σημάτων γενικότερα. Στατιστική ανώτερης τάξης. Στατιστική τρίτης και τέταρτης τάξης. Υπολογισμός σωρειτών και φασμάτων τρίτης και τέταρτης τάξης. Μοντέλα αυτοπαλινδρόμησης με χρήση στατιστικής ανώτερης τάξης. Ανάλυση χρόνου-συχνότητας. Εισαγωγή στην ανάλυση σήματος με χρήση κυματιδίων. Συνεχή και διακριτά κυματίδια. Πολυδιακριτή ανάλυση. Σχεδίαση προσαρμοσμένων φίλτρων. Αποθορυβοποίηση σημάτων. Ανίχνευση και προσδιορισμός καθυστερήσεων και ασυνεχειών. Εφαρμογές σε ιατρικά σήματα όπως καρδιακοί ήχοι, αναπνευστικοί ήχοι, προκλητά δυναμικά, καρδιογράφημα, εγκεφαλογράφημα. Εφαρμογή σε άλλα σήματα μεγάλης πολυπλοκότητας (σεισμικά σήματα).",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα έχουν το επίπεδο για την κατανόηση επεκτάσεων των βασικών μεθοδολογιών ανάλυσης σημάτων στην κατεύθυνση της προηγμένης επεξεργασίας και ανάλυσης των σημάτων. Αξιολόγηση των μεθοδολογιών ως προς τις δυνατότητες πρακτικής εφαρμογής με ιδιάζουσες συνθήκες (π.χ., παρουσία έντονου θορύβου) και ανάπτυξη κριτικού πνεύματος για την επιλογή των κατάλληλων μεθόδων ανάλυσης σημάτων."
        },
        "name": "Προηγμένες Τεχνικές Επεξεργασίας Σήματος"
      },
      {
        "code": "600198753",
        "humanCode": "084",
        "originalTitle": "Προσομοίωση και Μοντελοποίηση Δυναμικών Συστημάτων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198753",
        "professors": [
          "Γεώργιος Ροβιθάκης"
        ],
        "description": {
          "syllabus": "Μοντέλα δυναμικών συστημάτων\nΓραμμική παραμετροποίηση\nΑλγόριθμοι εκτίμησης παραμέτρων μη-πραγματικού χρόνου και η μέθοδος των ελαχίστων τετραγώνων\nΑλγόριθμοι εκτίμησης παραμέτρων πραγματικού χρόνου (μέθοδος μέγιστης καθόδου, μέθοδοι Lyapunov)\nΕύρωστοι αλγόριθμοι εκτίμησης παραμέτρων (παραμετρική ολίσθηση, σ-τροποποίηση, διακοπτική σ-τροποποίηση, νεκρή ζώνη, μέθοδος προβολής)\nΔιαδικασίες επιλογής δομής μοντέλου\nΑξιολόγηση μοντέλου",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\nα) κατασκευάζουν μαθηματικά μοντέλα από δεδομένα και θα τα υλοποιούν σε κώδικα MATLAB,\nβ) σχεδιάζουν και θα αναλύουν αλγορίθμους εκτίμησης παραμέτρων (πραγματικού χρόνου ή μη) μαθηματικών μοντέλων και θα τους υλοποιούν σε κώδικα MATLAB,\nγ) αξιολογούν την απόδοση μαθηματικών μοντέλων."
        },
        "name": "Προσομοίωση και Μοντελοποίηση Δυναμικών Συστημάτων"
      },
      {
        "code": "600198754",
        "humanCode": "085",
        "originalTitle": "Ρομποτική",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198754",
        "professors": [
          "Ζωή Δουλγέρη"
        ],
        "description": {
          "syllabus": "-\tΕφαρμογές, Δομή ρομποτικού βραχίονα\n-\tΘέση και προσανατολισμός στερεών σωμάτων στον χώρο\n-\tΚινηματική ρομποτικού βραχίονα (πλαίσια, DH παράμετροι, ευθύ και αντίστροφο κινηματικό πρόβλημα)  \n-\tΤαχύτητα στερεού σώματος, Συστροφές, Μετασχηματισμός και σύνθεση συστροφών.\n-\tΙακωβιανές- μέθοδοι υπολογισμού, αντιστροφή, ιδιάζοντα σημεία.  \n-\tΣχεδιασμός τροχιάς στον χώρο των αρθρώσεων και της αρπάγης.\n-\tΑνάπτυξη δυναμικού μοντέλου μηχανικών συστημάτων με την μέθοδο Langrange. Εξειδίκευση σε ρομπότ σε κίνηση και επαφή. \n-\tΑτομικός έλεγχος αρθρώσεων σε ρομποτικό βραχίονα\n-\tΜέθοδοι ελέγχου του συνολικού βραχίονα (υπολογισμένης ροπής, επιλυμένης επιτάχυνσης)\n-\tΜέθοδοι ελέγχου θέσης/δύναμης του άκρου του βραχίονα, (υβριδικός έλεγχος, παράλληλος έλεγχος, έλεγχος εμπέδησης)\n",
          "outcomes": "Ο μαθησιακός στόχος του μαθήματος της Ρομποτικής είναι η μεταβίβαση στον φοιτητή της βασικής γνώσης και κατανόησης των εννοιών και των τεχνολογιών που αφορούν του ρομποτικούς βραχίονες και την χρήση τους σε βιομηχανικές εφαρμογές.\nΜαθησιακά Αποτελέσματα\n1.   Βασική κατανόηση της λειτουργίας ενός βραχίονα (υλικό και λογικό)\n2. Εκμάθηση των μαθηματικών εργαλείων που περιγράφουν θέση, προσανατολισμό και κίνηση στερεών σωμάτων και αλυσίδων στερεών σωμάτων (ρομπότ) στον τρισδιάστατο χώρο.\n3. Απόκτηση γνώσεων και δεξιοτήτων\n       - στην σχεδίαση τροχιών κίνησης ρομπότ.\n       - στην ανάπτυξη των δυναμικών μοντέλων μηχανικών συστημάτων και\n           ειδικότερα ρομποτικών βραχιόνων.\n       - στην σχεδίαση νόμων και δομών ελέγχου της κίνησης ενός ρομπότ και\n         της δύναμης που εφαρμόζει σε περιπτώσεις επαφής με το περιβάλλον.\n"
        },
        "name": "Ρομποτική"
      },
      {
        "code": "600198741",
        "humanCode": "072",
        "originalTitle": "Σταθμοί Παραγωγής Ηλεκτρικής Ενέργειας",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198741",
        "professors": [
          "Βασίλειος Χατζηαθανασίου",
          "Στυλιανή Καδή"
        ],
        "description": {
          "syllabus": "Σύγχρονοι σταθμοί παραγωγής ηλεκτρικής ενέργειας: συμβατικοί θερμικοί, πυρηνικοί, υδροηλεκτρικοί. Καύσιμα-διαχείριση καυσίμων. Καύση: Υπολογισμοί καύσης, εξισώσεις καύσης, θερμότητα καύσης, σύσταση- ποσότητα καυσαερίων. Εστίες-καυστήρες. Ατμοπαραγωγοί: κατάταξη ατμοπαραγωγών, βαθμός απόδοσης, ανάλυση απωλειών. Βοηθητικά ατμοπαραγωγών: Ανεμιστήρες, προθερμαντές αέρα, οικονομητήρας, τύμπανο, προθερμαντές νερού, υπερθερμαντές, αναθερμαντές, συμπυκνωτής. Στρόβιλοι. Ρύποι-φίλτρα. Πύργοι ψύξης. Συστήματα διαχείρισης τέφρας.",
          "outcomes": "Οι φοιτητές αναμένεται ότι στα πλαίσια του μαθήματος να: \n•\tΕμβαθύνουν στα Θερμοδυναμικά Κύκλα Rankine και Brayton.\n•\tΚατανοήσουν την  θεωρία της καύσης  και να είναι σε θέση να υπολογίσουν την ποσότητα του αέρα καύσης και την σύσταση και ποσότητα των καυσαερίων\n•\tΚατανοήσουν τις αρχές λειτουργίας  των βασικών τύπων σταθμών παραγωγής ηλεκτρικής ενέργειας\n•\tΕίναι σε θέση να υπολογίσουν χαρακτηριστικά μεγέθη επιμέρους τμημάτων (π.χ ατμογεννήτριες, στρόβιλοι κλπ.)  των σταθμών\n•\t Είναι σε θέση να υπολογίσουν χαρακτηριστικά μεγέθη συνολικά (π.χ. βαθμός απόδοσης, κατανάλωση) των σταθμών\n"
        },
        "name": "Σταθμοί Παραγωγής Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600198740",
        "humanCode": "071",
        "originalTitle": "Συστήματα Αντικεραυνικής Προστασίας και Γειώσεων",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198740",
        "professors": [
          "Παντελεήμων Μικρόπουλος",
          "Θωμάς Τσοβίλης"
        ],
        "description": {
          "syllabus": "Μηχανισμοί του κεραυνού, Θεωρία αντικεραυνικής προστασίας, Συστήματα Αντικεραυνικής Προστασίας (ΣΑΠ), Κανονισμοί ΣΑΠ, Υλικά και κατασκευή ΣΑΠ, Προστασία ευαίσθητου ηλεκτρονικού εξοπλισμού, Γειώσεις ΣΑΠ, Δοκιμές ΣΑΠ. Θεωρία γειώσεων, Γενικοί κανονισμοί γειώσεων, Γειώσεις γραμμών και υποσταθμών, Δοκιμές γειώσεων.",
          "outcomes": "• Η κριτική κατανόηση των βασικών αρχών σχεδίασης συστημάτων αντικεραυνικής προστασίας και γείωσης κοινών κατασκευών και συστημάτων ηλεκτρικής ενέργειας.\n• Η ικανότητα σχεδίασης και υλοποίησης συστημάτων αντικεραυνικής προστασίας και γείωσης σύμφωνα με τους σχετικούς Ελληνικούς και διεθνείς κανονισμούς.\n• Η ικανότητα εκπόνησης αναλυτικής μελέτης αντικεραυνικής προστασίας και σύνταξης σχετικής γραπτής έκθεσης.\n• Η προσωπική ανάπτυξη μέσω της ενεργούς συμμετοχής και της ομαδικής εργασίας, στο πλαίσιο εκπόνησης αναλυτικής μελέτης αντικεραυνικής προστασίας και γείωσης από ομάδες ολιγάριθμων φοιτητών."
        },
        "name": "Συστήματα Αντικεραυνικής Προστασίας και Γειώσεων"
      },
      {
        "code": "600198737",
        "humanCode": "068",
        "originalTitle": "Σύγχρονες Μηχανές",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198737",
        "professors": [
          "Χαράλαμπος Δημουλιάς"
        ],
        "description": {
          "syllabus": "Κατασκευαστικά στοιχεία των ΣΜ (κατασκευή του δρομέα, του στάτη, της διέγερσης, του συστήματος ψύξης, των πόλων του δρομέα, των τυλιγμάτων απόσβεσης). Ανάλυση της στοιχειώδους ΣΜ για την κατανόηση της δημιουργίας των μαγνητικών πεδίων σε αυτήν. Δημιουργία του στρεφόμενου μαγνητικού πεδίου. Ανάλυση της δημιουργίας ροπής από την αλληλεπίδραση των πεδίων του στάτη και δρομέα. Διαμόρφωση των τυλιγμάτων του στάτη για την επίτευξη ημιτονοειδούς τάσης σε αυτόν. Εξαγωγή του ισοδύναμου ηλεκτρικού μοντέλου της ΣΜ. Διάκριση μεταξύ μηχανών με κυλινδρικό δρομέα και μηχανών με δρομέα εκτύπων πόλων. Επίδραση του μαγνητικού κορεσμού σε μία ΣΜ. Ανάλυση των απωλειών κατά την λειτουργία σε μόνιμη κατάσταση. Επιμερισμός των απωλειών σε εξαρτώμενες και μη από την φόρτιση της μηχανής. Ρύθμιση της ενεργού και άεργου ισχύος σε μία ΣΜ. Ανάλυση της περιοχής ασφαλούς λειτουργίας. Συγχρονισμός της μηχανής με το ηλεκτρικό δίκτυο. Παράλληλη λειτουργία δύο σύγχρονων γεννητριών που τροφοδοτούν αυτόνομα ένα φορτίο. Λειτουργία μιας σύγχρονης μηχανής σε σύνδεση με άπειρο ζυγό. Συμπεριφορά μιας σύγχρονης γεννήτριας σε συμμετρικά και ασύμμετρα βραχυκυκλώματα στους ακροδέκτες της. Εξαγωγή των ισοδυνάμων κυκλωμάτων στα διάφορα στάδια ενός βραχυκυκλώματος.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1)μπορούν να κάνουν το βασικό σχεδιασμό του στάτη και του δρομέα μιας σύγχρονης μηχανής έτσι ώστε να δημιουργηθούν τα κατάλληλα μαγνητικά πεδία για την ανάπτυξη ηλεκτρομαγνητικής ροπής.\n2) μπορούν να προσδιορίσουν τα όρια λειτουργίας μιας σύγχρονής μηχανής στην μόνιμη κατάσταση λειτουργίας και να υπολογίζουν τα διάφορα ηλεκτρικά μεγέθη της\n3) μπορούν να υπολογίσουν την συμπεριφορά μιας σύγχρονης μηχανής σε κατάσταση συμμετρικού και ασύμμετρου βραχυκυκλώματος στους ακροδέκτες της.\n4) μπορούν να προσδιορίσουν τον απαιτούμενο έλεγχο που πρέπει να επιβληθεί στην διέγερση μιας σύγχρονης μηχανής έτσι ώστε να επηρεάσουν την άεργη ισχύ της, την τάση στους ακροδέκτες της και την ρύθμιση του συντελεστή ισχύος.\n5) μπορούν να διαφοροποιούν τις ανωτέρω  μεθοδολογίες υπολογισμού σε συνάρτηση με το είδος του δρομέα (κυλινδρικός ή έκτυπων πόλων).\n"
        },
        "name": "Σύγχρονες Μηχανές"
      },
      {
        "code": "600198743",
        "humanCode": "074",
        "originalTitle": "Τεχνολογία Ηλεκτροτεχνικών Υλικών",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198743",
        "professors": [
          "Γεώργιος Λιτσαρδάκης"
        ],
        "description": {
          "syllabus": "Μαγνητοστατική. Θεωρία των μαγνητικών υλικών. Μαγνητικά κυκλώματα. Υλικά μονίμων μαγνητών. Απώλειες στα μαγνητικά υλικά. Υλικά της τεχνολογίας των ισχυρών ρευμάτων. Υλικά της τεχνολογίας των ασθενών ρευμάτων. Εργαστήριο μαγνητικών μετρήσεων και ελέγχου υλικών.",
          "outcomes": "Οι φοιτητές αναμένεται ότι στα πλαίσια του μαθήματος θα είναι σε θέση\n-να εξηγούν τις θεμελιώδεις έννοιες του μαγνητισμού και τα μαγνητικά φαινόμενα\n-να συσχετίζουν τις μαγνητικές ιδιότητες των υλικών με τη λειτουργία των διατάξεων στις οποίες χρησιμοποιούνται,\n-να εκπονούν μελέτες και να επιλύουν προβλήματα σχεδίασης διατάξεων που περιλαμβάνουν μαγνητικά υλικά.\n"
        },
        "name": "Τεχνολογία Ηλεκτροτεχνικών Υλικών"
      },
      {
        "code": "600198755",
        "humanCode": "086",
        "originalTitle": "Τεχνολογία Λογισμικού",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198755",
        "professors": [
          "Ανδρέας Συμεωνίδης"
        ],
        "description": {
          "syllabus": "Το μάθημα αποτελεί μια εισαγωγή στις τεχνικές και τη μεθοδολογία σχεδίασης, ανάπτυξης, υλοποίησης και εγκατάστασης μεγάλων έργων λογισμικού καθώς και της διαχείρισής τους. Στα πλαίσια του μαθήματος θα παρουσιαστούν οι τεχνικές και οι μεθοδολογίες που σχετίζονται με τον κύκλο ζωής του λογισμικού και αφορούν την διαχείριση έργων λογισμικού, την ανάλυση απαιτήσεων και την μοντελοποίηση λογισμικού, τον έλεγχο αξιοπιστίας και την εγκατάσταση προϊόντων λογισμικού. \nΤα περιεχόμενα του μαθήματος περιλαμβάνουν τα εξής:\n•\tΕισαγωγή στην Τεχνολογία Λογισμικού. \n•\tΑπαιτήσεις και προδιαγραφές λογισμικού. \n•\tΜέθοδοι για τον προσδιορισμό των απαιτήσεων του λογισμικού. \n•\tΠρογραμματισμός έργων λογισμικού. \n•\tΤεχνικές και εργαλεία για τη σχεδίαση μεγάλων συστημάτων λογισμικού. \n•\tΚωδικοποίηση και τεκμηρίωση προγράμματος. \n•\tΈλεγχος ορθότητας λογισμικού και παράδοση του συστήματος. \n•\tΣυντήρηση και ενημέρωση του λογισμικού.\n",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, οι φοιτητές/τριες αναμένεται να μπορούν να: \na)\tΑναγνωρίσουν τους διάφορους τύπους απαιτήσεων λογισμικού και να ολοκληρώσουν τη συγγραφή απαιτήσεων για ένα απλό έργο,\nb)\tΠαρακολουθούν τις φάσεις της διαδικασίας λογισμικού,\nc)\tΕκφράζουν τυπικά μοντέλα προδιαγραφών,\nd)\tΕπιλέγουν την κατάλληλη αρχιτεκτονική λογισμικού με βάση τις απαιτήσεις του προβλήματος τους,\ne)\tΠάρουν αποφάσεις σχετικά με την αποσύνθεση του συστήματος, τον έλεγχο πρόσβασης και τις οριακές συνθήκες,\nf)\tΕπιλέγουν πρότυπα σχεδίασης και να καθορίζουν τις αντίστοιχες διεπαφές ανάμεσα στα υποσυστήματα,\ng)\tΧειρίζονται κάποια βασικά εργαλεία ανάπτυξης λογισμικού.\n"
        },
        "name": "Τεχνολογία Λογισμικού"
      },
      {
        "code": "600198764",
        "humanCode": "095",
        "originalTitle": "Τηλεοπτικά Συστήματα",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198764",
        "professors": [
          "Γεώργιος Καλλίρης"
        ],
        "description": {
          "syllabus": "Ιστορία και εξέλιξη της τηλεόρασης, Βασικές αρχές δημιουργίας της εικόνας, Φως & χρώμα, Τηλεοπτική κάμερα, Συστήματα εγγραφής, Συστήματα αναπαραγωγής, Ψηφιακή τηλεόραση  (Digital Television), Ψηφιακά Συστήματα Μαγνητοσκόπησης, Γραμμικά και μη-γραμμικά συστήματα αποθήκευσης, πρότυπα ψηφιακής μετάδοσης εικόνας.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα αποκτήσουν γνώση γύρω από τα Τηλεοπτικά Συστήματα, ξεκινώντας από την θεωρία του φωτισμού, οπτικής, της ανθρώπινης όρασης, φωτογραφίας και του κινηματογράφου. Σε συνέχεια θα μελετήσουν το ολοκληρωμένο τηλεοπτικό σήμα και τρόπους επεξεργασίας του, τόσο στο αναλογικό, όσο και στο ψηφιακό πεδίο. Θα αποκτήσουν γνώση γύρω από τα πρωτόκολλα συμπίεσης δεδομένων μεγάλου όγκου, μέσω ειδικευμένων πρωτοκόλλων όπως MPEG1 , 2 και 4. Τέλος θα εξετάσουν τους τρόπους ψηφιακής μετάδοσης του οπτικοακουστικού σήματος μέσο επίγειων, δορυφορικών και οπτικών δικτυακών συστημάτων."
        },
        "name": "Τηλεοπτικά Συστήματα"
      },
      {
        "code": "600198756",
        "humanCode": "087",
        "originalTitle": "Τηλεπικοινωνιακή Ηλεκτρονική",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198756",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "Βασικές έννοιες - ορισμοί RF σχεδίασης, Ισοδύναμα του τρανζίστορ στις υψηλές συχνότητες και ανάλυση θορύβου, Παθητικά στοιχεία και μετρήσεις στις υψηλές συχνότητες, Προσαρμογή, Ενισχυτές χαμηλού θορύβου (LNA), Αρχές σχεδίασης ενισχυτών ισχύος, Μείκτες - Ταλαντωτές, Βρόχος κλειδώματος φάσης (PLL).\nΤο μάθημα περιλαμβάνει υποχρεωτική εργασία σε θέματα που αφορούν σε πρόσφατες εξελίξεις στη σχεδίαση τηλεπικοινωνιακών κυκλωμάτων (πομποί, δέκτες, ολοκληρωμένα κυκλώματα για κινητή και ασύρματη τηλεφωνία, δέκτες GPS, ολοκληρωμένα πηνία κ.λ.π.) και παρουσιάζεται από τους φοιτητές σε ομάδες των δύο (συνήθως) ατόμων. Επίσης περιλαμβάνει σχεδίαση απλού ολοκληρωμένου στοιχείου και προσομοίωση του με πρόγραμμα ηλεκτρομαγνητικής ανάλυσης (HFSS). Η παρακολούθηση των παρουσιάσεων είναι υποχρεωτική για όλους.",
          "outcomes": "1.\tΚατανόηση λειτουργίας κυκλωμάτων υψηλών συχνοτήτων (RF)\n2.\tΕξοικείωση με τις ιδιαίτερες δυσκολίες και τα προβλήματα στη σχεδίαση για υψηλές συχνότητες.\n3.\tΓνωριμία με εργαλεία ηλεκτρομαγνητικής προσομοίωσης.\n4.\tΕκμάθηση μεθόδων συστηματικής βιβλιογραφικής αναζήτησης \n5.\tΑνάπτυξη ικανοτήτων παρουσίασης τεχνικών θεμάτων\n"
        },
        "name": "Τηλεπικοινωνιακή Ηλεκτρονική"
      },
      {
        "code": "600198757",
        "humanCode": "088",
        "originalTitle": "Υπολογιστική Νοημοσύνη",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198757",
        "professors": [
          "Ιωάννης Θεοχάρης"
        ],
        "description": {
          "syllabus": "Ασαφή Συστήματα: Ασαφή σύνολα, ιδιότητες και πράξεις ασαφών συνόλων, συναρτήσεις συμμετοχής. Θεώρημα ανάλυσης (resolution principle) και επέκτασης (extension principle). Σύνολα α-cuts, τομή, ένωση και συμπλήρωμα ασαφών συνόλων.\nΑσαφείς σχέσεις, ιδιότητες και πράξεις ασαφών σχέσεων, σύνθεση ασαφών σχέσεων, τελεστές σύνθεσης, σύνθεση ασαφών συνόλων και ασαφών σχέσεων. Λεκτικές μεταβλητές και αρχές ασαφούς λογικής.\nΑσαφείς IF/THEN κανόνες και σχέσεις συμπερασμού. Ασαφείς βάσεις κανόνων, συνθετική και επιμεριστική μέθοδος εξαγωγής συμπεράσματος. Δομή ασαφών συστημάτων, διαμερισμός του τμήματος υπόθεσης, μορφές ασαφοποιητή (fuzzifier) και μέθοδοι από-ασαφοποίησης (defuzzifier).\nΑσαφείς ελεγκτές, δομή ασαφών ελεγκτών, ασαφείς ελεγκτές PI, PD και PID. Σχεδίαση βάσης κανόνων ελεγκτών FZ-PI, FZ-PD και ελεγκτές τριών όρων FZ-PID. Συγκριτική σχεδίαση κερδών, αναλογία κερδών ασαφών και γραμμικών ελεγκτών, συγκριτική ρύθμιση κερδών, πειραματικά αποτελέσματα ασαφών ελεγκτών.\nΑσαφή μοντέλα TSK και μοντέλα με κανόνες singleton. Αλγόριθμοι εκπαίδευσης προσαρμοστικών ασαφών-νευρωνικών δικτύων. Αλγόριθμοι ομαδοποίησης δεδομένων. Αλγόριθμος FCM και εφαρμογές.\n\nΝευρωνικά Δίκτυα: Μοντέλο perceptron και κανόνες μάθησης δικτύων ΝΝ. Επιβλεπόμενη, μη επιβλεπόμενη και ενισχυτική μάθηση.  Μονοστρωματικά και πολυστρωματικά ΝΝ. Αλγόριθμος επιβλεπόμενης εκπαίδευσης back propagation. Νευρωνικά δίκτυα RBF, ισοδυναμία με ασαφή συστήματα. Αυτό-οργανούμενα δίκτυα SOFM. Αλγόριθμος Learning Vector Quantization (LVQ). Εφαρμογές ΝΝ σε προβλήματα πρόβλεψης και ελέγχου.\nΕνσωμάτωση ασαφών και νευρωνικών συστημάτων, μοντέλα neuro-fuzzy.\n",
          "outcomes": "1.\tΑφομοίωση των αρχών και της λειτουργίας των διαφόρων διαδικασιών που απαρτίζουν τα ασαφή συστήματα: λεκτικές περιγραφές, υλοποίηση ασαφών κανόνων IF/THEN, μεθοδολογίες εξαγωγής συμπεράσματος \n2.\tΓια ένα δεδομένο πρόβλημα, ο φοιτητής θα πρέπει να είναι σε θέση να διαμορφώσει την κατάλληλη βάση ασαφών κανόνων, να επιλέξει τον βέλτιστο τύπο τελεστή επαγωγής, και τον τύπο της διαδικασίας αασφοποίησης και από-ασαφοποίησης. \n3.\tΌσον αφορά το πρόβλημα ελέγχου, θα πρέπει να είναι σε θέση να αναπτύξει τον κατάλληλο ασαφή ελεγκτή, να διαμορφώσει την βάση των κανόνων ελέγχου, και να ακολουθήσει την σωστή διαδικασία ρύθμισης των κερδών εισόδου-εξόδου για βέλτιστη απόκριση του συστήματος.\n4.\tΑναφορικά με τα ασαφή μοντέλα για αναγνώριση συστημάτων και πρόβλεψη χρονοσειρών, θα πρέπει να μπορεί να σχεδιάσει το κατάλληλο ασαφές μοντέλο, να επιλέξει και να υλοποιήσει την μέθοδο εκμάθησης των παραμέτρων του.\n5.\tΚατανόηση των αρχών των αλγορίθμων ασαφούς ομαδοποίησης δεδομένων και της εφαρμογής στην επίλυση προβλημάτων ταξινόμησης\n6.\tΚατανόηση και εμβάθυνση στις αρχές και μεθόδους εκμάθησης των ΝΝ. \n7.\tΜελέτη των διαφόρων τύπων νευρωνικών δικτύων,  των μεθόδων εκπαίδευσης τους και της εφαρμογής σε προβλήματα ελέγχου, μοντελοποίησης και ταξινόμησης\n8.\tΔιασύνδεση μεταξύ ασαφών και νευρωνικών μοντέλων και εμβάθυνση στις αρχές λειτουργίας τους\n"
        },
        "name": "Υπολογιστική Νοημοσύνη"
      },
      {
        "code": "600198729",
        "humanCode": "060",
        "originalTitle": "Υπολογιστικός Ηλεκτρομαγνητισμός",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198729",
        "professors": [
          "Εμμανουήλ Κριεζής",
          "Τραϊανός Γιούλτσης",
          "Νικόλαος Κανταρτζής"
        ],
        "description": {
          "syllabus": "Μεταβολικές αρχές και τεχνικές:\n- Εισαγωγή στις βασικές έννοιες του λογισμού των μεταβολών.\n- Διατύπωση των εξισώσεων Maxwell μέσω της αρχής Hamilton.\n- H μη ομογενής εξίσωση Helmholtz ως πρόβλημα του λογισμού των μεταβολών.\nΜέθοδοι σταθμισμένων υπολοίπων:\n- H έννοια του σταθμισμένου υπολοίπου στην εκτίμηση του σφάλματος κατά την αναλυτική και αριθμητική προσεγγιστική επίλυση πεδιακών προβλημάτων.\n- Οι τεχνικές Point-Matching, Rayleigh-Ritz, Galerkin, Least Squares, και Sub-domain Collocation ως ειδικές περιπτώσεις της γενικής μεθοδολογίας των σταθμισμένων υπολοίπων.\n- Αριθμητικές μέθοδοι στην επίλυση σύνθετων πεδιακών προβλημάτων.\nΕισαγωγή στις υπολογιστικές μεθόδους:\n- Μέθοδος πεπερασμένων διαφορών (Finite Difference Method): διακριτοποίηση συνεχούς περιοχής, εξισώσεις διαφορών, εκτίμηση σφάλματος, επαναληπτικές τεχνικές,  τεχνικές Gauss-Seidel, SOR, Crank-Nicolson, Dufort-Frankel.\n- Μέθοδος πεπερασμένων στοιχείων (Finite Element Method): διακριτοποίηση, τοπική-ολική αρίθμηση, συναρτήσεις μορφής, μητρώα ακαμψίας και φορτίου, επίλυση συστημάτων, μετα-επεξεργασία και απεικονίσεις αριθμητικών αποτελεσμάτων.\n- Μέθοδος ροπών και οριακών στοιχείων (Moment and Boundary Element Method): συναρτήσεις βάσης και βάρους, κατηγορίες ολοκληρωτικών εξισώσεων,  συναρτήσεις Green.\n- Μέθοδος πεπερασμένων διαφορών στο πεδίο του χρόνου (Finite-Difference Time-Domain Method): εξισώσεις διαφορών, αλγόριθμος Yee, ευστάθεια, διασπορά, προβλήματα ανοιχτού ορίου, απορροφητικές οριακές συνθήκες, τεχνική PML.\n",
          "outcomes": "Οι δύο κύριοι στόχοι του μαθήματος είναι οι ακόλουθοι:\n1. Nα διδάξει στους φοιτητές πώς τίθεται, αναλύεται και επιλύεται αριθμητικά ένα πρόβλημα του ηλεκτρομαγνητικού πεδίου.\n2. Nα προσφέρει στους φοιτητές μια γενική επισκόπηση των συνηθέστερων υπολογιστικών μεθόδων, με έμφαση σε μερικές από τις περισσότερο δημοφιλείς μεθόδους, όπως η Μέθοδος των Πεπερασμένων Διαφορών (FDM), η Μέθοδος των Πεπερασμένων Στοιχείων (FEM), η Μέθοδος των Οριακών Στοιχείων (BEM), η Μέθοδος των Ροπών (MOM) και Μέθοδος των Πεπερασμένων Διαφορών στο Πεδίο του Χρόνου (FDTD)."
        },
        "name": "Υπολογιστικός Ηλεκτρομαγνητισμός"
      },
      {
        "code": "600198739",
        "humanCode": "070",
        "originalTitle": "Υψηλές Τάσεις ΙΙ",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198739",
        "professors": [
          "Παντελεήμων Μικρόπουλος",
          "Θωμάς Τσοβίλης"
        ],
        "description": {
          "syllabus": "Διηλεκτρικές μετρήσεις, Ανίχνευση μερικών εκκενώσεων, Εφαρμογές υψηλών τάσεων στις ηλεκτρικές μηχανές, Προστασία και μονώσεις γραμμών υψηλών τάσεων, Μονωτήρες και καλώδια υψηλών τάσεων, Τεχνολογία και δοκιμές διακοπτών ισχύος, HVDC συστήματα μεταφοράς, Ηλεκτροστατικές εφαρμογές και κίνδυνοι.",
          "outcomes": "• Η κριτική κατανόηση των βασικών αρχών και προβλημάτων της τεχνολογίας των υψηλών τάσεων, με έμφαση στις εφαρμογές των υψηλών τάσεων στα συστήματα ηλεκτρικής ενέργειας.\n• Η ανάπτυξη πρακτικών δεξιοτήτων σχετικά με τη χρήση και τις εφαρμογές των υψηλών τάσεων, μέσω της απόκτησης εργαστηριακής εμπειρίας.\n• Η ικανότητα σχεδίασης και υλοποίησης γεννητριών παραγωγής και συστημάτων μέτρησης υψηλών τάσεων σύμφωνα με τους σχετικούς κανονισμούς τυποποίησης δοκιμών ηλεκτρολογικού εξοπλισμού για τη διασφάλιση της ποιότητάς του.\n• Η ικανότητα διεξαγωγής εργαστηριακών μετρήσεων, αξιολόγησης των αποτελεσμάτων και εξαγωγής γενικών συμπερασμάτων μέσω επεξεργασίας των μετρήσεων, και σύνταξης σχετικής γραπτής έκθεσης.\n• Η προσωπική ανάπτυξη μέσω της ενεργούς συμμετοχής και της ομαδικής εργασίας, στο πλαίσιο εκπόνησης εργαστηριακών ασκήσεων από ομάδες ολιγάριθμων φοιτητών."
        },
        "name": "Υψηλές Τάσεις ΙΙ"
      },
      {
        "code": "600198758",
        "humanCode": "089",
        "originalTitle": "Ψηφιακά Συστήματα HW σε Χαμηλά Επίπεδα Λογικής II",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198758",
        "professors": [
          "Βασίλειος Παυλίδης"
        ],
        "description": {
          "syllabus": "Aνάλυση ακουλουθιακών στοιχείων FF και μανδαλωτών, αρχές σχεδίασης ψηφιακών ακολουθιακών κυκλωμάτων, ανάλυση και αντιμετώπιση hazards σε συνδυαστικά κυκλώματα, μεθοδολογία σχεδίασης μηχανών FSM (Finite State Machine)(μοντέλα Mealy και Moore), ανάλυση και μοντελοποίηση φαινομένου μετασταθερότητας, συγχρονισμός ασύγχρονων σημάτων, κυκλώματα συγχρονισμού μεταξύ διαφορετικών περιοχών ρολογιού, ανάλυση και σχεδίαση κυκλωμάτων μνήμης FIFO. Εισαγωγή στη γλώσσα Verilog, περιγραφή συνδυαστικής και ακολουθιακής λογικής, δημιουργία διανυσμάτων επαλήθευσης, περιγραφή FSM\n",
          "outcomes": "1. Εκμάθηση αρχών σχεδίασης ψηφιακών ακολουθιακών κυκλωμάτων\n2. Εκμάθηση και εφαρμογή μεθοδολογίας σχεδίασης Μηχανών Πεπερασμένων Καταστάσεων (FSM)\n3. Κατανόηση τεχνικών συγχρονισμού για ασύγχρονα σήματα και πολλαπλά περιοχές χρονισμού\n4. Εκμάθηση της γλώσσας περιγραφής υλικού - Verilog και εφαρμογή αυτής στη σχεδίαση ψηφιακών κυκλωμάτων\n5. Εκμάθηση και εφαρμογή χρήσης εργαλείων λειτουργικής προσομοίωσης για την επαλήθευση ψηφιακών κυκλωμάτων\n"
        },
        "name": "Ψηφιακά Συστήματα HW σε Χαμηλά Επίπεδα Λογικής II"
      },
      {
        "code": "600198759",
        "humanCode": "090",
        "originalTitle": "Ψηφιακή Επεξεργασία Εικόνας",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600198759",
        "professors": [
          "Αναστάσιος Ντελόπουλος"
        ],
        "description": {
          "syllabus": "1. Πρόσληψη εικόνων από τον άνθρωπο και τις συσκευές\n    Φωτεινότητα και Χρώμα\n2. Δημιουργία Ψηφιακών Εικόνων: Ψηφιοποίηση, Κβαντισμός\n3. Οι εικόνες σαν 2Δ σήματα\n    3.1 Μετασχηματισμοί Fourier, z\n    3.2 Συνέλιξη, Θεωρήματα Συνέλιξης\n    3.3 Φίλτρα\n    3.4 2Δ στοχαστικές διαδικασίες\n4. Ανάλυση Εικόνας\n    4.1 Εύρεση ακμών, σημείων ενδιαφέροντος\n    4.2 Κατάτμηση εικόνας\n    4.3 Υπολογισμός χαρακτηριστικών\n    4.4 Υπολογισμοί σχημάτων, περιγράμματα\n5. Βελτίωση εικόνας\n    5.1 Χρωματική βελτίωση\n    5.2 Μείωση του θορύβου\n    5.3 Αντιστροφή παραμορφώσεων, Φίλτρα Wiener\n6. Πολυδιακριτική ανάλυση\n",
          "outcomes": "1.\tΗ κατανόηση της φυσικής σημασίας που έχει η εικόνα ως πληροφορία χρώματος και φωτεινότητας\n2.\tΗ επέκταση των μαθηματικών εργαλείων που χρησιμοποιούνται σε 1Δ σήματα στις 2 διαστάσεις\n3.\tΗ κατανόηση των προβλημάτων που επιχειρεί να αντιμετωπίσει η ΨΕΕ (ανάλυση σκηνών, μείωση θορύβου, ανίχνευση/αναγνώριση αντικειμένων, κ.λπ)\n4.\tΗ θεωρητική κατανόηση των εργαλείων (μαθηματικών/αλγοριθμικών) που χρησιμοποιούνται κατά την επίλυση των παραπάνω προβλημάτων.\n5.\tΗ εξάσκηση στην υλοποίηση των παραπάνω εργαλείων με τη μορφή προγραμμάτων (σε περιβάλλον Matlab).\n"
        },
        "name": "Ψηφιακή Επεξεργασία Εικόνας"
      }
    ],
    "9": [
      {
        "code": "600196729",
        "humanCode": "119",
        "originalTitle": "Ανάλυση και Σύνθεση Ραδιοσυστημάτων",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196729",
        "professors": [
          "Δημήτριος Χρυσουλίδης",
          "Γεώργιος Σεργιάδης"
        ],
        "description": {
          "syllabus": "Ανάλυση πομπών και δεκτών σε υποσυστήματα. Μείκτες και συνθέτες συχνότητας. Λειτουργία αναλυτών φάσματος και δικτύων. Δέκτες λογισμικού.\nΠαλμικό, Doppler και FM/CW ραντάρ. Διερεύνηση και ανάλυση διευθύνσεων, αποστάσεων και ταχυτήτων. Ραντάρ απεικόνισης πραγματικού (SLAR) και συνθετικού (SAR) διαφράγματος. Pαδιόμετρα. Ραδιοπλοήγηση (GPS, Galileo), ραδιο-μετεωρολογία και ραδιο-ωκεανογραφία.\n",
          "outcomes": "Ενοποίηση των γνώσεων που αποκτήθηκαν από τα μαθήματα κυκλωμάτων, ηλεκτρονικής, ηλεκτρομαγνητικού πεδίου, κεραιών για τη σύνθεση πραγματικών τηλεπικοινωνιακών συστημάτων. Εξοικείωση με τη λειτουργία ραδιο-συστημάτων που χρησιμοποιούνται για εντοπισμό (π.χ., ραντάρ), πλοήγηση (π.χ., GPS, ραδιο-φάροι), εποπτεία (π.χ., μετεωρολογία)."
        },
        "name": "Ανάλυση και Σύνθεση Ραδιοσυστημάτων"
      },
      {
        "code": "600196644",
        "humanCode": "109",
        "originalTitle": "Αναγνώριση Προτύπων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196644",
        "professors": [
          "Ανδρέας Συμεωνίδης"
        ],
        "description": {
          "syllabus": "Η αναγνώριση προτύπων (pattern recognition) είναι το πεδίο έρευνας που μελετά τη λειτουργία και το σχεδιασμό συστημάτων που αναγνωρίζουν πρότυπα στα δεδομένα. Συμπεριλαμβάνει τομείς όπως η εξαγωγή χαρακτηριστικών, η εκτίμηση λάθους, η στατιστική και συντακτική αναγνώριση προτύπων. Σημαντικές περιοχές εφαρμογών είναι η ανάλυση εικόνας, η αναγνώριση χαρακτήρων, η ανάλυση φωνής, η αναγνώριση προσώπων, η επικοινωνία ανθρώπου - υπολογιστή και η βιομηχανική επίβλεψη.\nΣτα πλαίσια του μαθήματος διδάσκονται:\n1) Αλγόριθμοι ομαδοποίησης: Βασικές έννοιες, Αλγόριθμοι διαχωρισμού, Ιεραρχικοί και Πυκνωτικοί αλγόριθμοι, SOM, Αξιολόγηση, Μείγματα μοντέλων\n2) Αλγόριθμοι Ταξινόμησης: Βασικές έννοιες, Δένδρα απόφασης, Αξιολόγηση, Πιθανοτική προσέγγιση, Νευρωνικά δίκτυα, SVMs, Πιθανοτική δίκτυα, Μέθοδος Ελαχίστων τετραγώνων, μη γραμμικά SVMs, Υπερεκπαίδευση, Κόστος μοντέλου, Σύνθεση ταξινομητών\n3) Προ-επεξεργασία δεδομένων: Βασικά θέματα, Μείωση διαστάσεων (PCA και ISOMAP)\n",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, οι φοιτητές/τριες αναμένεται να μπορούν να:\nα) Γνωρίζουν τις βασικές αρχές αναγνώρισης προτύπων και τα κύρια πεδία εφαρμογής των\nβ) Μπορούν να εφαρμόσουν γνωστούς αλγορίθμους σε πιλοτικά προβλήματα\nγ) Επιλέγουν τον κατάλληλο αλγόριθμο αναγνώρισης προτύπων με βάση τις απαιτήσεις του προβλήματός τους,\nδ) Σχεδιάζουν τη διαδικασία επίλυσης προβλημάτων μέσης δυσκολίας.\nΜε αυτές τις γνώσεις οι φοιτητές θα μπορούν στη συνέχεια να εμβαθύνουν σε άλλα γνωστικά πεδία όπως η Τεχνητή Νοημοσύνη ή η Υπολογιστική Όραση.\n"
        },
        "name": "Αναγνώριση Προτύπων"
      },
      {
        "code": "600196705",
        "humanCode": "131",
        "originalTitle": "Αξιοπιστία Συστημάτων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196705",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "Θεωρία Αξιοπιστίας: Βασικές Έννοιες, Μοντέλα βλαβών, ρυθμός βλαβών, κατανομές και συναρτήσεις αξιοπιστίας, μέσος χρόνος ζωής, δομές συστημάτων, μέθοδοι συνδυαστικού υπολογισμού της αξιοπιστίας, υπολογισμός με μοντέλα Markov διακριτού ή συνεχούς χρόνου και διακριτών καταστάσεων, Αξιοπιστία λογισμικού, Πλεονασμός και ανεκτικότητα βλαβών, Εκτίμηση Αξιοπιστίας. Πρόβλεψη Αξιοπιστίας με Ανάλυση Πρωτογενών Στοιχείων, Δένδρα Βλαβών, FMEA.\nΜελέτη περίπτωσης: αξιοπιστία διαστημικών συστημάτων (hardware/software), FMEA (Failure Mode and Effects Analysis),  FMECA (Failure Modes, Effects and Criticality Analysis)\n",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1.Είναι εξοικειωμένοι με τα θέματα και την ορολογία της Θεωρίας Αξιοπιστίας.\n2.Μπορούν να κάνουν υπολογισμούς παραμέτρων αξιοπιστίας εξαρτημάτων και συστημάτων με χρήση αναλυτικών τύπων και κατάλληλων μοντέλων.\n3.Γνωρίζουν τα συνήθη προβλήματα μελέτης αξιοπιστίας διαστημικών συστημάτων και των διαδικασιών αντιμετώπισής τους\n4.μπορούν να κάνουν συστηματική βιβλιογραφική αναζήτηση σε επιστημονικές πηγές στο διαδίκτυο\n5.μπορούν να παρουσιάσουν τεχνικά θέματα με συγκροτημένο τρόπο\n"
        },
        "name": "Αξιοπιστία Συστημάτων"
      },
      {
        "code": "600196646",
        "humanCode": "110",
        "originalTitle": "Ασφάλεια Πληροφοριακών Συστημάτων",
        "ects": 3,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196646",
        "professors": [
          "Γεώργιος Πάγκαλος"
        ],
        "description": {
          "syllabus": "Τα περιεχόμενα του μαθήματος περιλαμβάνουν τα εξής:\nΣημασία και αναγκαιότητα της ασφάλειας στα σύγχρονα  πληροφοριακά συστήματα\n•\tΒασικές έννοιες και χαρακτηριστικά της ασφάλειας, είδη παραβιάσεων ασφάλειας   \n•\tκατηγορίες και αποτελεσματικότητα των μέτρων προστασίας. \n•\tπολιτικές και μοντέλα ελέγχου προσπέλασης.\n•\tασφάλεια δικτύων και κατανεμημένων υπολογιστικών συστημάτων, \n•\tΑσφάλεια στο Διαδίκτυο: Απειλές και ευπάθειες, μηχανισμοί και πρωτόκολλα ασφάλειας, τεχνολογίες ασφάλειας στο διαδίκτυο  \n•\tΑρχές Κρυπτογραφίας και Κρυπτανάλυσης. \n•\tΣυμμετρική και Ασύμμετρη Κρυπτογραφία, υποδομές δημόσιου κλειδιού\n•\tψηφιακές υπογραφές και ψηφιακά πιστοποιητικά , \n•\tΙομορφικό λογισμικό: Μοντέλα και κατηγορίες κακόβουλου λογισμικού    \n•\tΑσφάλεια των συστημάτων βάσεων δεδομένων, μοντέλα και πολιτικές ελέγχου πρόσβασης, μεθοδολογικό πλαίσιο σχεδιασμού ασφαλών ΒΔ.\n•\tΑνάλυση, Αποτίμηση και Διαχείριση Επικινδυνότητας. \n•\tΤαυτοποίηση και Αυθεντικοποίηση. \n•\tΑσφαλης ανακτηση και αναλυση ψηφιακων δεδομενων (computing forensics)\n•\tΑσφάλεια κινητής υπολογιστικής, ασφάλεια XML εγγράφων, ασφάλεια ηλεκτρονικών συναλλαγών. \n",
          "outcomes": "Στόχος του μαθήματος είναι η γνωριμία, εξοικείωση και απόκτηση δυνατότητας εφαρμογής από τον φοιτητή τεχνικών και μεθόδων  για τη διασφάλιση της εμπιστευτικότητας, της ακεραιότητας και της διαθεσιμότητας των πληροφοριών που διαχειρίζονται τα πληροφοριακά συστήματα και των ίδιων των συστημάτων. Πιο συγκεκριμένα:\n•\tΗ εξοικείωση των φοιτητών με τα ζητήματα ασφάλειας και τις συμμετέχουσες τεχνολογίες στα σύγχρονα πληροφοριακά συστήματα\n•\tΗ Κατανόηση και δυνατότητα ανάλυσης ευπαθειών, απειλών και επιπτώσεων επιθέσεων στα σύγχρονα πληροφοριακά συστήματα\n•\tΗ απόκτηση των απαραίτητων εφοδίων για τη θωράκιση των πληροφοριακών συστημάτων από απειλές και κινδύνους\n•\tΗ ικανότητα να αναπτύξουν μια κατάλληλη πολιτική ασφάλειας και τους απαραίτητους μηχανισμούς προστασίας που θα την υποστηρίξουν\n"
        },
        "name": "Ασφάλεια Πληροφοριακών Συστημάτων"
      },
      {
        "code": "600196733",
        "humanCode": "121",
        "originalTitle": "Ασύρματες Επικοινωνίες",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196733",
        "professors": [
          "Γεώργιος Καραγιαννίδης"
        ],
        "description": {
          "syllabus": "Μοντέλα καναλιού ασύρματης επικοινωνίας\n  - Απωλειών\n  - Διαλειπτικά κανάλια (Fading Channels)\n  - Χαρακτηριστικά διαλειπτικών καναλιών\nΓενική περιγραφή συστήματος κινητών επικοινωνιών\n  - Είδη κυψελών\n  - Σταθμοί βάσης\n  - Παρεμβολές\n  - Τεχνικές Hand-over\nΣυστήματα εκπομπής και λήψης στις ασύρματες επικοινωνίες\n  - Διαφορική λήψη (Diversity)\n  - Συστήματα ΜΙΜΟ (Spatial Multiplexing, Space-Time Coding, Beam-forming)\n  - Συστήματα OFDM\nΒασικές αρχές συστημάτων 3G (UMTS) και 4G (LTE, LTE-A)\nΔορυφορικές επικοινωνίες\n  - Εισαγωγή, ιστορική αναδρομή, εφαρμογές και υπηρεσίες δορυφορικών συστημάτων\n  - Βασικά τμήματα συστήματος δορυφορικών επικοινωνιών\n  - Απώλειες στις δορυφορικές ραδιοζεύξεις\n  - Τεχνικές πολλαπλής προσπέλασης σε δορυφορικά συστήματα",
          "outcomes": "1. Κατανόηση της λειτουργίας των συστημάτων κινητών επικοινωνιών\n2. Δυνατότητα μελέτης και ανάλυσης απλών κυψελωτών συστημάτων\n3. Κατανόηση των βασικών τεχνικών που εφαρμόζονται στις κινητές επικοινωνίες και προσομοίωση τους σε Η/Υ\n4. Κατανόηση της λειτουργίας των συστημάτων δορυφορικών επικοινωνιών\n5. Υπολογισμός του συνολικού ισοζυγίου ισχύος σε δορυφορικές ζεύξεις\n6. Δυνατότητα μελέτης και ανάλυσης των βασικών συστημάτων του τηλεπικοινωνιακού διαστημικού τμήματος"
        },
        "name": "Ασύρματες Επικοινωνίες"
      },
      {
        "code": "600196675",
        "humanCode": "112",
        "originalTitle": "Βάσεις Δεδομένων",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196675",
        "professors": [
          "Θεμιστοκλης Διαμαντοπουλος"
        ],
        "description": {
          "syllabus": "Το μάθημα αποτελεί μια εισαγωγή στα συστήματα διαχείρισης Βάσεων Δεδομένων και εντάσσεται στην ευρύτερη κατηγορία των μαθημάτων λογισμικού. Παρουσιάζονται τεχνικές ανάλυσης, μοντελοποίησης, σχεδίασης και ανάπτυξης βάσεων δεδομένων και οι φοιτητές εξοικειώνονται με κάποια δημοφιλή\nπεριβάλλοντα για την ανάπτυξη παρόμοιων συστημάτων. Το μάθημα περιλαμβάνει θεωρητικό και πρακτικό μέρος. \nΤα περιεχόμενα του έχουν ως εξής:\n•\tΠεριβάλλον και αρχιτεκτονική συστημάτων βάσεων δεδομένων (ΒΔ). \n•\tΜοντέλα δεδομένων: οντοτήτων-συσχετίσεων, αντικειμενοστρεφές και σχεσιακό. \n•\tΣχεδίαση ΒΔ με το σχεσιακό μοντέλο.  Κανονικές μορφές και κανονικοποίηση. \n•\tΣχεσιακή άλγεβρα, σχεσιακός λογισμός και γλώσσα SQL. \n•\tΜεθοδολογία ανάπτυξης ΒΔ. \n•\tΒάσεις δεδομένων στο διαδίκτυο, στοιχεία XML. \n•\tΒελτιστοποίηση ερωτημάτων. \n•\tΠροστασία δεδομένων: ανάκαμψη, ταυτοχρονισμός, ακεραιότητα, ασφάλεια. \n•\tΑρχιτεκτονική υπολογιστών για διαχείριση συστημάτων ΒΔ.\n",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, οι φοιτητές/τριες αναμένεται να μπορούν να:\nα.   Αναλύσουν τις απαιτήσεις μιας εφαρμογής που απαιτεί βάση δεδομένων,\nβ.   Σχεδιάσουν μια σχεσιακή βάση δεδομένων,\nγ.   Υλοποιήσουν μια σχεσιακή βάση δεδομένων σε ένα δημοφιλές περιβάλλον ανάπτυξης,\nδ.   Σχεδιάσουν και να υποβάλουν ερωτήματα σε γλώσσα SQL,\nε.   Κατανοούν τα βασικά πλεονεκτήματα και προβλήματα που απορρέουν από τη χρήση ΒΔ,\nστ. Γνωρίζουν τις βασικές επιλογές αρχιτεκτονικής υπολογιστών για υποστήριξη βάσεων δεδομένων,\nζ.  Γνωρίζουν τις ιδιαιτερότητες και τις τεχνολογίες των βάσεων δεδομένων που αναρτώνται στο διαδίκτυο.\n"
        },
        "name": "Βάσεις Δεδομένων"
      },
      {
        "code": "600196674",
        "humanCode": "113",
        "originalTitle": "Βιομηχανική Πληροφορική",
        "ects": 3,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196674",
        "professors": [
          "Γεώργιος Χασάπης"
        ],
        "description": {
          "syllabus": "•\tΟρισμός βιομηχανικού αυτοματισμού και ελέγχου παραγωγής  και ταξινόμηση των  στρατηγικών ελέγχου σε συνεχούς , δiαλείποντος και διακριτού χρόνου.\n•\tΑρχιτεκτονική αναφοράς των υπολογιστικών δικτύων έξυπνων αισθητήρων και υπολογιστών συστημάτων που χρησιμοποιούνται στο βιομηχανικό έλεγχο.\n•\tΠρογραμματιζόμενοι λογικοί Ελεγκτές(αρχιτεκτονική υλικού και λειτουργικό σύστημα κυκλικής εκτέλεσης)\n•\tΛειτουργικά συστήματα πραγματικού χρόνου \n•\tΑρχές σχεδίασης λογισμικού οδηγούμενου από γεγονότα\n•\tΤο πρότυπο IEC 6113-3\n•\tΣημασιολογία  και συντακτικοί κανόνες των γλωσσών προγραμματισμού που υποστηρίζονται από το IEC 61131-3\n•\tΓλώσσες σχεδίων επαφών, συναρτησιακών διαγραμμάτων, δομημένου κειμένου, λίστας εντολών και ακολουθιακών συναρτησιακών διαγραμμάτων.\n•\tΤο πρότυπο ΙΕC61499 για ανάπτυξη λογισμικού οδηγούμενου από γεγονότα.\n•\tΒιομηχανικά δίκτυα υπολογιστών( Βιομηχανικό Internet, Modbus, CAN, Profibus, Foundation)\n•\tΕργαλεία μηχανικής λογισμικού\n",
          "outcomes": "Το μάθημα στοχεύει στο να  μάθουν οι φοιτητές :\n (α) πως να σχεδιάζουν την αρχιτεκτονική του λογισμικού των εξειδικευμένων κατανεμημένων δικτύων έξυπνων οργάνων και υπολογιστών που χρησιμοποιούνται για την υλοποίηση στρατηγικών και αλγορίθμων ελέγχου βιομηχανικών διεργασιών. Η σχεδίαση θα περιλαμβάνει τόσο το λογισμικό που μπορεί να εκτελείται κάτω από τον έλεγχο   γεγονότων (event driven) ή το λογισμικό που μπορεί να εκτελείται με την πιο παραδοσιακή τεχνική του κυκλικού εκτελεστικού(cyclic executive) που προσφέρεται εμπορικά από τις εξειδικευμένες υπολογιστικές μονάδες που αποκαλούνται Προγραμματιζόμενοι Λογικοί Ελεγκτές,\n(β) τις μεθοδολογίες ανάπτυξης λογισμικού και τις σχετικές γλώσσες προγραμματισμού στρατηγικών και αλγορίθμων ελέγχου όπως αυτές έχουν τυποποιηθεί με τα πρότυπα IEC 61131-3 και IEC 61499.\n"
        },
        "name": "Βιομηχανική Πληροφορική"
      },
      {
        "code": "600196712",
        "humanCode": "128",
        "originalTitle": "Ειδικά Θέματα Διάδοσης και Ραδιοζεύξεων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196712",
        "professors": [
          "Θωμάς Ξένος"
        ],
        "description": {
          "syllabus": "Εισαγωγή στη διάδοση ραδιοκυμάτων:   Ζώνες ραδιοσυχνοτήτων, προτυποποίηση, κανονισμοί.\nΤροποσφαιρική διάδοση:  Στρωμάτωση, διάδοση ραδιοκυμάτων, μοντέλο τυπικής ατμόσφαιρας, τροποσφαιρική διάθλαση, δείκτες.\nΙονοσφαιρική Διάδοση:  Ηλιακές εκπομπές, γήινο μαγνητικό πεδίο, πλάσμα, μορφολογία της ιοσόφαιρας, ιονοσφαιρική διάδοση, ιονοσφαιρικές επικοινωνίες, πρόβλεψη χαρακτηριστικών διάδοσης, ιονοσφαιρική σκέδαση, ειδικά προβλήματα διάδοσης στην ιονόσφαιρα.\nΑσύρματη ραδιοκάλυψη: Χαρακτηριστικά υπηρεσιών, δίκτυα ραδικαλύψεων, ραδιοκαλύψεις στις ζώνες LF, MF, HF, ραδιοκαλύψεις τοπικής εμβέλειας στις ζώνες VHF, UHF, συστάσεις ITU-R.\nΔιάδοση ραδιοκυμάτων πέρα από τον ορίζοντα: Διάδοση μέσω της τροπόσφαιρας, τρόποι τροποσφαιρικής διάδοσης, τροποσφαιρικοί σκεδαστές, γεωμετρία διάδοσης τροποσφαιρικής σκέδασης, προφίλ διάδοσης ραδιοκυμάτων, γεωμετρικές παράμετροι, κλιματική ταξινόμηση της γης.\nΕπικοινωνίες μικρής εμβέλειας: Εφαρμογές, διάδοση έξω και μέσα σε κτήρια, συστάσεις ITU-R για διάδοση μικρής εμβέλειας εξωτερικού χώρου, υπολογισμοί απωλειών, μοντέλα πολλαπλών διαδρομών, χαρακτηριστικά πόλωσης και διαλείψεων, συστάσεις ITU-R για διάδοση σε εσωτερικό χώρο, μοντέλα απωλειών διάδοσης και καθυστέρησης.\nΡαδιοθόρυβος και διάδοση ραδιοκυμάτων: Ορισμοί, πηγές, κύρια αποτελέσματα, συνάρτηση ραδιοθορύβου-συχνότητας, θόρυβος λόγω ατμοσφαιρικών αερίων στην επιφάνεια της γης, ανθρωπογενής θόρυβος.\nΤεχνικές βελτιστοποίησης λήψης ραδιοκυμάτων: Διαλείψεις, βελτίωση λήψης ραδιοκυμάτων, διαφορικές λήψεις (χώρου, συχνότητας, πόλωσης, χρόνου, πολλαπλών διαδρομών).\n",
          "outcomes": "1.\tΚατανόηση βασικών μηχανισμών διάδοσης σε επίγειες και αστικές ζεύξεις.\n2.\tΙκανότητα σχεδίασης πρακτικών ραδιοζεύξεων και σταθμών εκπομπής με βάση μοντέλα διάδοσης, διεθνή πρότυπα και κανονισμούς. \n"
        },
        "name": "Ειδικά Θέματα Διάδοσης και Ραδιοζεύξεων"
      },
      {
        "code": "600196668",
        "humanCode": "102",
        "originalTitle": "Ειδικά Κεφάλαια Συστημάτων Ηλεκτρικής Ενέργειας",
        "ects": 6,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196668",
        "professors": [
          "Δημήτριος Λαμπρίδης",
          "Γεώργιος Ανδρέου",
          "Γρηγόριος Παπαγιάννης"
        ],
        "description": {
          "syllabus": "Κανονισμοί και πρότυπα ηλεκτρικών εγκαταστάσεων. Προστασία έναντι ηλεκτροπληξίας, πυρκαγιάς και κεραυνών. Διατάξεις γείωσης. Μονωμένοι αγωγοί και καλώδια εγκαταστάσεων μέσης και χαμηλής τάσης. Προσδιορισμός διατομών καλωδίων και γραμμών. Προστασία γραμμών και καλωδίων από υπερφόρτιση και βραχυκυκλώματα. Διακόπτες, μέσα ζεύξης και μέσα προστασίας μέσης και χαμηλής τάσης. Εγκαταστάσεις χαμηλής τάσης σε κτίρια και σε ειδικούς χώρους. Εγκαταστάσεις ηλεκτροκίνησης. Υποσταθμοί καταναλωτών μέσης τάσης. Τιμολόγηση ηλεκτρικής ενέργειας και αντιστάθμιση άεργης ισχύος καταναλωτών.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα είναι σε θέση να εκπονήσουν μια πλήρη μελέτη ηλεκτρολογικής εγκατάστασης καταναλωτών μέσης και χαμηλής τάσης.\nΣυγκεκριμένα, οι φοιτητές θα είναι σε θέση να υπολογίσουν διατομές καλωδίων και γραμμών, εγκαταστάσεις γείωσης και προστασίας χαμηλής τάσης σε κτίρια και σε ειδικούς χώρους.\nΕπίσης οι φοιτητές θα είναι σε θέση εκπονήσουν μελέτες ηλεκτροκίνησης και υποσταθμών καταναλωτών μέσης τάσης.\nΤέλος οι φοιτητές θα είναι σε θέση να εκπονήσουν οικονομοτεχνική μελέτη της εγκατάστασης λαμβάνοντας υπόψη τα τρέχοντα τιμολόγια ηλεκτρικής ενέργειας.\n"
        },
        "name": "Ειδικά Κεφάλαια Συστημάτων Ηλεκτρικής Ενέργειας"
      },
      {
        "code": "600196662",
        "humanCode": "114",
        "originalTitle": "Ευφυή και Προσαρμοστικά Συστήματα Αυτομάτου Ελέγχου",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196662",
        "professors": [
          "Γεώργιος Ροβιθάκης"
        ],
        "description": {
          "syllabus": "1. \tΕισαγωγή (Διατύπωση του Προβλήματος, Παραδείγματα – Εφαρμογές).\n2. \tΠροσαρμοστικός Έλεγχος Μοντέλου Αναφοράς (ΠΕΜΑ) (Άμεσα και έμμεσα σχήματα ΠΕΜΑ).\n3. \tΠροσαρμοστικός Έλεγχος Τοποθέτησης Πόλων (ΠΕΤΠ) (Πολυωνυμικό σχήμα ΠΕΤΠ, σχήμα ΠΕΤΠ εξισώσεων κατάστασης, προσαρμοστικός τετραγωνικός ελεγκτής). \n4. \tΠροσαρμοστικός Έλεγχος Αβέβαιων Συστημάτων με Νευρωνικά Δίκτυα  \n",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\nα) σχεδιάζουν και θα αναλύουν προσαρμοστικούς ελεγκτές για γραμμικά χρονικά αμετάβλητα συστήματα,\nβ) κατανοούν τα προβλήματα, θα αναλύουν και θα σχεδιάζουν προσαρμοστικούς νευρωνικούς ελεγκτές για αβέβαια μη-γραμμικά συστήματα κανονικής μορφής Brunovsky,\nγ) προσομοιώνουν και θα υλοποιούν προσαρμοστικούς ελεγκτές χρησιμοποιώντας MATLAB.\n"
        },
        "name": "Ευφυή και Προσαρμοστικά Συστήματα Αυτομάτου Ελέγχου"
      },
      {
        "code": "600196671",
        "humanCode": "103",
        "originalTitle": "Ηλεκτρική Οικονομία",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196671",
        "professors": [
          "Αναστάσιος Μπακιρτζής",
          "Παντελής Μπίσκας"
        ],
        "description": {
          "syllabus": "Πηγές ενέργειας και τρόποι μετατροπής τους σε ηλεκτρική.  Εισαγωγή στη λογιστική των επιχειρήσεων ηλεκτρισμού.  Χρονική αξία του χρήματος. Αξιολόγηση επενδύσεων.  Ανάλυση του κόστους παροχής ηλεκτρικής ενέργειας.  Ανάλυση της ηλεκτρικής ζήτησης.  Ανάλυση αξιοπιστίας του συστήματος παραγωγής.  Προσομοίωση του συστήματος παραγωγής. Προγραμματισμός ανάπτυξης του συστήματος παραγωγής.  Τιμολόγηση ηλεκτρικής ενέργειας.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές θα:\n(α) Γνωρίζουν τις βασικές τεχνολογίες παραγωγής ηλεκτρικής ενέργειας, με έμφαση στα οικονομικά στοιχεία.\n(β) Μπορούν να κατανοήσουν και να αναλύσουν τις βασικές οικονομικές καταστάσεις των επιχειρήσεων που δημοσιεύονται στον ημερήσιο τύπο.\n(γ) Γνωρίζουν τις συνιστώσες του κόστους παροχής ηλεκτρικής ενέργειας.\n(δ) Γνωρίζουν τους στόχους και τη διαδικασία κατάρτισης του προγραμματισμού ανάπτυξης του συστήματος παραγωγής.\n(ε) Μπορούν να εκπονήσουν μια μελέτη αξιολόγησης επενδύσεων στον ενεργειακό τομέα.\n"
        },
        "name": "Ηλεκτρική Οικονομία"
      },
      {
        "code": "600196711",
        "humanCode": "127",
        "originalTitle": "Ηλεκτρομαγνητική Συμβατότητα",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196711",
        "professors": [
          "Νικόλαος Κανταρτζής"
        ],
        "description": {
          "syllabus": "Βασικές έννοιες, ορισμοί, τομείς έρευνας: Ηλεκτρομαγνητικές παρεμβολές, μηχανισμοί σύζευξης παρεμβολών, κατηγοριοποίηση παρεμβολών, επιδεκτικότητα και ατρωσία, ηλεκτρομαγνητική συμβατότητα μεταξύ συστημάτων, αριθμητικές τεχνικές, εγκαταστάσεις μέτρησης, είδη μετρήσεων.\nΟρισμοί, διεθνή πρότυπα, προδιαγραφές: Ιστορική αναδρομή, οδηγίες ηλεκτρομαγνητικής συμβατότητας, σήμανση CE, δήλωση συμμόρφωσης, πρότυπα και προδιαγραφές (βασικά, γένια, προϊόντος), πρότυπα αυτοκίνησης και αεροπορικών εφαρμογών, σφάλματα προτυποποίησης.\nΓραμμές μεταφοράς και ακεραιότητα σήματος: Θεωρητικά μοντέλα, πεδιακή σύζευξη, επίδραση απωλειών, δομές τυπωμένων κυκλωμάτων, ανά μονάδα μήκους παράμετροι, εξισώσεις τηλεγραφητή, μοντέλα απόκρισης γραμμών μεταφοράς, καλώδια, αρχιτεκτονική διανομής σήματος, διάγραμμα πλέγματος υπολογισμού ανακλάσεων.\nΜη γραμμική λειτουργία εξαρτημάτων, μηχανισμοί σύζευξης παρεμβολών: Αντιστάσεις, πυκνωτές, αυτεπαγωγές, διαγράμματα Bode, ηλεκτρομηχανικές διατάξεις, είδη σύζευξης παρεμβολών, εκπομπές μέσω ακτινοβολίας, εκπομπές μέσω αγώγιμης διαδρομής.\nΚεραίες μέτρησης, εκπομπές και επιδεκτικότητα μέσω ακτινοβολίας: ηλεκτρικό και μαγνητικό δίπολο, στοιχειοκεραίες, Balun, προσαρμογή και εξασθενητές, εξίσωση Friis, μοντέλα εκπομπής και επιδεκτικότητας, μετρήσεις ακτινοβολούμενων εκπομπών (εγκαταστάσεις, μέθοδοι, πηγές αβεβαιότητας).\nΌργανα και συσκευές μέτρησης, εκπομπές και επιδεκτικότητα μέσω αγωγιμότητας: Όργανα μέτρησης, πρόβολοι τάσης και ρεύματος, συσκευές LISN και CDN, σφιγκτήρες φερρίτη, διατάξεις BCI, φίλτρα τροφοδοτικών, μεταβατικά φαινόμενα, τεχνητές διαταραχές, διαμορφώσεις μετρήσεων.\nΔιασταυρούμενη συνομιλία: Γραμμές με τρεις αγωγούς, επαγωγικό-χωρητικό μοντέλο σύζευξης, ανάλυση στο πεδίο του χρόνου, θωρακισμένοι αγωγοί, επαγωγική και χωρητική σύζευξη, πολλαπλές θωρακίσεις, αγωγοί “pigtail”, συστραμμένοι αγωγοί, επίδραση συστροφής, επίδραση ισορροπίας.\nΣυστήματα θωράκισης: κοντινό και μακρινό πεδίο, απόδοση θωράκισης, απώλειες απορρόφησης και ανάκλασης, εξισώσεις θωράκισης, θωράκιση με μαγνητικά υλικά, διαφράγματα, αρμοί/σχισμές, αντίσταση μεταφοράς, κυματοδηγοί κάτω από τη συχνότητα αποκοπής, παρεμβύσματα, αγώγιμοι οπτικοί πίνακες, επιχρίσματα, εσωτερικές θωρακίσεις, γείωση θωρακίσεων.\nΔιατάξεις γείωσης: γείωση ασφαλείας (κυκλώματα διακλάδωσης, γείωση εδάφους, έλεγχος θορύβου, απομονωμένα εδάφη), γείωση σήματος (χαρακτηριστικά, γείωση μονού και πολλαπλού σημείου, σύζευξη κοινής σύνθετης αντίστασης, υβριδικές γειώσεις), εξοπλισμός και συστήματα γείωσης (συγκεντρωμένα και διανεμημένα), γειώσεις PCB, βρόχοι γείωσης και τρόποι αποφυγής τους.",
          "outcomes": "Με την ολοκλήρωση του μαθήματος οι φοιτήτριες/τές θα έχουν αποκτήσει τις ακόλουθες δεξιότητες:\n\n- Να κατανοήσουν τις βασικές έννοιες της ηλεκτρομαγνητικής συμβατότητας, τη σύνδεση τους με τις θεμελειώδεις γνώσεις του ηλεκτρομαγνητισμού, τους μηχανισμούς ανάπτυξης και καταστολής των παρεμβολών, τη μη γραμμικής λειτουργίας των κύριων κυκλωματικών εξαρτημάτων, και των μηχανισμών της διασταυρούμενης συνομιλίας.\n- Να αντιληφθούν σε βάθος τα συστημάτα θωράκισης και γείωσης μέσω ρεαλιστικών παραδειγμάτων.\n- Να εφαρμόζουν μεθοδολογίες μέτρησης βασικών μεγεθών και δεικτών της ηλεκτρομαγνητικής συμβατότητας αλλά και τεχνικές μέτρησης σε περιβάλλον ανηχοϊκού θαλάμου.\n- Να κατανοήσουν και να εφαρμόσουν στην πράξη τις έννοιες της ηλεκτρομαγνητικής συμβατότητας υλοποιώντας επιλεγμένες εργαστηριακές εργασίες που περιλαμβάνουν τη θεωρητική ανάλυση των εμπλεκόμενων ηλεκτρομαγνητικών φαινομένων, τη σχεδίαση και κατασκευή πρότυπης διάταξης, την προσομοίωση και παραμετρική ανάλυση των κύριων χαρακτηριστικών της με σύγχρονες υπολογιστικές τεχνικές, καθώς και την αποτίμηση της λειτουργίας της μέσω σειράς εργαστηριακών μετρήσεων και συγκρίσεων."
        },
        "name": "Ηλεκτρομαγνητική Συμβατότητα"
      },
      {
        "code": "600196707",
        "humanCode": "125",
        "originalTitle": "Κώδικες Διόρθωσης Σφαλμάτων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196707",
        "professors": [
          "Λεωνίδας Γεωργιάδης",
          "Γεώργιος Καραγιαννίδης"
        ],
        "description": {
          "syllabus": "Γραμμικοί δυαδικοί κώδικες, Aλγόριθμοι Διάδοσης Πεποιθήσεων, κώδικες χαμηλής πυκνότητας ελέγχου ισοτιμίας (LDPC). Πρακτικές εφαρμογές της κωδικοποίησης μέσω εργασίας",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές έχουν τις εξής δυνατότητες\n1. Σχεδιασμό και υλοποίηση κωδίκων διόρθωσης σφαλμάτων.\n2. Ανάλυση επίδοσης των κωδίκων αυτών."
        },
        "name": "Κώδικες Διόρθωσης Σφαλμάτων"
      },
      {
        "code": "600196732",
        "humanCode": "120",
        "originalTitle": "Μικροκυματική Τεχνολογία",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "Y"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196732",
        "professors": [
          "Εμμανουήλ Κριεζής"
        ],
        "description": {
          "syllabus": "Παράμετροι μικροκυματικών κυκλωμάτων: Πίνακες σύνθετης αντίστασης και αγωγιμότητας, πίνακες σκέδασης και μετάδοσης (ABCD).\nΔιέγερση μικροκυματικών κυκλωμάτων: Διέγερση κυματοδηγών και σύζευξη μέσω ανοιγμάτων. Ίριδες κυματοδηγών.\nΔιαιρέτες και κατευθυντικοί ζεύκτες: Διαιρέτης Wilkinson, τετραγωνικό (90ο) υβριδικό, κατευθυντικοί ζεύκτες συζευγμένης γραμμής, υβριδικό 180ο, μαγικό Τ.\nΜικροκυματικά φίλτρα: Κλασική σχεδίαση φίλτρων, υλοποίηση φίλτρων σε μικροκυματικές συχνότητες, σχεδίαση χαμηλοπερατών και ζωνοπερατών μικροκυματικών φίλτρων.\nΦερρίτες και διατάξεις φερριτών: Τανυστής μαγνητικής διαπερατότητας, διάδοση επίπεδου κύματος σε φερρίτη, στροφή Faraday, απομονωτές, φασιθέτες, γύρατρον, κυκλοφορητές.\nΑνιχνευτές, μείκτες και δίοδοι: Μείκτες διόδων, μείκτης μονού άκρου, ισορροπημένος μείκτης, μείκτης απόρριψης εικόνας. Κυκλώματα ελέγχου διόδων PIN, διακόπτες και φασιθέτες.\nΜικροκυματικές πηγές: Δίοδος GUNN και δίοδος IMPATT.\nΜικροκυματικοί ενισχυτές: Μικροκυματικά transistor: FET και διπολικά transistor. Μικροκυματικοί ενισχυτές: κέρδος και ευστάθεια. Σχεδιασμός μικροκυματικών ενισχυτών με κριτήρια κέρδους και θορύβου.\nΕργαστηριακές ασκήσεις: χαρακτηριστικά λυχνίας KLYSTRON, δίοδος GUNN, μέτρηση συχνότητας, μήκους κύματος, ισχύος, SWR και αντίστασης, μετρήσεις με διανυσματικό αναλυτή δικτύων.\n",
          "outcomes": "1. Πλήρης εξοικείωση με τον πίνακα σκέδασης, καθώς και άλλες αναπαραστάσεις μικροκυματικών δικτύων με χρήση πινάκων.\n2. Κατανόηση των μηχανισμών διέγερσης κυματοδηγών με χρήση προβόλων ή μικρών οπών/ανοιγμάτων και σχετικοί υπολογισμοί.\n3. Πλήρης και λεπτομερής ανάλυση των τυπικών 3-θυρων και 4-θυρων παθητικών μικροκυματικών στοιχείων, όπως ο διαιρέτης του Wilkinson, τα υβριδικά 90o or 180o (rat race) και οι κατευθυντικοί ζεύκτες συζευγμένης-γραμμής.\n4. Στοιχεία μικροκυματικών φίλτρων.\n5. Κατανόηση των ιδιοτήτων υλικού των φερριτών και κατανόηση της λειτουργίας των βασικών διατάξεων φερριτών (απομονωτές, κυκλοφορητές, κλπ).\n6. Κατανόηση της λειτουργίας μικροκυματικών διόδων PIN και των σχετικών κυκλωμάτων (διακόπτες, φασιθέτες, κλπ).\n7. Σε βάθος κατανόηση των μικροκυματικών transistors (ευστάθειας, κέρδος) και σχεδιασμός μικροκυματικών ενισχυτών μίας βαθμίδας.\n"
        },
        "name": "Μικροκυματική Τεχνολογία"
      },
      {
        "code": "600196686",
        "humanCode": "130",
        "originalTitle": "Οργάνωση και Διοίκηση Εργοστασίων (ΔΟΝΑ)",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196686",
        "professors": [
          "Πάτροκλος Γεωργιάδης"
        ],
        "description": {
          "syllabus": "Εισαγωγή στην οργάνωση και διοίκηση εργοστασίων.\nΕκλογή θέσης: ανάλυση παραγόντων, μεθοδολογία εκλογής θέσης.\nΣτρατηγική σχεδίαση δυναμικότητας: μέτρηση δυναμικότητας, παράγοντες που επηρεάζουν τη δυναμικότητα, διαδικασία σχεδίασης δυναμικότητας, ποσοτικές τεχνικές σχεδίασης δυναμικότητας.\nΣχεδίαση παραγωγής: επιλογή παραγωγικής διαδικασίας, προσδιορισμός αναγκαίου εξοπλισμού και εργατικού δυναμικού, χωροταξική διάταξη παραγωγής (διάταξη σταθερού προϊόντος, λειτουργική διάταξη, διάταξη γραμμής παραγωγής (απλές γραμμές παραγωγής, παράλληλες γραμμές παραγωγής, γραμμές παραγωγής συνδυασμού προϊόντων, γραμμές μεταφοράς), διάταξη κατά ομάδες), σχεδίαση παραγωγής με χρήση Η/Υ.\nΣχεδίαση διακίνησης υλικών: καθοριστικά συστήματα διακίνησης υλικών, στοχαστικά συστήματα διακίνησης υλικών, σχεδίαση διακίνησης υλικών με χρήση Η/Υ.\nΟργάνωση εργασίας: σχεδίαση μεθόδων εργασίας, μέτρηση εργασίας.\nΣχεδίαση διοικητικής οργάνωσης: ανάλυση έργου, σύνθεση οργάνωσης, σύγχρονες τάσεις οργάνωσης.\nΟικονομική σκοπιμότητα δημιουργίας εργοστασίου: προκαταρκτική σχεδίαση, εκτίμηση δαπανών, εκτίμηση εσόδων, εκτίμηση αποδοτικότητας.\nΑνάλυση νεκρού σημείου: ανάληψη προγράμματος ανάπτυξης, επιλογή παραγωγικής διαδικασίας.\nΧρονική αξία του χρήματος: υπολογισμός τόκου, συνεχής ανατοκισμός, παρούσα και μέλλουσα αξία χρηματικών ποσών.\nΜέθοδοι αξιολόγησης επενδύσεων: ανάλυση χωρίς χρονική αξία χρήματος, ανάλυση με χρονική αξία χρήματος, ανάλυση σε συνθήκες αβεβαιότητας.\nΔιαμόρφωση στρατηγικού επιχειρησιακού σχεδίου δράσης: βασικές αρχές υλοποίησης και αξιολόγησης.",
          "outcomes": "Οι φοιτητές στα πλαίσια του μαθήματος θα αναπτύξουν δεξιότητες στρατηγικής διοίκησης βιομηχανικών επιχειρήσεων και ειδικότερα θα,\n. κατανοήσουν τις βασικές λειτουργίες μιας βιομηχανικής επιχείρησης, τη στρατηγική τους σημασία και την ανάγκη σύνδεσής τους με τη συνολική στρατηγική της επιχείρησης για τη δημιουργία ανταγωνιστικού πλεονεκτήματος\n. μάθουν τεχνικές και μεθόδους σωστής επιλογής της θέσης εγκατάστασης εργοστασίων και στρατηγικού σχεδιασμού της παραγωγικής τους δυναμικότητας\n. κατανοήσουν την οργάνωση των βιομηχανικών επιχειρήσεων τόσο από άποψη μέσων και μεθόδων παραγωγής, όσο και διοικητικής δομής\n. κατανοήσουν την οικονομική διάσταση της λειτουργίας της παραγωγής από άποψη σχεδιασμού παραγωγικών επενδυτικών σχεδίων και εκτίμησης δαπανών, εσόδων και οικονομικής τους απόδοσης."
        },
        "name": "Οργάνωση και Διοίκηση Εργοστασίων (ΔΟΝΑ)"
      },
      {
        "code": "600196655",
        "humanCode": "106",
        "originalTitle": "Σερβοκινητήρια Συστήματα",
        "ects": 5,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196655",
        "professors": [
          "Χρήστος Μαδεμλής"
        ],
        "description": {
          "syllabus": "Γενικά χαρακτηριστικά σερβοκινητήριων συστημάτων: Δείκτες λειτουργίας και απόδοσης – γενικές αρχές συστημάτων οδήγησης στρεφόμενων ηλεκτρικών μηχανών. Μόνιμοι μαγνήτες. Μαγνητικά κυκλώματα, διαγράμματα λειτουργίας, υλικά και ιδιότητες μονίμων μαγνητών, ισοδύναμο κύκλωμα.\n\nΣερβοκινητήριο σύστημα με επαγωγικό κινητήρα: Αντιστροφέας ισχύος. Ανυσματικός έλεγχος. Ρύθμιση των παραμέτρων των ελεγκτών του συστήματος. Άμεσος έλεγχος ροπής επαγωγικών κινητήρων.\n\nΣερβοκινητήριο σύστημα με σύγχρονο κινητήρα μόνιμου μαγνήτη: Είδη σύγχρονων κινητήρων μόνιμου μαγνήτη, κατασκευή και αρχή λειτουργίας. Αντιστροφέας ισχύος. Ανυσματικός έλεγχος. Ρύθμιση των παραμέτρων των ελεγκτών του συστήματος.\n\nΣερβοκινητήριο σύστημα με σύγχρονο κινητήρα μαγνητικής αντίστασης: Είδη σύγχρονων κινητήρων μαγνητικής αντίστασης, κατασκευή και αρχή λειτουργίας. Αντιστροφέας ισχύος. Ανυσματικός έλεγχος. Ρύθμιση των παραμέτρων των ελεγκτών του συστήματος.\n\nΕργαστηριακές ασκήσεις σερβοκινητήριων συστημάτων ελέγχου ταχύτητας και θέσης.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα πρέπει να:\nα) γνωρίζουν κατασκευαστικά στοιχεία σύγχρονων κινητήρων μόνιμου μαγνήτη,\nβ) γνωρίζουν τις τεχνικές διανυσματικού ελέγχου κινητήρων εναλλασσομένου ρεύματος (επαγωγικών και σύγχρονων μόνιμου μαγνήτη),\nγ) μπορουν να κάνουν πειραματική ρύθμιση των παραμέτρων των ελεγκτών ενός σερβοκινητήριου συστήματος και\nδ) γνωρίζουν βασικά στοιχεία σχεδιασμού ενός σερβοκινητήριου συστήματος (αισθητήρια, επιλογή κινητήρα ανάλογα με την εφαρμογή, κλπ)."
        },
        "name": "Σερβοκινητήρια Συστήματα"
      },
      {
        "code": "600196645",
        "humanCode": "108",
        "originalTitle": "Συντονισμός Μονώσεων - Προστασία έναντι υπερτάσεων",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196645",
        "professors": [
          "Παντελεήμων Μικρόπουλος",
          "Θωμάς Τσοβίλης"
        ],
        "description": {
          "syllabus": "Είδη μονώσεων, διηλεκτρική αντοχή μονώσεων και κατηγορίες υπερτάσεων στα συστήματα παραγωγής, μεταφοράς και διανομής ηλεκτρικής ενέργειας. Βασικές αρχές συντονισμού μονώσεων. Μέσα προστασίας έναντι υπερτάσεων. Συντονισμός μονώσεων γραμμών μεταφοράς και διανομής. Συντονισμός μονώσεων υποσταθμών παραγωγής, μεταφοράς και διανομής.",
          "outcomes": "• Η κριτική κατανόηση των βασικών αρχών σχεδίασης συστημάτων μόνωσης και προστασίας έναντι υπερτάσεων συστημάτων ηλεκτρικής ενέργειας.\n• Η ικανότητα σχεδίασης και υλοποίησης συστημάτων μόνωσης και προστασίας έναντι υπερτάσεων σύμφωνα με τους σχετικούς Ελληνικούς και διεθνείς κανονισμούς.\n• Η προσωπική ανάπτυξη μέσω της ενεργούς συμμετοχής και της ομαδικής εργασίας, στο πλαίσιο εκπόνησης μελέτης συντονισμού μονώσεων από ομάδες ολιγάριθμων φοιτητών."
        },
        "name": "Συντονισμός Μονώσεων - Προστασία έναντι υπερτάσεων"
      },
      {
        "code": "600196658",
        "humanCode": "107",
        "originalTitle": "Συστήματα Ηλεκτροκίνησης",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196658",
        "professors": [
          "Χαράλαμπος Δημουλιάς"
        ],
        "description": {
          "syllabus": "Βασικές αρχές κίνησης με έμφαση στην περιστροφική. Τα είδη των μηχανικών φορτίων και οι χαρακτηριστικές στροφών-ροπής/ισχύος τους. Οι απαιτήσεις που θέτει η μεταβολή της περιστροφικής ταχύτητας του φορτίου στην ηλεκτρομαγνητική ροπή, στα ρεύματα και στις απώλειες ισχύος στον κινητήρα. Η συμπεριφορά των επαγωγικών κινητήρων σε δυναμική κατάσταση όπως η εκκίνηση με φορτίο και χωρίς φορτίο, και απότομη αλλαγή στροφών. Η δυνατότητα μεταβολής της ηλεκτρομαγνητικής ροπής και της περιστροφικής ταχύτητας ενός επαγωγικού κινητήρα αλλάζοντας μόνο το μέτρο της τάσης ή και το μέτρο της συχνότητας τροφοδοσίας του. Ο γραμμικός έλεγχος των επαγωγικών κινητήρων σε ταχύτητες μικρότερες ή μεγαλύτερες της ονομαστικής. Η εκκίνηση των επαγωγικών κινητήρων και η αντίστοιχη θερμική καταπόνησή τους, με: (1) πλήρη τάση, (2) μειωμένη τάση τροφοδοσίας, (3) συνεχώς μεταβαλλόμενη τάση τροφοδοσίας (ομαλή εκκίνηση), και (4) μεταβαλλόμενη τάση κατά μέτρο και συχνότητα. Η πέδηση των επαγωγικών κινητήρων και η επίδραση της πέδησης στον μετατροπέα ηλεκτρονικών ισχύος. Ο έλεγχος σύγχρονων κινητήρων με την μέθοδο του προσανατολισμού του πεδίου.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα μπορούν να:\n1) Καθορίζουν την σχέση ισχύος-στροφών και ροπής-στροφών διαφόρων μηχανικών φορτίων\n2) Υπολογίζουν το μέγεθος και το είδος του ηλεκτρικού κινητήρα συναρτήσει του είδους και μεγέθους του μηχανικού φορτίου και στην συνέχεια το μέγεθος και είδος του μετατροπέα ηλεκτρονικών ισχύος συναρτήσει των χαρακτηριστικών του κινητήρα.\n3) Υπολογίζουν την καταπόνηση (κυρίως θερμική) του ηλεκτρικού κινητήρα σε διάφορες συνθήκες εκκίνησης ή μεταβολής στροφών.\n4) Υπολογίζουν τις ηλεκτρικές παραμέτρους ενός επαγωγικού κινητήρα όταν τροφοδοτείται από μεταβλητή τάση και συχνότητα.\n5) Σχεδιάζουν έναν αλγόριθμο ελέγχου σύγχρονου κινητήρα με βάση την μέθοδο προσανατολισμού του πεδίου.\n"
        },
        "name": "Συστήματα Ηλεκτροκίνησης"
      },
      {
        "code": "600196673",
        "humanCode": "115",
        "originalTitle": "Συστήματα Πολυμέσων",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196673",
        "professors": [
          "Αναστάσιος Ντελόπουλος"
        ],
        "description": {
          "syllabus": "1. Τα (Ψηφιακά) Πολυμέσα (multimedia) -Εικόνες, Ήχος, Βίντεο, Κείμενο, 3D, Interactive.\n2. Αναπαράσταση (Τα χρησιμοποιούμενα formats)\n3. Ψηφιοποίηση: Δειγματοληψία, Κβαντισμός\n4. Συμπίεση/Κωδικοποίηση:\n4.1 Η κοινές αρχές των μεθόδων συμπίεσης\n4.2 Ανάλυση σημαντικών προτύπων συμπίεσης/κωδικοποίησης (DPCM/ADPCM, MP3, JPEG και συναφή πρότυπα, ITU - H.261 & H.262, ISO - MPEG-1/2/4)\n5. Μετάδοση (Streaming / RTSP, ITU-H.32x)\n6. Αποθήκευση/Ανάκτηση (ISO-MPEG-7)\n",
          "outcomes": "1.\tΗ κατανόηση των τεχνικών συλλογής, αναπαράστασης, επεξεργασίας και διαχείρισης των πολυμέσων.\n2.\tΟ εντοπισμός τών κοινών δομικών στοιχείων αυτών των τεχνικών.\n3.\tΗ εξοικίωση με αυστηρά τεχνικά κείμενα προδιαγραφών (όπως τα διεθνή standards ISO, ITU κ.λπ) μέχρι του σημείου να υλοποιούνται συστήματα πολυμέσων που υπακούουν στις προδιαγραφές αυτές.\n"
        },
        "name": "Συστήματα Πολυμέσων"
      },
      {
        "code": "600196788",
        "humanCode": "116",
        "originalTitle": "Σχεδίαση Συστημάτων VLSI",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196788",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "MOS Tρανζίστορ: Θεωρία και τεχνολογία κατασκευής. Πρότυπα, εκτίμηση απόδοσης και προσομοίωση κυκλωμάτων CMOS. Λογική σχεδίαση και φυσικό σχέδιο (layout). Καθυστέρηση, ισχύς, διασυνδέσεις, συνδυαστικά κυκλώματα, ακολουθιακά κυκλώματα, δομές ειδικού σκοπού, μεθοδολογίες σχεδίασης. Προγράμματα ανάλυσης και σχεδίασης μασκών.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτητές θα:\n1.γνωρίζουν τις διάφορες τεχνολογίες κατασκευής ολοκληρωμένων κυκλωμάτων και ειδικότερα της ΜΟS τεχνολογίας.\n2.γνωρίζουν την μεθοδολογία και με τις επιμέρους δυσκολίες και τα προβλήματα στη σχεδίαση ολοκληρωμένων κυκλωμάτων.\n3.είναι εξοικειωμένοι με εργαλεία σχεδίασης και  προσομοίωσης ολοκληρωμένων κυκλωμάτων καθώς και με την ροή (flow) σχεδίασης αναλογικών ή ψηφιακών κυκλωμάτων.\n4.μπορούν να κάνουν συστηματική βιβλιογραφική αναζήτηση σε επιστημονικές πηγές στο διαδίκτυο\n5.μπορούν να παρουσιάσουν τεχνικά θέματα με συγκροτημένο τρόπο\n"
        },
        "name": "Σχεδίαση Συστημάτων VLSI"
      },
      {
        "code": "600196727",
        "humanCode": "117",
        "originalTitle": "Σχεδίαση Συστημάτων Υλικού-Λογισμικού",
        "ects": 6,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196727",
        "professors": [
          "Ιωάννης Παπαευσταθίου"
        ],
        "description": {
          "syllabus": "Σκοπός του μαθήματος  είναι να δώσει τα κατάλληλα εφόδια στους φοιτητές ώστε να συνδυάσουν τις γνώσεις που αποκτούν σε μία σειρά μαθημάτων και να σχεδιάσουν και να αναπτύξουν, ακολουθώντας τα κατάλληλα πρότυπα σχεδίασης, ένα ολοκληρωμένο σύστημα ελέγχου πραγματικού χρόνου για διαφορετικές διαδικασίες, χρησιμοποιώντας μια σειρά αλγορίθμων ελέγχου. \nΤα περιεχόμενα του μαθήματος περιλαμβάνουν τα εξής:\n•\tΘέματα σχεδίασης υποσυστημάτων αισθητήρων \n•\tΠρωτόκολλα επικοινωνίας με μικροελεγκτές\n•\tΚαθορισμός των προδιαγραφών του συστήματος \n•\tΛειτουργικός σχεδιασμός \n•\tΚαθορισμός της διαδικασίας ελέγχου\n•\tΕπιλογή υπολογιστικού μοντέλου\n•\tΣυνεργατικά περιβάλλοντα\n•\tΑνάπτυξη του λογισμικού επικοινωνίας με αισθητήρες \n•\tΑνάπτυξη του λογισμικού ελέγχου της συμπεριφοράς του συστήματος\n•\tΔιαδικασία δοκιμών και απασφαλμάτωσης (testing and debugging)\n•\tΔιαδικασίες επικύρωσης και συντήρησης\n",
          "outcomes": "Με την ολοκλήρωση του μαθήματος, οι φοιτητές/τριες αναμένεται να μπορούν να: \n•\tσχεδιάζουν ένα πλήρες σύστημα συλλογής αναλογικών και ψηφιακών μετρήσεων\n•\tεξοικειωθούν στη χρήση σειριακών πρωτόκολλων επικοινωνίας\n•\tαντιληφθούν την επικοινωνία των μικροελεγκτών με ένα σύνολο περιφερειακών συσκευών\n•\tσχεδιάζουν συστήματα ολοκλήρωσης και απασφαλμάτωσης της πληροφορίας\n•\tαναπτύσσουν και να χρησιμοποιούν διαδικασίες απασφαλμάτωσης του λογισμικού και του υλικού \n•\tαναπτύσσουν εφαρμογές για τον τελικό χρήστη\n•\tχειρίζονται κάποια βασικά εργαλεία ανάπτυξης και ελέγχου λογισμικού και υλικού χρησιμοποιούνται σε επίπεδο εφαρμογής και να συγκρίνουν διάφορες μεθόδους υλοποίησης.\n•\tαναπτύσσουν και συνεργάζονται ομαδικά σε ένα ολοκληρωμένο έργο. \n"
        },
        "name": "Σχεδίαση Συστημάτων Υλικού-Λογισμικού"
      },
      {
        "code": "600196670",
        "humanCode": "104",
        "originalTitle": "Σύγχρονα Ενεργειακά Συστήματα",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196670",
        "professors": [
          "Δημήτριος Λαμπρίδης",
          "Μηνάς Αλεξιάδης",
          "Γεώργιος Ανδρέου",
          "Γρηγόριος Παπαγιάννης"
        ],
        "description": {
          "syllabus": "Ευέλικτα συστήματα μεταφοράς. Συστήματα ελέγχου άεργης ισχύος. Ρύθμιση ροής ισχύος. Ευελιξία στη λειτουργία των ΣΗΕ: διαχείριση ζήτησης, απόκριση ζήτησης, βοηθητικές υπηρεσίες, ευφυής έλεγχος φορτίων, συστήματα επιτήρησης και ελέγχου κατανάλωσης, συστήματα αποθήκευσης, συστήματα αποθήκευσης ηλεκτρικής ενέργειας, μπαταρίες, υπερπυκνωτές, στροφαλοι, υπεραγώγιμα πηνία, ηλεκτρικά οχήματα, αποθήκευση μη ηλεκτρικής ενέργειας, αποθήκευση θερμότητας, αποθήκευση μέσω συμπιεσμένου αέρα, υδραντλητικοί σταθμοί. Έξυπνα δίκτυα διανομής, μικροδίκτυα, εικονικά δίκτυα, έλεγχος τάσης σε δίκτυα διανομής, ελαχιστοποίηση απωλειών, δίκτυα συνεχούς ρεύματος.",
          "outcomes": "Η κατανόηση της δομής και λειτουργίας των σύγχρονων συστημάτων διανομής με διανεμημενους ενεργειακούς πόρους.\nΗ κατανόηση της λειτουργίας και των ιδιοτήτων των επιμέρους συνιστωσών και των λειτουργικών διαδικασιώνενός έξυπνου δικτύου ηλεκτρικής ενέργειας.\nΗ κατανόηση των προβλημάτων που προκύπτουν από την τοπική έγχυση ισχύος στο επίπεδο της διανομής και οι τεχνικές ελέγχου που μπορούν να εφαρμοστούν.\nΗ εμβάθυνση στη χρήση εργαλείων λογισμικού, και τεχνικών μοντελοποίησης κατάλληλων για υπολογισμούς ημί-μόνιμης και δυναμικής κατάστασης σε έξυπνα δίκτυα ηλεκτρικής ενέργειας."
        },
        "name": "Σύγχρονα Ενεργειακά Συστήματα"
      },
      {
        "code": "600196706",
        "humanCode": "124",
        "originalTitle": "Τεχνικές μη Καταστρεπτικών Δοκιμών",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196706",
        "professors": [
          "Δημήτριος Χρυσουλίδης",
          "Νικόλαος Κανταρτζής"
        ],
        "description": {
          "syllabus": "Εισαγωγή – Σύντομη ιστορική αναδρομή: Βασικοί ορισμοί, γενικά χαρακτηριστικά, παραδείγματα, είδη τεχνικών, σημαντικοί σταθμοί εξέλιξης, διαχωρισμός τεχνικών καταστρεπτικών και μη καταστρεπτικών δοκιμών, πιστοποίηση προσωπικού, οδηγίες διεξαγωγής ελέγχων, ασυνέχειες, σημασία και συμβολή των μεθόδων προσομοίωσης.\nΜέθοδος ραδιογραφίας: Ακτινοβολία, ακτίνες Χ και γ, διείσδυση ακτινοβολίας, συσκευές μέτρησης, οθόνες μολύβδου, δείκτες διείσδυσης, μεταβλητές που επηρεάζουν τη διαδικασία της μέτρησης, τεχνικές απλής και διπλής έκθεσης, παραδείγματα.\nΜέθοδος μαγνητικών σωματιδίων: Διαχωρισμός μετάλλων, φερρομαγνητικά υλικά, βασικές αρχές, βρόχος υστέρησης, παραμορφωμένα και διαρρέοντα πεδία, δοκίμια εφαρμογής, ασυνέχειες, μέσα ανίχνευσης, διαδικασίες μέτρησης.\nΜέθοδος δινορευμάτων: Αρχές λειτουργίας, χαρακτηριστικά των δινορευμάτων, στάδια ανάπτυξης και απόδοση της μεθόδου, διάγραμμα σύνθετης αντίστασης, παράγοντας ανύψωσης, εξοπλισμός και είδη μετρητών (πρόβολοι, πηνία, σφιγκτήρες), εφαρμογές.\nΜέθοδος υπερήχων: Ελαστικά κύματα (διαμήκη, εγκάρσια κύματα, κύματα Rayleigh), διατύπωση συντελεστών ανάκλασης και διάθλασης, μέσα προσαγωγής, πιεζοηλεκτρικό φαινόμενο, μετατροπείς, μέτρηση και συσκευές, τρόποι ψηφιακής απεικόνισης.\nΜέθοδοι οπτικού ελέγχου και διεισδυτικών υγρών: Ενδοσκόπιο, μέτρηση μήκους και πάχους, κάμερες υψηλής ευελιξίας, περιγραφή μονάδας διεισδυτικών υγρών, προετοιμασία δοκιμίων, διάγραμμα ροής διαδικασίας μέτρησης.\nΜικροκυματική υδρομετρία: διηλεκτρικές ιδιότητες ύδατος δεσμευμένου ή ελεύθερου, μετρήσεις ύδατος σε μείγματα, θεωρία μείξης διηλεκτρικών, ανίχνευση υδρογονανθράκων, διηλεκτρική φασματοσκοπία, μετρήσεις υγρασίας σε χιόνι, ξύλα και μονωτικές πλάκες.\nΧαρακτηρισμός υλικών: Άμεσος και έμμεσος χαρακτηρισμός, σύστημα μέτρησης, χαρακτηρισμός υλικών με μικροκυματικούς συντονιστές, μικροκυματικοί αισθητήρες για αυτόματο έλεγχο διαδικασιών παραγωγής, εφαρμογές και διατάξεις μέτρησης.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος, οι φοιτήτριες/τές θα έχουν αποκτήσει τις ακόλουθες δεξιότητες:\n\n- Να κατανοήσουν τις βασικές αρχές των τεχνικών μη καταστρεπτικών δοκιμών και την κατηγοριοποίηση των βασικών σφαλμάτων κατασκευής, κατεργασίας και χρήσης συσκευών.\n- Να αφοομοιώσουν και να υλοποιήσουν την τεχνική της μικροκυματικής υδρομετρίας για τον υπολογισμό της υγρασίας σε αντίστοιχες διατάξεις και να αναλύουν τις διηλεκτρικές ιδιότητες διαφόρων υλικών.\n- Να υλοποιήσουν συγκεκριμένες τεχνικές μη καταστρεπτικών δοκιμών μέσω σειράς επιλεγμένων εργαστηριακών εργασιών που περιλαμβάνουν τη θεωρητική ανάλυση των εμπλεκόμενων ηλεκτρομαγνητικών φαινομένων, τη σχεδίαση και κατασκευή πρότυπης μετρητικής διάταξης, την προσομοίωση και παραμετρική ανάλυση των κύριων χαρακτηριστικών της, καθώς και την αποτίμηση της λειτουργίας της μέσω σειράς εργαστηριακών μετρήσεων και συγκρίσεων.\n- Να εξοικειωθούν με τη χρήση σύνθετου εργαστηριακού εξοπλισμού για τη διεξαγωγή μετρήσεων και την εκμάθηση συγκεκριμένων αριθμητικών τεχνικών για την προσομοίωση των αποτελεσμάτων."
        },
        "name": "Τεχνικές μη Καταστρεπτικών Δοκιμών"
      },
      {
        "code": "600196730",
        "humanCode": "122",
        "originalTitle": "Τεχνολογία του Ήχου και της Εικόνας: Αποθήκευση, Επεξεργασία, Μετάδοση",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196730",
        "professors": [
          "Χαράλαμπος Δημούλας"
        ],
        "description": {
          "syllabus": "Καταγραφή και ψηφιοποίηση οπτικοακουστικού σήματος, Αποθήκευση /αναπαραγωγή ηχητικού και οπτικοακουστικού περιεχομένου (αναλογικά και ψηφιακά μέσα, γραμμικά /μη-γραμμικά), Αλγόριθμοι και πρότυπα συμπίεσης ήχου, ακίνητης και κινούμενης εικόνας, Συστήματα επεξεργασίας ακουστικού και τηλεοπτικού σήματος, Μετάδοση ήχου /εικόνας, Διαδικτυακό ραδιόφωνο /τηλεόραση, Τηλεόραση Υψηλής Ευκρίνειας -HD, Ψηφιακός κινηματογράφος, Στερεοφωνικά (περιφερικά) συστήματα πολλών καναλιών, Στερεοσκοπικά συστήματα κινούμενης εικόνας, Τεχνικές διαχείρισης και σημασιολογικής επεξεργασίας οπτικοακουστικού περιεχομένου.",
          "outcomes": "Με την επιτυχή ολοκλήρωση του μαθήματος οι φοιτητές/-τριες θα έχουν αποκτήσει θεωρητικές και πρακτικές γνώσεις για καταγραφή και ψηφιοποίηση σημάτων ήχου και εικόνας, μέσα εγγραφής, μεθόδους επεξεργασίας, εργαλεία ανάλυσης και διαχείρισης δεδομένων ήχου και εικόνας. Θα έχουν εξοικειωθεί με τεχνολογίες συμπίεσης και κωδικοποίησης οπτικοακουστικής πληροφορίας (MPEG, JPEG, codecs κλπ.), με συστήματα και εφαρμογές “μετάδοσης ροής” (streaming). Θα έχουν αποκτήσει τεχνογνωσία στην εξαγωγή και χρήση παραμέτρων περιγραφής ήχου και εικόνας (features), σε αλγορίθμους μηχανικής βαθιάς μάθησης (machine /deep learning), σε σύνθετες τεχνικές σημασιολογικής ανάλυσης, διαχείρισης και ανάκτησης πολυμεσικού περιεχομένου. Συνολικά, οι φοιτητές /-τριες θα είναι σε θέση να κατανοούν και εφαρμόζουν τις σύγχρονες τεχνολογίες αποθήκευσης, επεξεργασίας και μετάδοσης ήχου – εικόνας, όπως διαμορφώνονται στη σημερινή εποχή των Μεγάλων Δεδομένων (Big Data) και του Σημασιολογικού ιστού (Semantic Web)."
        },
        "name": "Τεχνολογία του Ήχου και της Εικόνας: Αποθήκευση, Επεξεργασία, Μετάδοση"
      },
      {
        "code": "600196649",
        "humanCode": "105",
        "originalTitle": "Υπολογιστικές Μέθοδοι στα Ενεργειακά Συστήματα",
        "ects": 4,
        "status": {
          "en": "ET",
          "el": "E",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196649",
        "professors": [
          "Γρηγόριος Παπαγιάννης",
          "Μηνάς Αλεξιάδης"
        ],
        "description": {
          "syllabus": "Ανάλυση δυναμικών καταστάσεων στα ΣΗΕ, ιστορική εξέλιξη, μεθοδολογίες υπολογισμού, διαθέσιμα λογισμικά, το πρόγραμμα ΕΜΤΡ – ΑΤΡ. Μοντελοποίηση δικτύων με συγκεντρωμένες παραμέτρους. Γραμμές μεταφοράς με διανεμημένες παραμέτρους στο πεδίο του χρόνου. Μοντελοποίηση στο πεδίο των συχνοτήτων. Μοντελοποίηση υπογείων καλωδίων ισχύος. Μοντελοποίηση πηγών, διακοπτών. Μοντέλα στρεφόμενων μηχανών, σύγχρονες, ασύγχρονες γεννήτριες. Μεταβατικά φαινόμενα από διακοπτικές λειτουργίες. Μεταβατικά φαινόμενα από ατμοσφαιρικές διαταραχές. Απαγωγείς υπερτάσεων και συντονισμός μονώσεων. Ανάλυση σφαλμάτων σε εγκαταστάσεις ισχύος, Ιστορική αναδρομή. Μεθοδολογίες υπολογισμού, διαθέσιμα λογισμικά. Υπολογισμοί σφαλμάτων σε 3φ συστήματα ac κατά IEC 60909. Μοντελοποίηση συσκευών και συστημάτων. Υπολογισμοί ρευμάτων βραχυκύκλωσης, συντονισμός προστασίας.",
          "outcomes": "Η κατανόηση των τεχνικών της μοντελοποίησης και των υπολογισμών σε εκτεταμένα δίκτυα συστημάτων ηλεκτρικής ενέργειας.\nΗ κατανόηση της λειτουργίας και των ιδιοτήτων των δυναμικών μοντέλων τυπικών συνιστωσών συστημάτων ηλεκτρικής ενέργειας.\nΗ εμβάθυνση στη χρήση εργαλείων λογισμικού, κατάλληλων για την ανάλυση δυναμικών φαινομένων και τους υπολογισμούς σφαλμάτων και προστασίας σε δίκτυα ηλεκτρικής ενέργειας.\n"
        },
        "name": "Υπολογιστικές Μέθοδοι στα Ενεργειακά Συστήματα"
      },
      {
        "code": "600196708",
        "humanCode": "126",
        "originalTitle": "Φωτονική Τεχνολογία",
        "ects": 4,
        "status": {
          "en": "E",
          "el": "E",
          "tel": "ET"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196708",
        "professors": [
          "Εμμανουήλ Κριεζής"
        ],
        "description": {
          "syllabus": "Οπτικοί συντονιστές και κοιλότητες Fabry-Perot. Δομές πολλαπλών διηλεκτρικών στρωμάτων. Οπτικά φίλτρα. Διάδοση φωτός σε κρυστάλλους και σχετικές διατάξεις. Συνκατευθυντική και αντικατευθυντική σύζευξη - μαθηματικό πλαίσιο θεωρίας συζευγμένων ρυθμών. Διατάξεις συζευγμένων ρυθμών. Έλεγχος οδηγούμενων οπτικών κυμάτων. Ηλεκτροπτικό φαινόμενο, διαμορφωτές φάσης, οπτικοί διακόπτες. Ολοκληρωμένες οπτικές/φωτονικές διατάξεις και κυκλώματα. Συμβολόμετρα. Φράγματα παράθλασης και διατάξεις ελεύθερου χώρου, MUX, DEMUX. Υλικά και τεχνικές κατασκευής οπτικών κυματοδηγών και ολοκληρωμένων οπτικών κυκλωμάτων. Οπτικοί ενισχυτές ντοπαρισμένης ίνας Ερβίου (EDFA) και οπτικοί ενισχυτές ημιαγωγού (SOA).",
          "outcomes": "1. Οπτικοί συντονιστές τύπου Fabry-Perot.\n2. Λεπτομερής ανάλυση δομών με πολλαπλά διηλεκτρικά στρώματα.\n3. Λεπτομερής κατανόηση βασικών φωτονικών στοιχείων, όπως ο κατευθυντικός ζεύκτης, τα φίλτρα/φράγματα Bragg, τα συμβολόμετρα Mach-Zehnder και οι οπτικοί διακόπτες.\n4. Κατανόηση του ηλεκτροπτικού φαινομένου και της λειτουργίας των οπτικών διαμορφωτών.\n5. Γενικά κατανόηση της τεχνολογίας των ολοκληρωμένων οπτικών/φωτονικών κυκλωμάτων.\n6. Βασικά στοιχεία οπτικών ενισχυτών (EDFA, SOA)."
        },
        "name": "Φωτονική Τεχνολογία"
      },
      {
        "code": "600196728",
        "humanCode": "118",
        "originalTitle": "Ψηφιακά Ολοκληρωμένα Κυκλώματα VLSI-ASIC Μεγάλης Κλίμακας",
        "ects": 5,
        "status": {
          "en": "E",
          "el": "ET",
          "tel": "E"
        },
        "qa": "https://qa.auth.gr/el/class/1/600196728",
        "professors": [
          "Αλκιβιάδης Χατζόπουλος"
        ],
        "description": {
          "syllabus": "Η ύλη του μαθήματος αποτελείται από 10 βασικές ενότητες οι οποίες περιλαμβάνουν:\n\n1. Εισαγωγικό υλικό/Ορισμοί/Ορολογία\n2. Τεχνικές Σχεδίασης Ψηφιακών Ολοκληρωμένων Χαμηλής Ισχύος\n3. Στατική Ανάλυση Χρονισμού (STA)\n4. Διαχωρισμός Κυκλωμάτων (Partition)\n5. Χωροθέτηση Κυκλωμάτων (Floorplanning)\n6. Τοποθέτηση Κυκλώματος (Placement)\n7. Δρομολόγηση (ή Διασύνδεση) (Routing)\n8. Δίκτυα Διανομής Σήματος Ρολογιού (CTS)\n9. Σχεδίαση για Δοκιμαστικότητα (DFT)\n10. Οργάνωση και Σχεδίαση Μνήμης SRAM\n\nΓια κάθε μία από τις ενότητες αυτές παρουσιάζονται παραδείγματα και σχετικοί αλγόριθμοι όπου αυτό είναι απαραίτητο και χρήσιμο.\n\nΟι εργαστηριακές ασκήσεις του μαθήματος περιλαμβάνουν τη χρήση των εργαλείων της Cadence για τη σχεδίαση κυκλωμάτων VLSI-ASIC όπου οι φοιτητές καλούνται να υλοποιήσουν ένα ψηφιακό κύκλωμα με τη χρήση του παρεχόμενου εγχειριδίου του εργαστηρίου.",
          "outcomes": "1. Εκμάθηση βήμα προς βήμα της ροής σχεδίασης ψηφιακών κυκλωμάτων μεγάλης κλίμακας (VLSI) ξεκινώντας από το βήμα της σύνθεσης μέχρι το βήμα της δρομολόγησης και sign-off.\n2. Εφαρμογή των αρχών και εννοιών ανάλυσης χρονισμού ψηφιακών κυκλωμάτων VLSI.\n3. Εκμάθηση τεχνικών σχεδίασης για χαμηλή κατανάλωση ισχύος σε πολλαπλά επίπεδα της αφαίρεσης σχεδίασης.\n4. Εξοικείωση με το πρόβλημα διανομής του σήματος ρολογιού και τους σχετικούς αλγορίθμους σύνθεσης δικτύων διανομής ρολογιού σε κυκλώματα VLSI.\n5. Εξοικείωση με τα βασικά κυκλώματα και τεχνικές σχεδίασης κυκλώματων μνήμης SRAM.\n"
        },
        "name": "Ψηφιακά Ολοκληρωμένα Κυκλώματα VLSI-ASIC Μεγάλης Κλίμακας"
      }
    ]
  }
}
